{
  "by": [
    "In close proximity to; near.",
    "As a function word, used to indicate movement in the direction of or toward something, as in \"He walked by the house.\"",
    "To indicate where an action took place, as in \"She baked the cookies by the fireplace.\"",
    "In the course of; during.",
    "As a part of or included within; comprising."
  ],
  "brick": [
    "A rectangular unit of building material, typically made from fired clay and used to construct walls, arches, or other structures.",
    "A piece of a particular type of thing considered as a unit, especially one that is not very large: \"a brick in the wall of our defense\"",
    "A block of compressed earth, cement, or similar material, used for building or paving purposes.",
    "Informal term for a difficult or trying situation; a problem to be solved.",
    "A thick, heavy book made up of many pages glued together at one edge and bound in paper, plastic, or leather."
  ],
  "lasso": [
    "A rope with a loop at one end, used to catch or restrain animals, especially by encircling their legs, neck, or horns.",
    "The act of catching or restraining an animal using a lasso.",
    "A device for catching fish, similar in principle to a fishing net but made from a single flexible and elastic line that expands when pulled taut around the caught fish.",
    "A sports activity where participants attempt to catch a small ring, called a burro, by swinging a looped rope.",
    "In computer science, a programming construct used to assign a value from one variable to another or to update a variable's value based on certain conditions."
  ],
  "dark": [
    "Lacking light; having little or no illumination or brightness, as night contrasted with day.",
    "Relating to or denoting a color that absorbs all visible wavelengths of light and appears black.",
    "A region or place without sufficient light for seeing objects distinctly.",
    "Difficult to understand; mysterious: dark secrets.",
    "Ominous, evil, or sinister in character or effect: dark forces."
  ],
  "use": [
    "To employ (something) for a practical purpose; to utilize or apply something in an intended or proper manner.",
    "To consume or expend a resource, such as time, energy, or money; to make use of something until it is exhausted.",
    "To make the best possible use of available resources, tools, or abilities; to optimize one's situation or performance.",
    "To apply (a word) in speech or writing in accordance with the rules of grammar and syntax, especially in a natural and effective way.",
    "To draw upon (an idea, concept, or experience) for guidance or inspiration, especially when faced with a similar situation."
  ],
  "braid": [
    "A woven structure made by interweaving strands of hair, fiber, or other flexible materials; a plaited design formed by interlacing three or more parts.",
    "To create such a woven design by weaving together strands in an intricate pattern.",
    "In the context of genetics, a linear arrangement of genes located on a chromosome and transmitted as a unit during reproduction.",
    "A group of people or things closely connected; a tightly bound collection.",
    "In sports, a type of pass or ball movement where one player passes the ball to another who then passes it back to the original player, creating a link between them."
  ],
  "bun": [
    "A small round loaf of bread, typically made from yeasted dough and often used as a base for sandwiches or burgers.",
    "A roll-shaped portion of a hairstyle, often tied up with an elastic band or secured with pins.",
    "In slang, a sum of money, especially when referring to a small or unspecified amount.",
    "In informal language, a term for a person's bottom or posterior.",
    "In informal language, a term for the protective casing or \"head\" of a bullet or shell in firearms."
  ],
  "that": [
    "As a demonstrative pronoun and adjective, referring to people, animals, places, things or ideas previously mentioned or easily identified: \"She bought an umbrella that was on sale.\"",
    "As a relative pronoun introducing a clause or phrase giving additional information about a preceding subject or predicate: \"The book I borrowed from the library was written by an author who is unknown to me.\"",
    "As a subordinating conjunction linking two independent clauses, expressing a contrast or concession: \"Although he was tired, he decided to go out for dinner.\"",
    "In certain dialects, as an interrogative pronoun asking for specific information: \"Can you tell me what that is?\"",
    "In some contexts, especially in formal writing or speech, as a filler word used to create pauses or emphasize a point: \"The project was successful, that is, more successful than anyone anticipated.\""
  ],
  "slain": [
    "Killed or caused to die; put to death (usually referring to a violent or forceful manner).",
    "(Of someone or something) killed in battle, combat, or fighting.",
    "(Of an animal or plant) hunted and killed for food or sport.",
    "(Of a victim) murdered or assassinated.",
    "(Of a person or character) to die in a story or narrative, often with dramatic effect."
  ],
  "ten": [
    "An even number that follows nine and precedes eleven in the count of integers, written as \"10\" or as \"X\" (Roman numeral) or as \"೦೧೦\" (Kannada numeral).",
    "A cardinal number representing a quantity or number, such as there are ten people in the room.",
    "A digit of the base ten positional numeral system.",
    "A term used to represent a specific number of items, such as a team of ten players.",
    "One of the ten Amendment articles added to the U.S. Constitution."
  ],
  "sat": [
    "Past tense of the verb \"sit.\"",
    "A type of Indian dish made from lentils and spices, often served with rice or bread.",
    "Abbreviation for \"Satellite\".",
    "A constellation of stars in the northern celestial hemisphere.",
    "A unit of time equal to six minutes and twenty-four seconds in a Mayan calendar."
  ],
  "quack": [
    "A person who falsely claims to have special knowledge or skill, especially in a field such as medicine or finance.",
    "An imitation of the loud call made by certain waterbirds, typically made by humans for fun or to attract attention.",
    "A physician, specifically one lacking recognized qualifications and training.",
    "Informal term for a person who is pretentious or self-important.",
    "A wooden clog used for walking on ice or in swampy areas."
  ],
  "sky": [
    "The space above the Earth, visible in the absence of obstacles and filled with the atmospheric phenomena such as clouds, birds, and weather conditions.",
    "In painting or photography, an area of a work treated as representing the sky; often portrayed in shades of blue or other colors, indicating openness, vastness, and freedom.",
    "A metaphorical representation for one's prospects or opportunities; used to express feelings of hope or despair, depending on the context.",
    "In aeronautics or aviation, the upper limit of the Earth's atmosphere where aircraft can operate safely; also known as \"flight level.\"",
    "A term in poetry or literature to refer to the concept of lofty aspirations, dreams, or ideals."
  ],
  "rock": [
    "A large mass of stone that forms a cliff, hill, or part of the earth's surface.",
    "A type of solid substance formed from minerals bonded together by heat and pressure.",
    "To move rhythmically to music, typically in dance.",
    "To be determined or decided on; settle.",
    "To cause (someone) to experience strong feelings of sympathy or admiration."
  ],
  "chill": [
    "A feeling of coldness caused by low temperatures or exposure to the air.",
    "The state of being relaxed and calm, often associated with a laid-back attitude.",
    "An inactive period or pause in a situation or event, as in \"a chill in diplomatic relations.\"",
    "A feeling of fear or apprehension, as in \"a chill ran down my spine.\"",
    "In music, a brief pause or moment of silence."
  ],
  "moss": [
    "A dense, low-growing plant made up of small greenish-gray leaves that grows in damp places and on trees.",
    "A soft, cottony substance that covers rocks or the ground in certain areas.",
    "An informal term for a thick growth of something undesirable, such as algae or fungus.",
    "In textiles, a type of insulation used to keep warmth in and cold out.",
    "A natural material used in gardening to create moisture-retaining environments."
  ],
  "pig": [
    "An omnivorous mammal of the family Suidae, characterized by a stout and short-legged body with a thick skin often covered in coarse bristly hairs, a long curved snout, a deep bellowing vocalization, and a large head bearing a muscular lower jaw used for rootling and digging, typically found in domestic or feral forms. Domesticated pigs are raised mainly for their meat (pork) or as livestock, while wild boars live in forests throughout Eurasia and North America.",
    "The young of this animal, called piglets, which are born blind and hairless, growing rapidly to become mature pigs.",
    "A person who is regarded as overly greedy or self-interested, often used disparagingly; a term derived from the proverbial expression \"as greedy as a pig,\" based on the animal's foraging habits.",
    "An informal term referring to a high-quality, well-designed computer, especially one with extensive capabilities and power, so called because such machines are able to handle complex tasks as easily as a pig can root through the ground in search of food.",
    "In slang or colloquial language, 'pig' can also refer to a police officer, particularly one who is perceived as overly aggressive or authoritarian. This usage originated from the 1960s and has been used in various countercultural contexts since then."
  ],
  "blaze": [
    "A bright light produced by the rapid combustion of a material, such as wood, gasoline or an explosive substance, typically emitting intense heat and smoke.",
    "A flame or series of flames, especially one that is burning out of control, such as in a forest fire or prairie fire.",
    "A brilliant light, such as the sun or a star, often used metaphorically to describe someone or something that stands out due to their brilliance or prominence.",
    "A striking color or hue, typically one that is bright and eye-catching.",
    "The sound made by gunpowder when ignited or exploding, often used as a signal or alarm."
  ],
  "stay": [
    "To remain in a place, position, state, or condition without changing; to not move from one's current location or situation.",
    "To continue doing something for a period of time or until a particular event occurs; to persist or persevere.",
    "To support and maintain the shape, structure, or strength of something; to keep firm or steady.",
    "In law, to delay or prevent the enforcement of a legal decision, judgment, or decree; to suspend or postpone its execution.",
    "In architecture, a structural member used to hold up or support another part of a building or structure."
  ],
  "scold": [
    "To reprimand or criticize harshly and angrily, especially for misbehavior or faults.",
    "A person who habitually rebukes others in a harsh, angry manner.",
    "A harsh or angry reproof; a tongue-lashing.",
    "(Obsolete) To boil or scald with steam or water; to scald.",
    "To reprimand sharply and angrily, especially in a womanly way; to chide, upbraid, or reproach with sharp, angry words, often for minor faults or misdeeds."
  ],
  "swing": [
    "A rhythmic to-and-fro motion of something suspended by, or attached to, two points, as a door swinging open or closed or a pendulum moving back and forth.",
    "To cause or allow to move in a swinging motion; sway.",
    "A series of events that unfold naturally without intervention; the course things take on their own.",
    "An act or instance of changing allegiance, affiliation, or belief from one thing to another.",
    "An informal agreement between two sides in a dispute to suspend hostilities for a period of time, often to allow diplomatic negotiations to proceed."
  ],
  "game": [
    "An activity involving physical and/or mental skill, typically providing amusement and enjoyment for those participating in it.",
    "A competitive or recreational activity that follows a set of rules and has a quantifiable outcome.",
    "A form of entertainment, such as a video game, board game, or card game.",
    "A single round or part of a larger competition or contest.",
    "A natural habitat or abode for an animal, used particularly in the study of wildlife."
  ],
  "cry": [
    "To express strong emotions, such as sadness, anger, or joy, by making a loud and emotional sound with the voice, typically through the act of sobbing or weeping.",
    "A loud and emotional sound produced by the human voice, often expressing strong feelings or used to gain attention.",
    "A short exclamation or interjection expressing shock, pain, joy, etc., such as \"Ouch!\" or \"Wow!\"",
    "To make a shrill, high-pitched sound, typically produced by birds or insects, rather than humans.",
    "To call out to someone or something, usually to gain their attention or summon them."
  ],
  "here": [
    "In this specific location or place; at the point being referred to or indicated.",
    "Present or happening at the moment or time being considered; now or currently.",
    "Close by or nearby, as in physical space.",
    "Used to emphasize agreement or concession, as in response to an objection or counterargument.",
    "Informal and colloquial term for the present time or moment."
  ],
  "soak": [
    "To absorb moisture by saturation; become saturated with liquid.",
    "To immerse in a liquid to soften or cleanse, especially by allowing the liquid to penetrate thoroughly.",
    "To allow (something) to soak up water or another liquid, usually by leaving it submerged.",
    "To leave something in a wet state for a period of time, often in order to remove stains or odors.",
    "To be filled with tears due to strong emotions."
  ],
  "each": [
    "Separately; individually; each person or thing considered on their own: \"There are five people in the room, so there are five votes on each issue.\"",
    "In turn; one after another; sequentially: \"We went through the list of questions, asking each one aloud.\"",
    "For or appertaining to each individual; respectively: \"Each person must sign their own name on the form.\"",
    "Each and every; without exception; all: \"Everyone in the class was given a prize, meaning each student received one.\"",
    "Each (adjective and pronoun) - referring to one member of a set of two or more things or people being considered individually; used in sentences to indicate that an action is applied separately to each element in the group."
  ],
  "ink": [
    "A liquid or semi-solid substance containing pigments, dyes, or other substances that can be applied to a surface, typically paper, for the purpose of writing, printing, drawing, or painting.",
    "In ancient times, certain inks were made from a mixture of soot and water, and later with the addition of gum arabic as a binder, which was used mainly by scribes for writing on parchment or papyrus.",
    "In modern times, ink can be found in various forms such as liquid, gel, or pigmented powder, and is used in different applications like fountain pens, ballpoint pens, drawing instruments, printers, and tattooing equipment.",
    "The term 'ink' may also refer to the process of creating artwork using this medium or the art style that involves the use of ink as a primary material.",
    "In digital contexts, 'ink' can represent the graphical elements such as lines, shapes, and text produced by computer software, particularly in drawing programs."
  ],
  "toss": [
    "To throw or cast something with a sudden, forceful motion.",
    "To change places suddenly or repeatedly, often by flipping or spinning.",
    "To move or swing back and forth, as in tossing one's head from side to side.",
    "To mix or blend thoroughly, as when tossing a salad.",
    "To raise or lift (something) up and then release it so that it falls back down."
  ],
  "slump": [
    "A sudden and marked decline in something, such as the economy, sales, or morale.",
    "A deep, long, or steep-sided hollow or depression in the ground, especially one formed naturally by erosion or landslides.",
    "To drop down or sink suddenly into a slump or similar depression, often with an implied sense of tiredness or exhaustion.",
    "In sports, a sudden and dramatic loss of form or performance, typically in a game or competition.",
    "A slow, heavy walk or gait, often due to physical fatigue or disinterest."
  ],
  "sled": [
    "A lightweight vehicle with a flat bottom and runners, used for sliding on ice or snow, typically drawn by horses or pulled by people.",
    "A large, flat platform or tray designed to transport heavy loads over snow-covered ground.",
    "An object resembling a sled in form but used primarily for aesthetic purposes, such as a decorative centerpiece at a winter celebration.",
    "The act of riding or traveling on a sled, especially downhill.",
    "A small toy model of a sled, often made of wood or plastic and intended for children to play with."
  ],
  "his": [
    "Indicating possession or relation to a male person or animal previously mentioned or easily identified; used as an possessive determiner or pronoun equivalent to \"his\" in \"The book is his.\"",
    "Used to indicate the possession, relationship, or connection to something belonging to a male person or animal; for example, \"She wore her own dress and he wore his suit.\"",
    "In possessive constructions, taking the place of a noun or pronoun that identifies what is owned or possessed by a male person or animal; as in, \"This is mine, and those are yours - but what are his?\"",
    "Indicating possession by a male person previously mentioned or easily identified; \"The book on his desk\" (the book belongs to the person previously mentioned or easily identified as male).",
    "Used of a possessive pronoun or adjective to indicate that something belongs to a man or men; \"his money\" (the money belongs to one or more men)."
  ],
  "table": [
    "A piece of furniture with a flat top and one or more legs, providing a level surface for various purposes such as eating meals, writing, working on documents, or displaying objects.",
    "An arrangement of data in rows and columns, representing information that can be sorted, searched, and analyzed by various software applications.",
    "A list of items, often in alphabetical order, used to organize information or for quick reference.",
    "A flat surface on which games or puzzles are played, like a game table or chessboard.",
    "In sports, such as tennis, a term for the part of the court where the net is located and where most of the action occurs."
  ],
  "with": [
    "Accompanied by; in the company of: I went to the store with my friend.",
    "In association or combination with: The two ideas were presented with a clear contrast.",
    "Indicating that something is added to or included in something else: She made the list with her own thoughts.",
    "Instrumental in bringing about; responsible for: The new manager was with setting up the company's policies.",
    "Used to indicate a point of similarity or comparison: He is with his brother in their love for sports."
  ],
  "maze": [
    "A complicated and intricate network of paths or passages from which it is difficult to find a way out; a complex network of paths or passages that are intended to confuse and challenge the one who navigates through them, often found in gardens, parks, or as a puzzle design.",
    "An area or region that is difficult to navigate due to its complex and interwoven streets, alleys, or buildings; a labyrinthine or confusing neighborhood or urban layout.",
    "Figuratively, a situation or problem that is difficult to solve or understand due to its complexity and interconnectedness of elements; a perplexing issue or challenge.",
    "A complex and intricate network of paths or passages, typically designed to confuse and challenge those attempting to navigate through it.",
    "A piece of land that has been arranged in a complicated pattern of paths, usually with the intention of creating an attraction for visitors to explore and solve."
  ],
  "have": [
    "To possess or own (something) as a physical possession or in a metaphorical sense.",
    "To experience or undergo (a particular situation, emotion, or state).",
    "To include or contain (something) as an essential element or ingredient.",
    "To be responsible for (someone or something), especially as a duty or obligation.",
    "To make (someone) aware of or inform (someone) about (something)."
  ],
  "stuck": [
    "Unable to move, proceed, or continue due to an obstruction or difficulty; having become fixed or immovably fastened in a position or situation.",
    "Fixed or firmly attached, as in 'stuck to' something else.",
    "Unable to progress or make further headway, as in being 'stuck' in a rut or a dead-end job.",
    "In slang terms, referring to an emotional attachment that is difficult to break.",
    "Figuratively, to be caught or hindered by some situation or circumstance."
  ],
  "out": [
    "In a position exposed to the air; not enclosed or sheltered; as in \"He stood out in the open air.\"",
    "Having finished, completed, or exhausted one's term of service or employment; discharged or retired; as in \"After years of service, he was finally out.\"",
    "No longer involved in a particular activity or situation; as in \"He is out of the project now.\"",
    "Not functioning properly; broken or faulty; as in \"The machine is out.\"",
    "Of or pertaining to an outside area, place, or position; as in \"Let's go out for dinner.\""
  ],
  "tree": [
    "A tall perennial plant with a single stem or trunk, supporting leaves or needles and flowers, and bearing seeds or fruits that are not a berry, usually having a well-defined shape and a more or less conical outline when in leaf or fruit; specifically any of various woody plants that have a main body resembling this.",
    "A large or stately such plant, especially one that is tall and has a single trunk and branches with leaves and flowers; the term is often used to refer to species such as oak, maple, beech, fir, pine, cedar, etc., although it can apply to many other kinds of woody plants.",
    "A part or branch of a tree or plant that is cut off, peeled, and dried for use in making baskets, furniture, paper, etc.; a piece of such material.",
    "The wood of a tree, especially when used as a building material; lumber or timber.",
    "A horizontal beam or bar, often formed from the branch of a tree, used for structural support, as in a roof or bridge, or to hang something from, as in a shelf or chandelier."
  ],
  "note": [
    "A musical sound produced by a vibrating string, key, or column of air on an instrument; in modern music theory, the basic unit of melody, rhythm, and harmony.",
    "A symbol representing such a sound, placed on a sheet of music to indicate which note should be played.",
    "Something worthy of being remembered; an important detail or fact.",
    "An entry in a record, diary, or account book, typically recording an event or transaction.",
    "A short written or printed record of something said or done, especially in a newspaper, magazine, or periodical."
  ],
  "vile": [
    "Wretched or deplorable in quality, character, or condition; abject or despicable: a vile criminal.",
    "Of low moral or social standing; base or mean: a vile person.",
    "Repulsive to the senses, especially taste or smell: vile food.",
    "Offensive or injurious to health: vile air.",
    "Of or containing poisonous substances or organisms; toxic: a vile plant."
  ],
  "catch": [
    "To seize, take hold of, or intercept something that is moving or about to escape: He caught the ball thrown by his friend.",
    "To become entangled in or fastened by something: My sweater caught on the tree branch as I walked by.",
    "To become infected with a disease, especially one transmitted by an insect bite: Many people who visit this area catch malaria.",
    "To become aware of or understand (something) by means of observation or experience: He finally caught on to what we were trying to tell him.",
    "To cheat or deceive someone: The con artist was able to catch his victims off guard."
  ],
  "fish": [
    "A member of a large and diverse group of gill-bearing aquatic craniate animals that live mostly in the water and have streams of blood, typically having scales, fins, and a centralized notochord as a skeletal support in the early stage of life (called a fish larva),",
    "A popular term used to describe a type of animal that lives underwater and has gills for breathing, typically found in rivers, lakes, oceans, and seas.",
    "The common name given to certain species of aquatic animals, such as salmon, trout, bass, and cod.",
    "A term used to collectively refer to all types of fish, both freshwater and saltwater, which are often consumed as food by humans.",
    "An informal term for a person who is considered odd or unusual, often due to their behavior or appearance."
  ],
  "an": [
    "In linguistics, \"an\" is a grammatical indefinite article used before words beginning with certain consonant sounds in English. It is commonly used for vowel sounds and syllables starting with a consonant sound at the beginning of a word. For example: an apple, an orange, an umbrella.",
    "In mathematics, \"an\" is often used as a placeholder to represent an unspecified item in a particular set or group, typically in proofs and equations. For example: for any real number x, ax + b = c has exactly one solution; an equation that cannot be solved.",
    "In music, \"an\" can refer to a note of indeterminate pitch in staff notation, indicated by a small circle. This is typically used when specifying the duration or rhythm of a particular measure without indicating a specific pitch. For example: an eighth-note rest, an eight-bar phrase.",
    "In programming languages and computer science, \"an\" can be used to represent an unspecified value or variable in certain cases. For example: for any integer n, the function f(n) returns true if n is even; for each node an in the binary tree.",
    "A definite article used before vowels and some consonants in English (e.g., \"an apple\", \"an elephant\")."
  ],
  "rug": [
    "A large piece of soft material used as a covering for the floor, typically one that can be easily rolled up and moved.",
    "An area or region with a distinctive character or atmosphere; a place where certain activities are concentrated or dominant.",
    "In rugby, an act of playing the ball on the ground in order to allow teammates time to move into position before continuing play.",
    "A short-lived, unstable meteorological phenomenon characterized by strong winds and heavy precipitation; also known as a \"macroburst\" or \"microburst.\"",
    "In weaving, the raised pattern formed by the alternating warp threads in plain weave."
  ],
  "gusty": [
    "Characterized by strong, sudden, and brief bursts of wind; blustery or windy.",
    "Describing food that has intense and strong flavors or spices.",
    "In dancing or choreography, a short, sharp movement or series of movements.",
    "Relating to or denoting a style of painting characterized by bold brushwork, often depicting dynamic scenes of movement and energy.",
    "Describing a sudden and strong wind, often associated with brief bursts of intense air movement or short-lived gusts."
  ],
  "will": [
    "The faculty of choosing or deciding; free will.",
    "A formal declaration by which a person disposes of his or her property after death.",
    "A determination to carry out a plan or action; firm resolve.",
    "A power granted to an individual or body to make decisions, choices, and execute actions on behalf of another person or entity.",
    "The ability to exert control over one's own actions and behaviors."
  ],
  "page": [
    "A sheet of paper or parchment in a book, especially one blank or almost blank on one side, that is turned over during reading so that the written or printed side faces outwards.",
    "A single screen or a part of a website displayed on a computer, tablet, or smartphone as an electronic substitute for a physical page.",
    "One of several screens in a slideshow presentation, each containing a different image, text, or other content.",
    "In the context of computer programming, a section of code or data that is temporarily stored in memory to be accessed by the processor without needing to access the main storage.",
    "A person, especially a young boy, who attends on or serves someone, such as a nobleman or lady."
  ],
  "sock": [
    "A close-fitting knitted garment that covers the foot and is typically worn under shoes.",
    "A short-handled tool with a flat, heavy head used for pounding nails or breaking up hard surfaces.",
    "A sockets (e.g., electrical or mechanical components) that are designed to fit together or into another device.",
    "A small bag filled with a substance, such as flour or rice, which can be thrown at targets during a game or celebration.",
    "In slang, an informal term for expressing surprise, anger, or disappointment (e.g., \"I was really annoyed when I found out the movie was sold out - that really gave me a sock in the jaw!\")."
  ],
  "lark": [
    "A small, agile bird with a short tail and a cheerful song; belongs to the family Alaudidae.",
    "An amusing or playful person or action.",
    "A light-hearted prank or joke.",
    "An adventurous or exciting activity or adventure, typically undertaken for pleasure rather than necessity.",
    "A wild and unrestrained romp or spree; often involving alcohol or other intoxicants."
  ],
  "big": [
    "Of considerable size, extent, quantity, number, or degree; large.",
    "Adult; full-grown.",
    "Important or significant in status, influence, or value.",
    "Showing generosity or hospitality.",
    "Having great power, authority, or force; mighty."
  ],
  "snow": [
    "A precipitation of ice crystals falling from clouds in the form of white flakes or granules.",
    "The frozen water that forms a layer on the ground in cold climates, usually during winter.",
    "A light and airy dessert made from beaten egg whites, sugar, and flavorings, often topped with whipped cream and fruit.",
    "(informal) To cover someone or something with something similar to snow, like a light and fluffy material.",
    "(slang) To make something boring or uninteresting."
  ],
  "fell": [
    "Of or relating to wood from a coniferous tree, especially fir, pine, or spruce.",
    "In a state of being on the ground or fallen; prostrate;",
    "Made of, covered with, or producing an oily or resinous substance; as, a pine is a tree that has fell gum; a rock is fell rock if it exudes oil.",
    "(Of a tree) cut down and left lying where it has fallen.",
    "(Chiefly of animals) having fur or hair long enough to lie flat against the body when the animal is in motion."
  ],
  "spin": [
    "To cause an object to rotate or revolve rapidly about an axis.",
    "To twist fibers together to form yarn, thread, or rope.",
    "To turn or cause to revolve in a particular direction or about an axis.",
    "A brief account of something or an opinion expressed.",
    "To give a detailed explanation of something."
  ],
  "may": [
    "May (noun) - a drink made from the sap of the maple tree, often consumed during springtime in North America.",
    "May (noun) - the fifth month of the year in the Gregorian calendar.",
    "May (verb, past tense) - to allow or permit; grant permission or authority for something to happen.",
    "May (adjective, archaic) - having a light, tender green color; greenish-yellow.",
    "May (abbreviation) - Master of Arts or Members of the Order of the British Empire, depending on context."
  ],
  "like": [
    "In a manner similar to; similarly; in the same way; alike",
    "Enjoying or liking (used to describe someone's personal preference)",
    "To indicate that something is regarded as parallel or comparable to another thing",
    "A resemblance, similarity, or correspondence between things, persons, or situations",
    "As if by nature or inclination; naturally; by inherent disposition or character (in the context of emotions and behavior)"
  ]
}