{
  "babiche": [
    "A type of flexible, strong, and lightweight material made from the tanned and processed skin of animals, often used in making various items like belts, straps, and laces."
  ],
  "baby": [
    "A young human being under the age of one year, especially an infant from birth until they begin to walk or crawl.",
    "A small child, typically less than five years old.",
    "Informal term for a person who is inexperienced or immature, even though they are no longer a young child."
  ],
  "baccalaureate": [
    "A academic degree, usually a Bachelor's degree, granted to students who have successfully completed a course of study at a college or university."
  ],
  "bachelor": [
    "A man who is not married and has never been married",
    "An unmarried adult male human being",
    "An academic degree, title or rank conferred upon a person who has completed a course of study without interruption",
    "In some contexts, especially in the field of heraldry, any unmarried man, including widowers and divorcees",
    "In some sports teams, especially cricket, a bachelor refers to a player who hasn't scored in several games",
    "In some societies, it refers to an initiate or probationary member of a fraternity or social club",
    "A male horse that has not been castrated and is therefore capable of producing offspring"
  ],
  "back": [
    "The part of the body between the shoulders and the hips, supporting the body when upright.",
    "A part of an object or surface that is furthest from the viewer; the rear side.",
    "To move or return in the direction of one's previous position or point of origin.",
    "(In games or sports) a turn, or round, for a player or team to compete.",
    "(Of a computer or electronic device) to stop functioning for a short period in order to save data and carry out maintenance tasks."
  ],
  "backing": [
    "Support or encouragement given to someone in order to succeed in an activity or task.",
    "A material, often fabric or paper, that is glued or stitched to the back of something for support or decoration.",
    "A secondary or backup system or plan in case the primary one fails or is insufficient."
  ],
  "bacon": [
    "A type of salted, cured, and/or smoked meat prepared from various cuts of pork, typically served as a breakfast food or used as an ingredient in cooking."
  ],
  "bacteria": [
    "Microscopic one-celled organisms that can be found almost everywhere, including soil, water, plants, and animals. They are essential for the decomposition of organic matter and play a key role in various biochemical processes.",
    "Can cause diseases in humans and animals; such as cholera, syphilis, and tuberculosis.",
    "Used in the production of certain foods, like yogurt, cheese, and sauerkraut, through the process of fermentation."
  ],
  "bad": [
    "Not good or of poor quality.",
    "Morally wrong, immoral, or evil in nature.",
    "Difficult or unpleasant to deal with.",
    "Causing harm or injury to someone or something.",
    "Not behaving appropriately or following rules."
  ],
  "badger": [
    "An omnivorous mammal with black or brown fur, a long snout, and strong claws, native to Europe, Asia, and North America, known for its digging habits.",
    "A person who persistently questions or criticizes others, especially about their motives or actions.",
    "An informal term for someone who repeatedly questions or challenges, often in a tiresome manner.",
    "To question or harass persistently, as in the phrase \"being badgered into doing something.\""
  ],
  "baffle": [
    "A device used to prevent air, water, or gas from flowing through an opening or around an object.",
    "To confuse or perplex someone, making it difficult for them to understand something.",
    "In plumbing, a flat plate placed across the opening of a tank or vessel to prevent the entry of foreign matter.",
    "A structure that protects against wind and noise in an engine or other machinery.",
    "To shield or insulate against heat, sound, or electromagnetic radiation."
  ],
  "baffled": [
    "Perplexed, puzzled, or confused; unable to understand or find a solution for something complex.",
    "Confuse or perplex someone intentionally, often by presenting contradictory or confusing information.",
    "Protect (an engine or machine) from external influences, especially noise or air pressure, with a baffle, which is a barrier or partition."
  ],
  "baffledom": [
    "A state of confusion, puzzlement, or being at a loss to understand something due to its complexity or unfamiliarity."
  ],
  "baffling": [
    "Perplexing; difficult to understand, explain or solve.",
    "Intimidating; causing fear, confusion or uncertainty.",
    "Protective device used to deflect heat, air, water, etc., from an engine, boiler, etc."
  ],
  "bagel": [
    "A round, flat bread made from yeasted wheat dough, traditionally boiled and then baked, with a hole in the center and often topped with seeds.",
    "An object or container, typically made of flexible material, that can be filled or closed at the top and carried on the shoulder or over the back."
  ],
  "baggage": [
    "A collection of belongings, luggage, or personal effects carried or transported by a person.",
    "Emotional or psychological weight that someone carries from their past experiences.",
    "Burdensome or unwanted obligations or responsibilities.",
    "(Slang) Irritating or troublesome behavior or characteristics in a person."
  ],
  "bait": [
    "A substance, such as food or other material, placed in a trap or on a fishing line to attract animals, typically for the purpose of catching them.",
    "To provide such a substance for the purpose of catching or luring an animal.",
    "An object used to provoke a reaction from someone, especially in order to get information or as a joke."
  ],
  "bake": [
    "To cook food, typically in an oven, by dry heat, causing it to become crisp on the outside while the inside remains soft or tender.",
    "To expose a substance to the heat of a fire or an oven so as to harden, dry, or change its color and flavor.",
    "To make something using an oven, such as baking bread or cookies.",
    "To cause to be affected by certain conditions or influences in a way that results in significant changes."
  ],
  "baked": [
    "To cook food by dry heat, usually in an oven, at a high temperature. This process often results in a crispy texture on the outside while retaining moisture on the inside. Examples include baking cookies, cakes, bread, and pastries.",
    "In the context of pottery or ceramics, to harden clay objects by firing them in a kiln at high temperatures. This removes all water from the clay, making it strong and resistant to damage.",
    "In the field of geology, baked refers to rocks that have been subjected to extreme heat and pressure over time, resulting in a hardened state.",
    "In slang terms, \"baked\" can refer to being under the influence of cannabis, usually through smoking or ingesting edibles. This term describes a state of relaxation and euphoria experienced by the user."
  ],
  "baker": [
    "A person who makes and sells bread, pastries, cakes, and other baked goods.",
    "Someone skilled in baking; a professional bakery worker.",
    "An individual responsible for preparing and baking food items in an oven or over an open flame."
  ],
  "balm": [
    "A soothing ointment, cream, or lotion containing healing substances that can alleviate pain, inflammation, or irritation in the skin.",
    "Something that provides comfort, relief, or consolation in difficult situations or emotions.",
    "(Botany) A type of aromatic herb used for its healing properties, often applied as an ointment or oil extract."
  ],
  "banal": [
    "Commonplace, lacking originality or creativity; uninteresting or uninspiring due to being overused or repetitive.",
    "Ordinary, unexceptional, or unexciting; not extraordinary or remarkable in any way.",
    "Unoriginal, unimaginative, or trite; expressing a familiar idea or theme in an uninspired manner."
  ],
  "banality": [
    "A state of being ordinary, dull, or uninteresting.",
    "Something that is commonplace or mundane; a trite or trivial matter.",
    "An action or decision made without thought or originality.",
    "Lack of creativity in art or literature, resulting in something uninspired and unoriginal."
  ],
  "bananas": [
    "A type of soft, yellow fruit with a curved shape, sweet flavor, and fibrous interior, typically eaten raw or used in desserts.",
    "An informal term for someone who is easily upset or angry, often used to describe a person's unpredictable mood swings or irrational behavior."
  ],
  "bang": [
    "A loud, sharp sound made by a sudden release of energy, often caused by an explosion, gunshot, or similar event.",
    "To strike something forcefully and noisily; to hit or knock with a banging noise.",
    "Informal, a large quantity or amount of something, as in \"He has a whole bunch of bananas.\" (slang)",
    "(music) A chord played on a piano, keyboard, guitar, or other instrument, typically consisting of three notes played at the same time.",
    "(informal) To move or act quickly and forcefully; to go or do something with great speed or energy."
  ],
  "bankruptcy": [
    "The state of being unable to pay one's debts; financial ruin.",
    "The legal process by which an individual or business can discharge or repay a portion of their debts under the protection of the law.",
    "A situation where an entity's assets are not enough to cover its liabilities, and it is declared insolvent by a court."
  ],
  "banner": [
    "A large piece of cloth, typically rectangular in shape, used for displaying text, images, or symbols, often hung as a sign or announcement.",
    "A decorative flag displayed online to represent a particular topic, group, or individual's identity within online communities or social media platforms.",
    "In computing, a graphic image placed at the top of an internet page or program window to identify its title or purpose."
  ],
  "banter": [
    "Playful and good-natured teasing, often involving humor or wit, between friends or in a friendly social interaction.",
    "Engaging in light-hearted and joking conversations to express familiarity and camaraderie, typically without any negative intent."
  ],
  "bantered": [
    "Verb (archaic): To engage in a playful, light-hearted exchange of witty remarks or jokes; to banter.",
    "Noun (archaic): An instance of engaging in a playful, light-hearted exchange of witty remarks or jokes."
  ],
  "bar": [
    "A horizontal piece of metal, wood, or another material that is fixed across the opening of a window, door, or gate to prevent passage through it.",
    "A long, narrow container used for holding and dispensing drinks at a bar, party, or other social gathering.",
    "A place where various kinds of alcoholic beverages are served, typically in glasses or mugs, such as a pub, tavern, or nightclub.",
    "A vertical or sloping barrier that separates one area from another in a swimming pool, gym, or sports complex.",
    "A group of musicians performing together, often with a specific name or genre.",
    "A symbol used in mathematical operations to represent multiplication, such as 'x' or asterisk ('*')."
  ],
  "barb": [
    "A sharp pointed part, similar to a hook, found on some types of fish hooks, arrows, or spears in order to better secure their target.",
    "A small piece of metal, plastic, or other material that is attached to a fishing lure, allowing it to catch on and hold onto the fish's mouth.",
    "An insulting or sarcastic remark, intended to wound or irritate someone."
  ],
  "barbiturates": [
    "A group of sedative drugs used to treat anxiety, seizures, and insomnia; they act on the central nervous system by depressing nerve activity, resulting in a calming effect."
  ],
  "bare": [
    "Uncovered, exposed, or devoid of any covering, clothing, or adornment; naked.",
    "Not concealed or hidden; openly displayed or revealed; exposed.",
    "Stripped of decoration or ornament; plain or unadorned.",
    "Without protection, shelter, or defense; vulnerable.",
    "Unmodified or unaltered; in its pure or basic form; unrefined.",
    "Free from complicating factors or distractions; simple or straightforward."
  ],
  "barely": [
    "Just enough to avoid failure, defeat, or not quite reaching a certain level; by a narrow margin.",
    "So little of something left that it is barely noticeable or present.",
    "To the point where no more can be added or done.",
    "Slightly beyond the minimum required or requested."
  ],
  "bargain": [
    "A thing bought at a price considered to be lower than its actual value or cost; a good deal.",
    "A commercial transaction in which each party benefits from the exchange, also known as a mutually advantageous agreement.",
    "The act of negotiating or haggling over the terms and conditions of an agreement or sale."
  ],
  "barge": [
    "A large flat-bottomed boat, typically used for carrying heavy goods along inland waterways or between ships at sea.",
    "A platform that can be moved horizontally on rails or wheels, often used to display products or artwork at trade shows or exhibitions."
  ],
  "barista": [
    "A person who serves and prepares coffee beverages, such as espresso-based drinks or pour-over coffee, in a café or coffee shop."
  ],
  "bark": [
    "The loud, harsh sound made by a dog, usually used for communication purposes such as expressing alarm, aggression, or excitement.",
    "A term used to describe the outer covering or skin of an animal, typically serving as protection from environmental elements and injury.",
    "In a marine context, 'bark' refers to a type of early sailing ship, characterized by its three-masted rigging.",
    "An informal term for loud, harsh, or uncontrolled speech, often used in expressions like \"barking orders\" meaning giving orders forcefully and without consideration.",
    "In literary usage, the sound made by a tree when it has been struck or shaken, as in the phrase 'the barking of the trees' indicating that they were being shaken by an earthquake.",
    "A slang term for marijuana, especially when used to refer to the low-quality type."
  ],
  "barn": [
    "A large farm building with a single open space inside, used for storing grain or housing livestock."
  ],
  "barometer": [
    "A device that measures atmospheric pressure, which can be used to predict changes in weather.",
    "By extension, anything that serves as an indicator of an upcoming development or trend."
  ],
  "baroque": [
    "A style of architecture, music, and art that originated in Europe during the 17th century, characterized by grandeur, ornate detailing, and rich colors.",
    "An adjective used to describe something that is elaborate, complicated, and irregular in form."
  ],
  "barrel": [
    "A cylindrical wooden, metal, or plastic container with one or two ends closed, used for storing or transporting liquids like oil, wine, or water.",
    "The unit of measurement for liquid volume in the British Imperial system, equal to 36 gallons (about 151 liters).",
    "A large quantity or amount of something; a great deal.",
    "In sports, particularly archery and shooting, a wooden, metal, or plastic tube that holds arrows or bullets and guides them towards the target.",
    "In music, a small cylindrical drum with a head on either end, struck with sticks, hands, or mallets to produce sound."
  ],
  "barren": [
    "Devoid of vegetation, fertile land or life; sterile, unproductive.",
    "Unable to conceive children or produce offspring.",
    "Lacking creativity, ideas, or originality; stale or unimaginative.",
    "Having no interest, appeal, or importance for someone; dull or uninteresting."
  ],
  "barrette": [
    "A flat, decorative accessory used to hold hair in place, typically made of plastic, metal or other materials, often featuring a clip mechanism that grips the hair tightly and securely.",
    "(contextual definition) In the context of horseback riding equipment, a leather strap worn around the rider's upper arm to prevent the sleeve from catching on the reins or stirrup."
  ],
  "bartender": [
    "A person who serves alcoholic beverages to customers in a bar or pub setting, often preparing and mixing cocktails and other drinks."
  ],
  "barter": [
    "The act of exchanging goods or services without using money as a medium of exchange, usually through direct swap between two parties.",
    "An economic system in which commodities are exchanged for other goods or services, rather than for currency.",
    "The exchange of one product or service for another of equal value; a trade."
  ],
  "base": [
    "A foundation or starting point for something; an underlying structure or layer.",
    "The lower part of a building, structure, or mountain.",
    "A point or area from which military operations are carried out.",
    "A person's natural disposition, temperament, or character.",
    "A substance or material that reacts with water to produce acids.",
    "In mathematics, the bottom number in a fraction."
  ],
  "baseball": [
    "A game in which players on two teams take turns throwing, hitting, and running with a bat and ball to score points by reaching a series of four bases laid out in a diamond shape."
  ],
  "basin": [
    "A natural depression in the earth's surface where water collects, such as a lake, river valley, or sea.",
    "A container, usually bowl-shaped, used for holding liquids, like a sink basin in a kitchen or bathroom.",
    "An area enclosed by the ground that drains into one point, often used for agriculture and farming.",
    "In geology, a large area of land where rocks are formed from sedimentary deposition over time."
  ],
  "bask": [
    "To sit, lie, or stand in the sunshine, absorbing its warmth and light.",
    "To enjoy oneself completely, especially by being surrounded by something pleasurable.",
    "To cause (someone) to be warm or contented through the rays of sunlight or by some other pleasant means.",
    "To lie or recline in a comfortable position, allowing oneself to be warmed and relaxed."
  ],
  "basket": [
    "A container made of interwoven materials, such as straw, rattan, or willow, with an open top and sloped sides that taper towards the bottom, used for holding or carrying various items such as fruit, vegetables, flowers, or other goods.",
    "A type of financial instrument in which a group of securities is selected according to specific rules, and their collective performance is used to represent the overall market trend or sector performance."
  ],
  "basking": [
    "Engaging in a pleasant activity, enjoying one's self, or expressing satisfaction and happiness.",
    "Basking refers to an animal, especially a reptile, sunning itself or lying in the warmth of sunlight or a heat source.",
    "To enjoy oneself or relax pleasantly, often in reference to spending time outdoors on a warm day."
  ],
  "basting": [
    "Applying a liquid, such as broth, oil, or butter, on food, especially meat, during cooking to keep it moist and flavorful.",
    "To sew or fasten together the edges of a garment or fabric, typically with a contrasting thread, for decorative purposes or to provide stability."
  ],
  "bastion": [
    "A fortified structure, typically a tower with walls surrounding it, used to protect a city or other territory.",
    "A place or thing that is strongly established, dominant, or influential in its area of operation.",
    "An area or department within an organization that has been specifically designed and built for security purposes."
  ],
  "bat": [
    "A small mammal with wings, found in caves, forests, and other areas; it is known for its ability to fly and navigate using echolocation.",
    "A piece of sports equipment made from wood or metal used to hit a ball in games such as baseball, cricket, and softball.",
    "An informal term for a heavy stick used to swat insects, particularly mosquitoes."
  ],
  "batch": [
    "A quantity of something produced or dealt with at one time, especially as a single process or operation.",
    "A group of things that are similar in nature or type, collected together for a specific purpose.",
    "A set amount or number of items to be processed together, such as data, files, or documents.",
    "A quantity of raw materials, prepared and processed at one time for use in production or manufacturing.",
    "(In computing) A group of commands that are executed together as a single operation."
  ],
  "batchelors": [
    "A term used to describe an unmarried man, specifically one who is of a certain age (e.g., an adult or middle-aged man) and has not yet entered into marriage.",
    "In some universities, a student who resides in a specific type of accommodation for single male students, typically studying towards a bachelor's degree."
  ],
  "bathtub": [
    "A large container, usually made of ceramic or acrylic materials, used for holding water in which a person can sit and immerse themselves in the water to clean their body.",
    "An enclosed area within a bathroom that contains this container, often with additional features such as faucets, showerheads, and handles for draining the water from the container."
  ],
  "batteries": [
    "A set of devices, usually consisting of one or more cells, that store electrical energy and can deliver a flow of electrons to an external circuit when connected to it. They are used in various applications like flashlights, laptops, cars, etc., for power supply.",
    "(Military) A group of military units or personnel deployed together for a specific purpose, such as an infantry battalion or artillery battery."
  ],
  "bauble": [
    "A decorative object, especially one made of glass or plastic, that is often hung on a Christmas tree or used as an ornament for other festive occasions.",
    "An item of little worth or value; a trifle.",
    "A showy piece of jewelry, typically consisting of a shiny stone set in metal."
  ],
  "bawl": [
    "To cry out loud or to shout aloud, usually due to strong emotions such as anger, frustration, or pain.",
    "(Informal) To shout or scream at someone in anger or frustration, especially in a public place.",
    "(Slang) To loudly criticize or complain about something, often in a way that is perceived as excessively negative or whiny."
  ],
  "bay": [
    "A body of water partially enclosed by land, typically with a broad opening facing the open sea, and often serving as a safe harbor for ships or boats.",
    "An area of land that slopes down from both sides to meet in the center or middle point, often forming an inverted triangle shape.",
    "A wide, deep cry or shout made by people or animals, especially in order to attract attention or express strong emotion."
  ],
  "bazaar": [
    "A large public market where many different goods are sold, often in an open-air setting.",
    "An event or gathering where various items, such as handmade crafts or antiques, are displayed and sold by vendors."
  ],
  "bazaarist": [
    "A person who sells or trades goods in a bazaar or marketplace, typically using a temporary stall or booth."
  ],
  "be": [
    "To exist or be in a specified place at a given time.",
    "To have a certain quality, characteristic, or attribute.",
    "To occupy a certain position, role, or status.",
    "To serve as a means of support or sustenance."
  ],
  "beach": [
    "A sandy or pebbly area along the shore of a body of water, where waves from the water break as they reach land."
  ],
  "beaded": [
    "Covered with or adorned by small, usually round and hole-punched objects (often glass, plastic, or gemstones) threaded onto a string, wire, or chain and tied together to form decorative patterns or designs, typically found on jewelry, clothing, accessories, or home decor items.",
    "Having lines of varied intensity, often resembling beads or droplets, in a painting, drawing, or photographic image, due to variations in color saturation or exposure levels."
  ],
  "beady": [
    "Characterized by or having small, sharp, and bright eyes; piercing or alert-looking.",
    "Relating to or resembling a bead in shape, size, or function.",
    "Marked by intense curiosity or scrutiny."
  ],
  "bear": [
    "An animal with a long snout, shaggy fur, and large paws, capable of standing on two legs; found in the wild or kept as a pet or at a zoo.",
    "A person who is strong and powerful; used to describe someone who is physically imposing or dominant.",
    "To endure or put up with something difficult or unpleasant; to tolerate, accept, or undergo an adverse situation or condition."
  ],
  "beat": [
    "To strike something repeatedly with a rhythmic motion, usually using the hands or another body part.",
    "To defeat an opponent or rival in a competition or contest.",
    "A regular, rhythmic movement or sound, as of a drum or music.",
    "A region where people live and work, often characterized by certain features such as culture or landscape.",
    "To stir or mix something rapidly or vigorously.",
    "To move quickly and energetically in a specific direction.",
    "A strong feeling of emotion or belief about something, especially when it is not based on facts or evidence."
  ],
  "beautiful": [
    "Pleasing to look at; having qualities that give great pleasure to the senses, especially sight.",
    "Showing skill and careful workmanship; finely made or designed.",
    "Inspiring great admiration or approval; very impressive.",
    "Possessing qualities that are charming or attractive in some way."
  ],
  "beautifully": [
    "In a way that is visually appealing, graceful, or attractive: she sang beautifully; the painting was beautifully detailed.",
    "With great skill, artistry, or talent: he played the piano beautifully; her writing was beautifully crafted.",
    "In a manner that expresses or suggests beauty: they spoke of love beautifully; the music captured the essence of beauty perfectly."
  ],
  "beautify": [
    "To make something more attractive, appealing, or visually pleasing through decoration or design.",
    "To enhance or improve the appearance of an area, object, or person through various means such as painting, landscaping, or personal grooming.",
    "To add beauty or charm to something by modifying it, often in a subtle way."
  ],
  "beautyqueen": [
    "A title given to a woman who has won a beauty contest, often referring to the overall winner or top contestants.",
    "A woman known for her exceptional physical attractiveness and charm, often associated with fame or celebrity status."
  ],
  "because": [
    "Used to introduce a reason or explanation for something that has happened, is happening, or will happen. For instance, \"It's raining so we can't go out\" uses \"because\" to provide the reason for not going out (the rain).",
    "Used in cause and effect relationships. It expresses the connection between two events or actions. For example, \"Because I studied hard, I got a good grade.\" here, studying hard is the cause that led to getting a good grade, which is the effect."
  ],
  "become": [
    "To change from one state or condition to another, often implying a transformation.",
    "To be transformed into something else; to assume a new form or character.",
    "To come to possess or acquire a certain quality or characteristic.",
    "To enter or start (a particular state or condition) as the result of some process or action."
  ],
  "bed": [
    "A piece of furniture used as a place to sleep, consisting of a flat frame with a mattress and bedding for resting or sleeping on.",
    "A location where something is typically found or takes place; the natural environment in which an organism lives.",
    "The bottom part of a machine or structure that holds or supports something.",
    "A level of complexity, as in computer programming or data storage systems.",
    "In sports, the playing surface where the game is played, as in tennis or basketball."
  ],
  "bedlam": [
    "Chaos, confusion or noisy uproar; a state of great disorder and commotion.",
    "A former mental hospital in London notorious for its disorderly conditions and patients.",
    "(Informal) A place or situation where there is much noise and confusion."
  ],
  "been": [
    "A past participle of the verb \"to be\". Indicates that an action, state or situation was in the past, usually used as auxiliary verb in tenses like past perfect and present perfect tense. Example: I have been studying for three hours.",
    "(Slang) Used to express surprise or amazement at something. Example: \"I've never seen a cat that big!\" \"Been? That's nothing, you should see my neighbor's cat.\""
  ],
  "beetle": [
    "A type of insect with a hard exoskeleton, usually oval-shaped, and typically winged, belonging to the order Coleoptera.",
    "A general term for various small, round animals that resemble or are closely related to beetles."
  ],
  "before": [
    "At an earlier time, previously: I did my homework before dinner.",
    "In rank or importance: The more important task comes before the less important one.",
    "Used to introduce a statement that shows what conditions are necessary for another statement to be true: Before he can graduate, he must pass all his classes.",
    "At the beginning of something: We will start before sunrise.",
    "In front of someone or something: Stand before me.",
    "On or at a previous occasion: I saw her before (meaning I met her earlier).",
    "Used to indicate that something must happen or be done before another event can take place: You need to reserve the room before you can have the meeting there."
  ],
  "befriend": [
    "Form a close, friendly relationship with (someone).",
    "To become friends with someone through interactions or actions."
  ],
  "began": [
    "Started or commenced doing something; initiate an action or process"
  ],
  "begin": [
    "To commence an action, activity or event.",
    "To originate; be the source of something.",
    "To undertake a course of action.",
    "To set out on a journey."
  ],
  "beguiled": [
    "Captivate or charm someone, often in a way that leads them to be deceived or misled.",
    "To lead (someone) into error or sin by clever or flattering talk, promises, etc.",
    "To engage (someone) in an activity through interest or attraction."
  ],
  "beguiling": [
    "Captivating or charming, especially in a deceptive way that makes it difficult to resist or resist being drawn into.",
    "Engaging the attention or interest of someone in a captivating and alluring manner.",
    "Delighting or pleasing by some attractive quality."
  ],
  "begun": [
    "Started or commenced; initially initiated, particularly in reference to an action, event, or process.",
    "(In a past tense context) Had started or begun previously.",
    "(In a present perfect continuous tense context) Continues to have started or begun at some unspecified time prior to now and continues up until now."
  ],
  "behavior": [
    "The way in which someone or something acts, moves, or carries on under particular circumstances or over a period of time.",
    "A specific action or reaction that is part of a larger pattern of actions or reactions.",
    "A characteristic manner of acting or responding to situations that shows someone's personality and temperament."
  ],
  "behemoth": [
    "A large, powerful, or complex entity or organization that is difficult to manage or control.",
    "A very large animal or creature, often mentioned in religious texts.",
    "An exceptionally huge and heavy object or structure.",
    "(Informal) A person or thing of immense size, power, or importance.",
    "(Literary) A term used to describe something that is massive or overwhelming in nature."
  ],
  "behest": [
    "A command, request, or strong recommendation made by someone in a position of authority or influence.",
    "A formal or solemn charge given to someone to undertake a specific task.",
    "A strong urging or encouragement to do something.",
    "An instance of asking someone to take a particular action or make a decision."
  ],
  "behold": [
    "Look at (someone or something) with wonder, admiration, or surprise: \"Behold the magnificent view from the top of the mountain!\"",
    "To see (something) for the first time, especially with a sense of astonishment or admiration: \"After months of hard work, they finally behold the completed project.\""
  ],
  "beige": [
    "A light tawny brown color, often used in fashion and interior design.",
    "An item or object that is this specific shade of brown.",
    "A neutral color that can be easily combined with other colors."
  ],
  "belabor": [
    "To discuss or emphasize a point excessively, often to the point of irritation.",
    "To beat or strike heavily, especially in order to punish or as an expression of anger.",
    "To examine or consider something closely and at length, often causing unnecessary stress or strain."
  ],
  "belated": [
    "Occurring, made, or given too late; overdue.",
    "Late in coming or arriving, especially due to unavoidable circumstances.",
    "Offered or expressed after the appropriate time has passed, often as an apology for lateness.",
    "Denoting a late birthday card or gift that is still appreciated even though it arrived later than desired."
  ],
  "beliefs": [
    "Personal convictions, opinions, or judgments about something: what someone thinks is true or real.",
    "A set of ideas that guide a person's behavior or decisions: a system of principles or convictions.",
    "An idea or concept held by many people in a culture or group: shared understanding or values."
  ],
  "believe": [
    "To accept something to be true, even without absolute proof.",
    "To have faith or confidence in something or someone.",
    "To hold a particular opinion or viewpoint.",
    "To regard something as probable or possible.",
    "To think of something as real or true."
  ],
  "belittle": [
    "To make someone feel unimportant or less valuable by putting them down through mocking, criticizing, or demeaning their abilities, ideas, or achievements.",
    "To minimize the importance, significance, or worth of something by exaggerating its flaws, minimizing its positive aspects, or comparing it unfavorably to other things."
  ],
  "belittling": [
    "To make someone or something seem less important, impressive, or worthwhile by mocking, underestimating, or minimizing them.",
    "To diminish the significance, importance, or value of an idea, opinion, or accomplishment through criticism, sarcasm, or ridicule."
  ],
  "bell": [
    "A hollow metallic object typically hung in a tower, from the top of which it can be rung as a signal or to mark time; also called a church bell, school bell, or alarm bell depending on its function.",
    "A small, usually spherical or campaniform, structure produced by the fusion of cells in certain organisms, especially mollusks and echinoderms; also called a bell-shaped structure.",
    "The enlarged, bell-shaped part of a flower, consisting of the perianth (calyx and corolla) fused together; also called a floral bell or campanula.",
    "A rounded, hollow ornamental container made of metal or other material, often used to hold flowers or as a decorative element.",
    "In sports, a circular device with bells at its edges, struck by the player's hand or foot to score points; also called a goal, puck, or ball depending on the sport."
  ],
  "belligerent": [
    "Dispositionally aggressive, contentious, and ready to fight or quarrel; combative.",
    "Involved in warfare or fighting, especially as a member of one side in a conflict or battle.",
    "Showing or characterized by aggressiveness or hostility; antagonistic."
  ],
  "below": [
    "at a level or position lower than something else; beneath, under or subordinate to: The chair is below the table.",
    "less than a certain amount, degree, or level: My score was below average.",
    "not as good or important as something else: His performance was below expectations."
  ],
  "belt": [
    "A wide piece of material, such as leather or cloth, worn around the waist to hold up trousers or as part of a costume.",
    "A strip of land, often with specific characteristics or uses, running across a larger area. For example, an agricultural belt or industrial belt.",
    "A fastener used to secure clothing, such as a strap or buckle, that can be adjusted for size.",
    "In sports, the band worn around an athlete's body for protection or support.",
    "A region of the Earth where specific weather patterns are common, such as a tornado belt or hurricane belt."
  ],
  "bend": [
    "To change the shape of something by causing it to curve, bow or flex, often temporarily.",
    "A point where a road or river changes direction.",
    "An angle or curve formed in an object due to bending or being bent.",
    "To cause (an object) to change shape by curving or flexing it.",
    "In a chemical sense, the alteration of the structure of a molecule under stress or heat so as to change its shape."
  ],
  "benefactor": [
    "A person who provides support, financial aid, or other forms of assistance to an individual, organization, or cause.",
    "An individual or entity that has contributed significantly to the success, development, or growth of another person or thing."
  ],
  "beneficence": [
    "The quality of being kind and generous, especially in helping others.",
    "An act or instance of providing help or support for someone or something.",
    "Doing good deeds or acts of kindness to benefit others."
  ],
  "beneficent": [
    "Showing kindness, generosity, or goodwill; characterized by beneficial actions or effects.",
    "Causing or resulting in benefits or advantages to others.",
    "Bestowing or expressing favor or kindness; showing benevolence."
  ],
  "beneficial": [
    "Helpful or advantageous to someone or something; having a positive effect or producing good results.",
    "Profitable, useful, or valuable; increasing the welfare or profitability of an individual, organization, or situation."
  ],
  "beneficiary": [
    "A person who receives or is intended to receive benefits or advantages from something, such as a trust, insurance policy, or financial aid.",
    "(In law) A person entitled to the property of another on his death; an heir.",
    "In general terms, anyone who gains an advantage or benefit from a certain action or event."
  ],
  "benefited": [
    "Received an advantage or profit from something, often through improvement of one's own situation or well-being.",
    "Profitted financially or in any other manner from a business deal or transaction.",
    "Experienced positive outcomes as a result of a specific action or event."
  ],
  "benefiting": [
    "Gaining advantage or profit from something, whether it is a situation, an action, or some external factor.",
    "Deriving a positive outcome or improvement from an event or process.",
    "Experiencing an increase in well-being, happiness, or satisfaction as a result of something."
  ],
  "benevolence": [
    "Goodwill, kindness, or desire to do good towards others.",
    "An act of doing something kind or helpful for someone else without expecting anything in return.",
    "A quality that a person has when they are generous and caring towards others."
  ],
  "benevolent": [
    "Having or showing kindness, goodwill, or sympathy toward others: displaying a charitable or caring nature",
    "Willing to do good; well-meaning and kind in intentions or actions",
    "Doing good deeds for others without expecting anything in return; showing generosity and concern for the well-being of others"
  ],
  "benignant": [
    "Mild, gentle, or having a favorable effect; kindly or benevolent in nature."
  ],
  "bent": [
    "Having a particular inclination, tendency, or natural talent towards something; skilled or inclined.",
    "Curved or bent in shape, especially when used to describe an object.",
    "A predisposition towards a certain behavior, attitude, or action.",
    "In slang, a person who is homosexual or lesbian.",
    "Bending or flexing in a particular direction; indicating the degree of curvature."
  ],
  "bequest": [
    "A gift of money, property, or other valuable items left by a person in their will to someone or an organization after their death.",
    "(Outdated) An act of bestowing something as a mark of favor or esteem."
  ],
  "bergamot": [
    "A small, citrus fruit with yellow peel that is used primarily for its flavorful oil, which is used as a flavoring agent in Earl Grey tea and certain foods. The oil of the bergamot fruit also has medicinal properties, including being a natural remedy for stress and anxiety.",
    "A genus of flowering plants belonging to the family Rutaceae that includes both fruiting trees and ornamental plants."
  ],
  "berserk": [
    "Adjective: Describing a state of uncontrolled, violent frenzy; used to describe someone who has lost control of their actions or emotions and is behaving in an irrational and dangerous manner.",
    "Noun: A person or creature exhibiting this state of extreme rage and violence."
  ],
  "besieged": [
    "Surrounded by a large number of enemies, typically with the intention to take control or force surrender.",
    "Faced with numerous problems, difficulties, or demands that make it hard to function effectively.",
    "Attacked or harassed by many people, especially in a short period of time."
  ],
  "best": [
    "Of the highest quality, standard, or excellence; superior in performance or attainment.",
    "Holding the first place among those being considered; surpassing all others of its kind.",
    "Most suitable or desirable under the circumstances; optimum.",
    "Suitable for a particular purpose or situation; ideal.",
    "Having the most favorable qualities, advantages, etc.; supreme."
  ],
  "bet": [
    "A risky adventure, enterprise, or speculation; a gamble.",
    "To venture or wager something of value (such as money) on an uncertain outcome, especially in the context of gambling.",
    "To make a guess or prediction, often with the expectation of winning something if correct."
  ],
  "betimes": [
    "At an early hour; early in the day or morning.",
    "Suddenly; without warning or delay.",
    "Before the expected time."
  ],
  "betray": [
    "To reveal confidential information, secrets, or trust to someone who was not supposed to know about it, often causing harm or damage to a person or situation.",
    "To act disloyal or unfaithful to a person or group by turning against them for personal gain or out of malice.",
    "To give in to temptation or pressure and act against one's principles, beliefs, or values.",
    "To fail or disappoint someone by not meeting their expectations or providing the support they needed."
  ],
  "betroth": [
    "To engage or contract by mutual agreement to be married; to become engaged to marry."
  ],
  "better": [
    "Of a higher rank or standard; superior",
    "More advanced in time, age, or development; earlier",
    "In a more excellent manner; improved",
    "More favorable or advantageous under the circumstances; preferable",
    "In a superior position or condition; having greater potential",
    "In a state of health or fitness that is improving or has improved",
    "To make something better in quality, condition, or effectiveness",
    "To improve the condition or quality of someone or something",
    "To be superior to or surpass in some respect",
    "To do something more effectively or efficiently than before"
  ],
  "between": [
    "Located in or occupied by the space that separates two things or points from one another.",
    "Involving or connected with a relationship, situation, or choice among three or more alternatives.",
    "Occurring during a period of time between two specified dates or events."
  ],
  "beveled": [
    "Having flat or sloping sides meeting at an angle, typically used to describe the edges of a tool or object.",
    "(Of a window or door) having an angled top or bottom edge for easier opening and closing.",
    "(Of a mirror or lens) cut or polished at an angle to reduce reflections and improve clarity."
  ],
  "beverages": [
    "A liquid refreshment that people consume, excluding water and other beverages.",
    "Any drinkable substance that is not a food or water, such as tea, coffee, soda, or juice.",
    "A non-alcoholic drink, like water, milk, or a soft drink."
  ],
  "bevy": [
    "A group of birds, particularly doves or pigeons.",
    "A crowd or gathering of people, typically in a lively or festive setting."
  ],
  "bewilder": [
    "To cause someone to become confused, puzzled, or uncertain about something, often due to an unexpected event or new information.",
    "To perplex or baffle someone so much that they are unable to understand or make sense of a situation.",
    "To confuse or confound someone's thoughts or actions, making it difficult for them to take appropriate steps or decisions."
  ],
  "bewildering": [
    "Causing confusion or perplexity; difficult to understand or explain.",
    "Strikingly unusual or unexpected, often leading to a state of bewilderment.",
    "Overwhelming in size, number, or variety, causing bewilderment."
  ],
  "biannual": [
    "Occurring every two years.",
    "Happening twice in a specific period of time, such as a term for an organization or event that takes place twice within a certain number of years."
  ],
  "biased": [
    "Having a particular viewpoint or preference that influences one's judgement, actions, or decisions in an unfair way.",
    "Showing partiality towards something due to personal feelings, beliefs, or interests.",
    "Not impartial, objective, or fair; having a slant or inclination towards a certain perspective or outcome.",
    "Based on or influenced by personal opinions rather than facts or evidence."
  ],
  "bib": [
    "A piece of cloth, plastic, or paper that is tied around the neck of a person to protect their clothing from food or liquid spills, typically when eating messy meals like soup or stew."
  ],
  "bibliography": [
    "A list of books, articles, and other sources cited in a piece of writing, typically found at the end or as a separate section.",
    "A collection of works on a particular subject by one author or within a particular field, often published as a reference tool for researchers and scholars."
  ],
  "bibliophile": [
    "A person who collects or has a great interest in books.",
    "Someone who loves reading and possesses a large collection of books.",
    "A book lover who appreciates the beauty and value of books, both old and new.",
    "A person whose job is to study books, such as a librarian or bibliographer."
  ],
  "bicameral": [
    "Relating to or being a system of government in which there are two separate and distinct legislative bodies, such as a Senate and a House of Representatives.",
    "(In linguistics) relating to or involving two parts or chambers, as in the human brain (cerebrum and cerebellum)."
  ],
  "bicentennial": [
    "Relating to, celebrating, or commemorating a period of 200 years.",
    "Occurring every 200 years.",
    "The 200th anniversary of an event, organization, etc."
  ],
  "bicycle": [
    "A human-powered vehicle, usually with two wheels connected by a frame and steered by handlebars, that can be ridden on roads or paths for transportation, exercise, or recreation."
  ],
  "bicyclist": [
    "A person who rides a bicycle, especially as a means of transportation or for exercise."
  ],
  "biennial": [
    "Occurring or happening every two years.",
    "A plant that completes its life cycle in two years."
  ],
  "biennially": [
    "Occurring, happening, or taking place every two years.",
    "Every other year in a recurring cycle of events or activities.",
    "Denoting something that happens or is done only twice during a particular time period, usually two years.",
    "(In botany) Pertaining to plants that complete their life cycle and produce seeds in two years."
  ],
  "biennium": [
    "A period of two years."
  ],
  "big": [
    "Large in size, height, or extent, as compared to something else.",
    "Important or influential, especially among others of its kind.",
    "Having a great amount, degree, or intensity of something (such as power, money, or talent).",
    "Used to refer to a whole subject, area, or field, without focusing on specific details."
  ],
  "bigger": [
    "Of greater size, amount, degree, or extent than something else (compare to).",
    "(Informal) More important, powerful, or influential; superior."
  ],
  "bike": [
    "A two-wheeled human-powered vehicle with pedals driven by a rider sitting on a saddle, steered by handlebars, and propelled forward by the force of the rider's legs pushing against the pedals or by the power of its engine in case of motorized bikes.",
    "A bicycle is used for various purposes such as transportation, recreation, sports, or exercise."
  ],
  "bilingualism": [
    "The ability to fluently speak, read, and write in two languages.",
    "A language learning approach where individuals become proficient in two different languages from an early age.",
    "The practice of using two languages in daily communication or education within a community or country."
  ],
  "billiards": [
    "A game played on a table with balls, cues, and pockets, similar to pool or snooker.",
    "An obsolete unit of account in some countries."
  ],
  "billion": [
    "A large number, equal to one thousand million (1,000,000,000) or one hundred millionth part of a trillion. It is an ordinal numeral and comes after \"million\" and before \"trillion.\""
  ],
  "billow": [
    "A large round wave, especially in water.",
    "A mass of something that is swelling or billowing outwards, such as smoke or clouds.",
    "A fold, crease, or wrinkle in a material, like fabric or paper."
  ],
  "bimonthly": [
    "Occurring twice a month or once every two months."
  ],
  "biodegradable": [
    "Capable of being broken down into natural elements by living organisms, specifically microorganisms, under specific environmental conditions."
  ],
  "biographical": [
    "Pertaining to, containing, or characterized by a detailed account of someone's life, especially in the form of a biography or autobiography.",
    "Focusing on or providing information about an individual's life, including personal details and historical context."
  ],
  "bioluminescent": [
    "The ability of certain organisms to produce and emit light through a chemical reaction that takes place within their cells, typically in response to specific environmental conditions or stimuli. This phenomenon is also commonly known as \"glow-in-the-dark\" or \"cold light\"."
  ],
  "bioterrorism": [
    "The deliberate use of biological agents, such as viruses or toxins, to cause illness or death in people, animals, or plants, often with the intent of creating fear or disrupting society."
  ],
  "bird": [
    "A warm-blooded, egg-laying, winged vertebrate of the class Aves, typically characterized by a beak, feathers, and the ability to fly or at least walk well.",
    "An object, image, or model resembling such an animal, especially one used in toys, decorations, or as symbols in various contexts."
  ],
  "birth": [
    "The act or process of being born, or emerging from an enclosed space or environment, such as a womb or egg.",
    "The day or time when someone or something is born.",
    "The beginning or emergence of something new, such as the start of a new era, project, or company.",
    "The person or thing that comes from the birth, or is descended from it."
  ],
  "biscuit": [
    "A small round flat cake, typically made from a mixture of flour, sugar, and butter or margarine, and often eaten with tea or coffee.",
    "A small, thin, flat piece of bread, usually served with soup or salad.",
    "A dry, crunchy biscuit, commonly given to dogs as a treat."
  ],
  "bit": [
    "A small part of something, typically a metal piece, that can be attached to a horse's mouth to guide and control its movements during riding.",
    "A very small amount or degree of something; a trace or hint.",
    "A brief segment of entertainment, news, or information within a larger program or broadcast.",
    "In computing, a binary unit consisting of 0 or 1, used in storing and representing data.",
    "A fragment of text or data, especially on the internet, that is meant to be shared and often contains humor, wit, or irony."
  ],
  "bits": [
    "Small, separate pieces of something, particularly when they have been broken off from a larger whole.",
    "A unit of digital information that can have two possible values, typically represented as either 0 or 1.",
    "In music and recording, small sections of audio or notes, often used in editing or composition.",
    "An informal term for pieces of gossip or rumors, often with little substance or truth behind them.",
    "Short for \"binary digits,\" a combination of ones and zeros used in computer programming and information processing."
  ],
  "bizarre": [
    "Unusual, strange, or extraordinary in appearance or character.",
    "Strange, unconventional, or surprising in nature.",
    "Characterized by a mixture of various elements that do not fit together harmoniously."
  ],
  "bizarrely": [
    "In an unusual, strange, or odd manner that is hard to explain or comprehend.",
    "Unconventionally; in a way that deviates from what is considered normal or typical.",
    "Strangely; in a way that does not conform to one's expectations or understanding."
  ],
  "black": [
    "Having no hue, appearance, or effect of light; denoting the color that is perceived when no light is reflected from a body, as in the case of black paint or a black cloth; also, relating to the absence or complete lack of light.",
    "A person with dark skin, especially members of a race or ethnic group originally from sub-Saharan Africa, who have such skin.",
    "A term used for someone or something that is evil, wicked, or causing harm.",
    "Darkness or gloom in general; a state or condition of obscurity or ignorance.",
    "A color between dark blue and very dark green in the color spectrum."
  ],
  "blasphemous": [
    "Involving a violation of reverence due to God, sacred things, or religious rites; sacrilegious.",
    "Showing disrespect for the religious beliefs or feelings of others."
  ],
  "blasphemy": [
    "The act of showing disrespect, contempt, or lack of reverence for a deity, religious symbol, or sacred text.",
    "Speaking or writing in an irreverent or impious manner about something considered divine or holy.",
    "Expressing strong disbelief or criticism towards a religion, its beliefs, or its followers."
  ],
  "blast": [
    "An explosion, typically caused by a bomb or fireworks.",
    "A strong wind, gust, or breeze, often associated with storms or hurricanes.",
    "To propel something forward using a high-pressure air blast or jet of steam.",
    "To expose someone to harsh criticism or negative feedback.",
    "To hit or strike very hard, as in sports like baseball or cricket."
  ],
  "blatant": [
    "Clearly visible, obvious, or noticeable; conspicuous.",
    "Brazenly shameless or outrageous in behavior or speech.",
    "Lacking subtlety or finesse; directly expressed without concealment.",
    "Egregious, flagrant, or glaring; especially of a fault or defect."
  ],
  "blaze": [
    "A bright light produced by burning wood, gas, or other combustible materials.",
    "A sudden burst of intense activity or progress.",
    "A bold and striking color or pattern.",
    "To burn brightly with a flame; to blaze up.",
    "An outburst of emotion or anger."
  ],
  "blazing": [
    "Brightly illuminated with a strong, warm light; flaming"
  ],
  "bleak": [
    "Having a colorless appearance, lacking brightness or contrast; devoid of color or richness (synonyms: drab, dreary, monotonous)",
    "Gloomy, desolate, or forbidding in aspect; dismal and desolate (synonyms: desolate, bleak, barren)",
    "Lacking hope or prospect of improvement; hopeless or unfavorable (synonyms: desperate, gloomy, forlorn)",
    "Marked by difficulty, hardship, or suffering; harshly uncompromising (synonyms: severe, rigorous, austere)"
  ],
  "bleat": [
    "The vocalization made by a sheep, typically used to communicate with other sheep or to express fear, hunger, or warning."
  ],
  "blend": [
    "A combination of different things, especially colors, flavors, or substances that have been mixed together to produce a smooth and consistent result.",
    "To mix different elements so as to create a homogeneous or harmonious whole; also, the act of creating such a mixture.",
    "In photography, the gradual change in color or tone from one area of an image to another, usually created by blending two or more exposures with different colors or tones.",
    "To combine sound elements such as music or voice recordings so that they appear seamless and continuous when played back."
  ],
  "blended": [
    "Mixed, combined, or merged together to create a new entity or substance with distinct properties; for example, blended drinks are made by combining different ingredients into a single beverage.",
    "Relating to or involving the process of blending; for instance, \"the teacher explained how to blend colors on the palette.\"",
    "In reference to education, combining elements from multiple disciplines or approaches in a unified course of study; for example, blended learning integrates traditional classroom instruction with online learning resources."
  ],
  "blending": [
    "Mixing two or more substances together to form a new substance with different characteristics than the original ones.",
    "Combining elements, ideas, or styles in an artistic work to create something unique and harmonious.",
    "The process of gradually merging one thing into another, such as sounds, colors, or flavors.",
    "A technique used in language learning to combine words from two languages, creating new vocabulary."
  ],
  "blighted": [
    "Damaged, decayed, or ruined as a result of disease, pests, or harsh environmental conditions, especially in reference to agricultural crops or urban areas.",
    "Causing or characterized by damage or decay, typically through disease, pests, or harsh environmental conditions, often used to describe situations where growth and development are negatively affected."
  ],
  "blister": [
    "A small swelling of the skin, filled with fluid, caused by friction, heat, or other irritation.",
    "A protective covering, similar to a bubble, that forms over an insect's eggs, allowing them to be transported safely."
  ],
  "blithe": [
    "Cheerful and carefree, showing little concern for difficulties or dangers.",
    "Lacking seriousness or gravity; superficial.",
    "Marked by a casual lack of attention to detail or accuracy; slapdash."
  ],
  "blitzed": [
    "Intoxicated due to excessive consumption of alcohol or other substances.",
    "Overwhelming an area with a sudden attack, typically by airplanes or artillery.",
    "A short burst of intense activity or action, such as in sports.",
    "To flood or cover an area quickly and completely, as in a flood or snowstorm.",
    "A term used in computing to refer to a sudden and unexpected surge in activity, often with malicious intent."
  ],
  "blitzkrieg": [
    "A military tactic involving a rapid, coordinated attack with overwhelming force and speed, often using air and land forces together to achieve surprise and swift victory.",
    "An intense burst of activity or effort, especially one that is short-lived but has a powerful effect."
  ],
  "blizzard": [
    "A powerful winter storm characterized by strong, sustained winds of at least 35 miles per hour (56 kilometers per hour) or more, combined with considerable falling or blowing snow which reduces visibility to near zero.",
    "A heavy snowfall accompanied by high winds that can cause severe weather conditions such as whiteouts and dangerous travel."
  ],
  "block": [
    "A solid piece of material, often rectangular in shape, used in construction to create walls, floors, etc.",
    "An area or neighborhood set aside for a particular purpose, such as residential or commercial use.",
    "A group of computer memory locations treated as a unit, typically storing data or instructions.",
    "To prevent something from moving or being used; to obstruct.",
    "To carve or shape a block of material, such as wood or stone.",
    "In drawing, to outline an area with a continuous line without lifting the pencil or pen."
  ],
  "bloodcurdling": [
    "Extremely terrifying, alarming or frightening.",
    "Causing intense fear or dread.",
    "Producing a feeling of horror or shock.",
    "Filling one with sudden and extreme terror or anxiety.",
    "Capable of causing great physical or emotional distress."
  ],
  "bloom": [
    "The growth and development of flowers or petals from a plant, giving it a colorful appearance.",
    "A flourishing period or stage of success for someone or something.",
    "The full development of beauty or charm in someone's appearance.",
    "To blossom or flower; used primarily to describe plants and trees.",
    "The process where a material becomes more attractive or bright in color due to exposure to air or light.",
    "A sudden increase or improvement in something, such as economy or technology."
  ],
  "blossom": [
    "The flower of a plant, often referring to the stage in which it is fully developed and displaying its petals.",
    "To develop or come into full bloom or flower, as with plants or flowers.",
    "To reach the peak of development or activity; flourish.",
    "To achieve full blooming or flowering potential."
  ],
  "blouse": [
    "A loose-fitting top garment, typically made of soft fabric, with sleeves and a round or square neckline, that is worn by women over trousers or a skirt."
  ],
  "blown": [
    "Inflated or swollen due to wind, heat, or some other agency; burst or ruptured, as a balloon that has been blown up too full.",
    "To have had one's mind influenced or affected by something; swayed or persuaded.",
    "To have caused someone to be swayed or persuaded; managed to convince.",
    "Relating to wind instruments, such as trumpets and trombones, where the sound is produced by blowing air into a mouthpiece.",
    "In baseball, hit by a pitch in a way that causes the batter to be blown off balance or knocked down.",
    "In glassblowing, the process of inflating molten glass with the help of a blowpipe and a blowtorch."
  ],
  "blue": [
    "A color between green and violet in the visible spectrum, which is produced by light with a wavelength of approximately 450–500 nm. It is the color of the clear sky and the deep sea, and is often associated with feelings of calmness or sadness.",
    "A pigment that can be used to produce many shades of blue, from pale sky blue to dark navy blue.",
    "A state of feeling depressed or unhappy, often described as being \"feeling blue.\"",
    "A term used to describe something that is not genuine or authentic, such as \"blue pencil,\" which refers to an editor's markings for deletions or changes, or \"blue blood,\" referring to members of noble families."
  ],
  "bluff": [
    "A steep bank or embankment, often along a river or shoreline.",
    "To deceive or mislead someone by giving false information or creating a false impression.",
    "In card games, to pretend to have a stronger hand than one actually has in order to bluff the opponent into folding or making a weaker play.",
    "A tall tale or exaggerated story.",
    "In geology, a mass of rock that projects into the riverbed and is often exposed when the water level drops."
  ],
  "blunder": [
    "A serious mistake; an act of carelessness, oversight, or inattention.",
    "To stumble or trip clumsily, causing a loss of balance or control.",
    "In chess, a move that is obviously poor and likely to lose the game."
  ],
  "blundered": [
    "Made a serious mistake; committed an error, especially in judgment or action.",
    "To speak or act clumsily or unskillfully; to bungle.",
    "To cause to make mistakes, especially through carelessness or ignorance."
  ],
  "blunt": [
    "Not sharp or pointed at one end of an object, such as a pencil or knife.",
    "Not able to say what one is thinking in a direct or clear way; indirect or tactless.",
    "Lose the effect or potency, as in losing the sting of a joke or the impact of a drug.",
    "(slang) A large amount of money, often referring to a $100 bill.",
    "(slang) Cannabis that has been mixed with tobacco for smoking, making it less intense."
  ],
  "blur": [
    "A slight unclear impression or sensation of something; a hazy perception.",
    "A slight out-of-focus or not well-defined image, typically due to camera movement or poor focus.",
    "To make something indistinct or unclear, often by intentionally obscuring or muddying the details.",
    "In sports, a penalty given for deliberately knocking the ball with the foot in an uncontrolled manner, causing the game to become disorganized and confusing."
  ],
  "blurb": [
    "A short promotional text often found on the back cover of a book, describing its contents and praising it.",
    "A brief recommendation or testimonial for a product, service, or event, usually placed in an advertisement or on a marketing material.",
    "In journalism, a phrase or sentence used to attract readers' attention, often displayed prominently at the beginning of an article."
  ],
  "blurry": [
    "Unclear, unsharp, or indistinct; often referring to a visual image that is out of focus or difficult to see clearly, such as when someone has poor eyesight or when something is too close or far away to be seen properly.",
    "(Informal) Confusing or unclear, often used to describe information or situations that are hard to understand or make sense of due to their complexity or ambiguity."
  ],
  "blush": [
    "A brief reddening of the face, neck, or chest, typically as a result of embarrassment, shame, or modesty.",
    "A cosmetic product designed to add a rosy hue to the cheeks, often used to enhance one's appearance.",
    "In botany, the part of a fruit that surrounds and protects the seeds when it is immature, usually turning red, yellow, or orange when ripe."
  ],
  "bluster": [
    "To make a loud, harsh, and usually empty noise; to roar, blow, or thunder noisily.",
    "To speak or act in an aggressive, intimidating manner, typically as a way of hiding feelings of vulnerability or uncertainty.",
    "To blow or be blown about noisily by the wind."
  ],
  "blustering": [
    "Characterized by a violent, sudden, or noisy commotion; stormy or tempestuous.",
    "Displaying or marked by bombast or pretension.",
    "Making loud, forceful, and often boastful speech, typically in order to impress others."
  ],
  "blustery": [
    "Characterized by strong, gusty winds.",
    "Harsh and biting, often due to wind or cold conditions."
  ],
  "boat": [
    "A small watercraft used to travel on lakes, rivers, or seas."
  ],
  "bobtail": [
    "A horse, dog, or cat with a naturally short or docked tail.",
    "A type of haircut for humans where the hair at the back and sides is cut very short, leaving only longer hair on top.",
    "In sailing, a term used to describe a rope that is too long or loose and needs to be adjusted.",
    "An informal name for a person who is short-tempered or easily irritated."
  ],
  "bode": [
    "(verb) To indicate or suggest, as in a prediction or sign that something will happen.",
    "(noun) A surname derived from the Old Norse name Porvaldr, meaning \"thor ruler.\"",
    "(noun) In the context of computing, Binary Opposite Decomposition Expression."
  ],
  "body": [
    "The main trunk or central portion of an organism, typically made up of various organs and systems that work together to keep the organism alive and functioning.",
    "A group of people working together, especially a political party or government.",
    "The physical structure or shape of something.",
    "The collection of people who make up a particular organization or group.",
    "The written words of a text or speech."
  ],
  "bogus": [
    "Not genuine; counterfeit, fake, or phony.",
    "Deceptive, fraudulent, or false.",
    "Pointless, invalid, or worthless.",
    "Humorous or ironic expression used to refer to something that is obviously false or absurd."
  ],
  "boisterous": [
    "Noisy, lively, and full of energy, often in an unrestrained way.",
    "Wild or uncontrollable, especially in behavior or emotions.",
    "Rowdy or disruptive, as a group of people or an event.",
    "Characterized by energetic activity or enthusiasm; vigorous."
  ],
  "boisterously": [
    "In a lively, noisy, and energetic manner.",
    "Marked by vigorous high spirits and enthusiasm.",
    "Characterized by boisterous behavior or conduct."
  ],
  "bolder": [
    "A large, heavy block of stone or another material, typically one used in constructing a building or other structure.",
    "A person who is courageous and confident in facing difficult situations or challenges.",
    "(In computer science) An object that can be moved or manipulated by a user on a display screen or graphical interface.",
    "(In geography) A raised area of land, usually composed of rock, projecting above the surrounding terrain.",
    "(In printing) A metal type used in a composing stick for setting copy in a hand-press."
  ],
  "bollweevils": [
    "A small, destructive insect that feeds on cotton bolls, causing significant damage to cotton crops; also known as the cotton boll weevil."
  ],
  "bollworm": [
    "An insect, belonging to the family Noctuidae, which primarily feeds on cotton plants by damaging their bolls or seed pods. This pest can cause significant crop losses and is a common problem for farmers in various regions worldwide."
  ],
  "bolster": [
    "To make something stronger, larger, or more effective by adding to it; reinforce.",
    "A cushion-like pillow used to support or elevate a person or object, such as under the knee during kneeling or beneath the back while lying on a bed.",
    "To provide additional support or encouragement for someone or something."
  ],
  "bolt": [
    "A rigid metal pin with a head on one end, used to hold two objects together by being inserted through corresponding holes in them and tightened with a nut or wrench.",
    "To run away quickly, especially from a place of danger or difficulty.",
    "A fastening device that secures a door or gate by sliding into a recess and being locked.",
    "A long thin piece of metal used to join two pieces of wood together.",
    "(Informal) To close or lock a door or gate, especially quickly or suddenly.",
    "A sudden dart or leap, as if propelled by a force."
  ],
  "bolts": [
    "Fasteners used to secure two or more objects together, typically made of metal with a threaded shank and a head that can be tightened or loosened with the right tool.",
    "A locking device that secures a door, window, or gate, consisting of a bolt that is inserted into a strike plate when locked.",
    "To move suddenly and quickly away from something or someone, often in fear or surprise.",
    "(In cricket) to block the ball with the bat in order to prevent runs being scored by the opposing team.",
    "A large number of bolts, usually referring to a swarm of birds or a group of fish."
  ],
  "bombastic": [
    "Pretentious or exaggerated in style, language, or self-importance; marked by pompous or grandiose speech or writing."
  ],
  "bone": [
    "The hard, rigid part of vertebrate animals that forms the skeleton, providing support for the body and protection for internal organs.",
    "A piece or fragment of such a part; a bone fragment.",
    "In slang or colloquial language, a person who is difficult to deal with, stubborn or uncompromising.",
    "The essential framework, structure, or basis of something; the underlying truth or foundation.",
    "An essential, often unchangeable, part of an idea, system, etc.",
    "To cause someone to feel hungry by talking about food.",
    "To make a connection or establish a link between different ideas or subjects."
  ],
  "bonsai": [
    "The practice of cultivating small trees and plants in containers, often for ornamental purposes, by shaping them through pruning and wiring their branches."
  ],
  "book": [
    "A collection of printed sheets bound together along one side, containing a continuous piece of writing or illustrations.",
    "A record of financial transactions, accounts, and ledgers.",
    "An appointment for a specified time to meet someone or attend an event.",
    "In computing, a file that contains data organized in a specific way, such as a database or program code."
  ],
  "bookcase": [
    "A piece of furniture with shelves to store and display books, often made of wood or metal.",
    "A collection of books organized on a shelf or set of shelves, typically in a room or library."
  ],
  "boomerang": [
    "A curved throwing weapon, typically used by indigenous Australians, that is thrown in a forward motion and returns to the thrower after bouncing off its target due to an aerodynamic design and momentum conservation.",
    "Figuratively, a term referring to any situation, action or idea that repeatedly comes back to affect the person who initiated it.",
    "A slang term used in computing to describe software that repeatedly crashes or malfunctions upon execution."
  ],
  "booming": [
    "Loud and reverberating sound, often indicating a large explosion, thunderstorm, or a loudspeaker producing an announcement.",
    "Rapid increase in business activity or economic growth, typically characterized by increased production, sales, and profits.",
    "A deep, resonant voice, often associated with an individual's authority or confidence."
  ],
  "boorish": [
    "Rude, crude, or unsophisticated in behavior or manners; behaving in an uncouth manner.",
    "Lacking refinement, polish, or culture.",
    "Overbearing or domineering, especially in a rude or arrogant way."
  ],
  "bossy": [
    "Arrogant or overbearing, especially in one's manner of giving orders or expressing opinions.",
    "(Of a person) domineering, aggressive, or commanding in manner or position.",
    "Informal: A chief executive, manager, or person in authority."
  ],
  "both": [
    "Used to refer to two things or people simultaneously, implying that they share a common characteristic or situation.",
    "Indicates a choice involving two alternatives, where neither can be chosen without considering the other.",
    "Denotes inclusion of all items within a pair, indicating that both members have been accounted for.",
    "Signifies agreement between two parties or individuals, often used in negotiations to ensure mutual satisfaction."
  ],
  "bother": [
    "To cause annoyance, distress or inconvenience to someone.",
    "To bother oneself about something; to worry or be concerned.",
    "In computing, a task that runs in the background, slowing down system performance."
  ],
  "bothered": [
    "Caused distress or concern to someone.",
    "Annoyed or bothered by something.",
    "To be concerned about or worried over something.",
    "To cause discomfort, worry, or anxiety in someone.",
    "To bother or interfere with something."
  ],
  "bothering": [
    "Annoying, troubling, or causing difficulty to someone.",
    "Taking time or effort that is not wanted or needed by someone."
  ],
  "bottom": [
    "The lower part of something, especially when it is flat or has a horizontal surface.",
    "The lowest layer in a hierarchy or sequence.",
    "The end or conclusion of something; the last point or stage.",
    "The underlying foundation or basis for something.",
    "A person's level of understanding, intelligence, or proficiency.",
    "(In accounting) The final entry in an account or ledger.",
    "(Of a musical instrument) the part where it rests on the lap when played."
  ],
  "bough": [
    "A large branch of a tree, especially one strong enough to bear the weight of a person or object.",
    "One of the principal branches that spread from the trunk of a tree or shrub.",
    "A section of wood used for construction or other purposes, often taken from a tree's bough."
  ],
  "bought": [
    "To acquire something by paying money or its equivalent, such as through a trade or exchange.",
    "To obtain goods or services from a seller in exchange for payment.",
    "To purchase an item or items with the intention of owning or using them; to make a purchase."
  ],
  "boulder": [
    "A large, rounded stone that is too heavy to be moved by hand, typically found in outdoor environments such as mountains, rivers, or beaches."
  ],
  "bouldering": [
    "Climbing large rocks or boulders for fun, exercise, or skill development without using ropes or harnesses.",
    "A type of rock climbing that focuses on short, steep routes called \"problems\" typically found on large boulders, often requiring the climber to use brute strength and problem-solving skills."
  ],
  "boulevard": [
    "A wide, tree-lined street in a city that is designed to be used by both cars and pedestrians."
  ],
  "bounce": [
    "To jump up and down, usually on a surface such as a trampoline or a bed.",
    "(Of a ball) to rebound off a surface after bouncing once or more than once.",
    "To throw or hit something so that it bounces back.",
    "A check that is returned by the bank because of insufficient funds in the account.",
    "An email message that is automatically returned due to a full mailbox or other technical issue."
  ],
  "boundary": [
    "The line that separates two different areas, regions or territories; marking their limits or extent.",
    "A limit or restraint imposed on something, such as behavior, action or thought.",
    "The edge or perimeter of a particular area or space.",
    "An area where the properties or characteristics of two systems or states differ or change.",
    "In mathematics, a set of points separating two regions or spaces."
  ],
  "bountiful": [
    "Abundant; plentiful; characterized by an ample supply of something desirable, such as food, water, or resources.",
    "Generous; providing much more than what is needed or expected, often in the form of gifts, support, or assistance.",
    "Richly endowed with a specific quality or feature, such as beauty, talent, or potential."
  ],
  "bounty": [
    "A reward given to someone who has accomplished a difficult task or provided valuable information, often in the form of money or other tangible items.",
    "A large amount of something, especially food or resources, that is produced or available for use.",
    "In biology, a structure or substance that enables an organism to survive and reproduce, such as pollen or seeds."
  ],
  "bouquet": [
    "An arrangement of flowers, usually tied together with a ribbon or held in water, often given as a gift or used to decorate a room or event.",
    "A group of scents or flavors that blend harmoniously, as in a perfume or wine.",
    "In cooking, a mixture of chopped herbs used to flavor a dish.",
    "A cluster of stars or other celestial objects in the night sky."
  ],
  "bourgeois": [
    "Adjective: Relating to the middle class or their values, lifestyle, or opinions.",
    "Noun: A member of the middle class in society, often characterized by a focus on material comforts and social status.",
    "(No longer commonly used) A person who is not a noble or aristocrat; a commoner."
  ],
  "boutonniere": [
    "A decorative floral arrangement, usually consisting of one or more flowers or other botanical elements, designed to be worn on the lapel of a jacket or coat.",
    "(In heraldry) An emblem or badge, often in the form of a flower, incorporated into a coat of arms or other device of nobility."
  ],
  "bow": [
    "A knot tied in a rope or cord, often used to close a package or secure something in place.",
    "To bend forward at the waist as a gesture of respect, greeting, or recognition.",
    "The front part of a ship or boat that projects into the water.",
    "In music, the movement of the head or torso to one side, often performed by musicians before beginning a piece.",
    "To bend or stoop down in submission or defeat.",
    "The forward part of an aircraft's wing, designed to create lift and control the plane during flight.",
    "A bend or curvature in a road, river, or other linear feature."
  ],
  "bows": [
    "A folding of the head and upper body in a show of respect, often accompanied by the removal of headwear or lowering of the gaze.",
    "A series of knots or loops tied around an object, used to secure it in place or to create decoration.",
    "A piece of flexible material, typically fabric or ribbon, tied into a knot, bow, or loop, worn as an accessory on clothing, hair, or gifts."
  ],
  "box": [
    "A rectangular container with a flat base, four vertical sides, and a lid or cover that can be opened or removed, used for storing, carrying, or protecting various items.",
    "A three-dimensional shape with six square or rectangular faces and eight vertices, formed by connecting opposite pairs of corners of a rectangle or square.",
    "A small compartment, area, or enclosure within an object, such as a car's dashboard or a computer case, used for holding specific components or controls.",
    "To place something into a box or container, usually to protect, organize, or transport it.",
    "In sports, especially boxing and soccer, the space that a player is allowed to occupy around their opponent or the ball without committing a foul."
  ],
  "boy": [
    "A young male human, typically a child or teenager who has not yet reached adulthood.",
    "Informally, a term used to refer to a young man or adult male.",
    "Figuratively, someone who is immature, irresponsible, or lacking in experience or knowledge, regardless of gender."
  ],
  "boycott": [
    "Refuse to buy, use, or participate in something as a way of protesting against it.",
    "Avoid contact with someone or a group, especially for political or social reasons.",
    "Prevent people from using or being involved in a particular place or event because of objection to the person or organization responsible for it."
  ],
  "bracelet": [
    "A circular band of various materials, worn around the wrist."
  ],
  "bracing": [
    "Providing support, encouragement, or reassurance during a difficult situation.",
    "A firm squeeze or hold, especially to strengthen or steady oneself.",
    "A walk or other activity done in cold weather for health benefits and to invigorate the body."
  ],
  "brag": [
    "To talk about oneself in a boastful, self-important manner.",
    "To make excessive or unduly loud noise.",
    "In card games, to claim the value of a trick or round before it is played."
  ],
  "bragged": [
    "Boasted, especially about one's own achievements or possessions.",
    "Made extravagant claims or statements about oneself, often in a way that appears conceited or self-centered.",
    "Informally, to speak loudly and at length about something one is proud of."
  ],
  "bragging": [
    "Making loud and boastful statements about oneself, often to impress others or to exaggerate one's achievements or abilities.",
    "A form of self-promotion that may be perceived as obnoxious or arrogant, characterized by frequent references to one's own accomplishments or possessions."
  ],
  "braid": [
    "A decorative design made by weaving three or more strands of hair, yarn, rope, etc., in a regular pattern; also called a plait.",
    "To create such a design by weaving strands together.",
    "A series of interwoven streams, branches, or other natural features, forming a distinctive pattern on the landscape."
  ],
  "brainstorming": [
    "A group thinking process in which members generate and share ideas, often in a structured, creative session to find solutions or identify new ways of doing things."
  ],
  "brandish": [
    "To wave or shake something, especially a weapon or a flag, in a threatening or aggressive manner as an act of intimidation or challenge."
  ],
  "bravado": [
    "Confident and swaggering behavior intended to impress others, especially in dangerous or difficult situations.",
    "(Not applicable)"
  ],
  "brave": [
    "Showing courage in face of danger, fear, or difficulty.",
    "Associated with a person or animal exhibiting courageous behavior.",
    "In old English literature, a term used for a knight or warrior.",
    "To face or confront (someone) with courage.",
    "A courageous action or deed."
  ],
  "bravely": [
    "In a courageous or bold manner, showing fearlessness in the face of danger or difficulty.",
    "With confidence and determination, even when faced with challenges or opposition.",
    "With bravery and fortitude, displaying strength of character in adverse circumstances."
  ],
  "brawl": [
    "A noisy, violent fight involving a large number of people."
  ],
  "brawn": [
    "A person's physical strength, particularly in terms of muscular power.",
    "The meat from an animal, specifically referring to the muscle tissue.",
    "In computing, a high-performance computer system used for demanding tasks.",
    "(slang) Money or resources; often used in phrases like \"he has plenty of brawn but not much brain.\""
  ],
  "brazen": [
    "Characterized by overt shamelessness, boldness, or impudence; audaciously open or unapologetic about something dishonest, immoral, or wrong.",
    "Displaying no fear or nervousness in the face of danger or difficulty; unflinching.",
    "Having a brightly polished and shiny surface, especially on metalwork or furniture; highly reflective."
  ],
  "breach": [
    "A gap, opening, or break in something, such as a wall or barrier.",
    "An unauthorized access to computer systems, especially through security measures.",
    "The act of violating a law, rule, or agreement.",
    "A failure to fulfill a duty or obligation.",
    "An act of betrayal or disloyalty.",
    "A fault or mistake that compromises the integrity of something."
  ],
  "bread": [
    "A type of food made from a dough of flour, water, and yeast, typically baked as a loaf.",
    "Figuratively, something that provides the basic necessities for living, such as food, clothing, or shelter.",
    "In computing, a data structure used to hold related information, similar to a table in a database."
  ],
  "break": [
    "To divide or cause to become separated into parts, often by applying force.",
    "To interrupt a period of time, especially to have a rest or pause.",
    "To stop something from continuing in the same way.",
    "To solve a problem or find an answer.",
    "To change direction suddenly and sharply.",
    "A pause or interruption in continuous action or activity."
  ],
  "breakable": [
    "Capable of being broken, destroyed, or shattered into pieces by force or impact.",
    "Subject to breaking under stress or pressure; fragile; easily cracked or split apart.",
    "Able to be halted or interrupted; susceptible to a pause or termination.",
    "Vulnerable to being fractured or splintered, especially due to its structure or materials used."
  ],
  "breathe": [
    "To inhale and exhale air through the lungs to supply oxygen to the body and release carbon dioxide.",
    "To take in fresh air and let out stale air, usually referring to an animal or person's natural process of respiration.",
    "To use one's breath as a tool for relaxation or meditation.",
    "To use breath control as part of singing, playing a wind instrument, or practicing other skilled activities."
  ],
  "breed": [
    "A group of individuals that belong to a common ancestry and possess shared characteristics, usually referring to animals or plants.",
    "To produce offspring intentionally through controlled breeding practices, particularly in relation to animals or plants.",
    "A family, lineage, or ancestry traced back to a common ancestor.",
    "A type or variety of something, such as a specific breed of dog or cat.",
    "To create or develop a particular characteristic, trait, or quality in someone or something through selective breeding practices."
  ],
  "brevity": [
    "The quality of being brief, concise, or to the point in speech or writing.",
    "A short statement or expression that conveys a message effectively without unnecessary words.",
    "The act of making something brief or succinct.",
    "A style of communication that avoids wordiness and emphasizes clarity and precision."
  ],
  "briar": [
    "A plant with prickly stems, such as blackberry or raspberry.",
    "A type of pipe made from a perforated block of hardwood, often used for smoking tobacco.",
    "A term for a person who is cunning or crafty, especially in getting what they want."
  ],
  "bribery": [
    "The act of giving someone money, power, or position in exchange for favors or influence.",
    "An unlawful practice involving the offering, giving, receiving, or soliciting something of value to influence the actions of an official or other person in a position of trust.",
    "Corruption that involves giving or accepting gifts, money, or favors to gain an unfair advantage in business or politics."
  ],
  "brick": [
    "A rectangular block of baked clay, often used in construction.",
    "The basic unit of a computer program that can hold data or instructions for processing.",
    "A term used to describe someone who is stubborn or uncooperative, especially in sports.",
    "An informal term for a person's place of residence, as in \"I'll see you at the brick.\""
  ],
  "bricolage": [
    "The act of creating something from a diverse range of available materials, often using whatever is at hand. It involves problem-solving, resourcefulness, and inventive use of existing resources. This term comes from the French language and is often associated with art, literature, and philosophy."
  ],
  "bridal": [
    "Pertaining to a wedding or matrimonial ceremonies, especially related to the dress and accessories for the bride."
  ],
  "bride": [
    "A woman who has just been married or is about to be married, typically regarded as a wife.",
    "The female partner in a marriage ceremony.",
    "A woman being married, especially in terms of preparations and festivities leading up to the event.",
    "In computer programming, bride refers to a type of program that serves as an intermediary between two applications, allowing them to communicate even if they do not support each other's protocols."
  ],
  "bridge": [
    "A structure built over a physical obstacle, such as a river, road, or valley, to provide passage from one point to another.",
    "A connective tissue in an organism that spans a cellular space or gap and serves to link two separate structures.",
    "A mechanical or electrical device that connects two circuits or components, allowing for the transfer of power or data between them.",
    "In music or speech, a note or syllable connecting two notes or words with a smooth transition.",
    "In computing, a technique used to temporarily store data from one memory location to another while waiting for access to the original location."
  ],
  "bridging": [
    "Forming a connection or link between two points, ideas, or things; serving as a link.",
    "(Construction) A structure, such as a temporary roadway or walkway, built to connect one point to another before a permanent structure can be built.",
    "(Telecommunications) The transmission of data over different types of networks or protocols to establish a connection between them."
  ],
  "bridle": [
    "A device used to control the movement of an animal, typically a horse, by controlling its head and mouth.",
    "A piece of equipment for a person or animal that limits their freedom or action in some way, such as a harness or restraint.",
    "Any restraining or controlling mechanism.",
    "To control, manage, or restrain something or someone.",
    "(Architectural term) The horizontal beam at the springing of an arch."
  ],
  "bright": [
    "Possessing or emitting a high level of light; shining or luminous",
    "Intellectually alert, intelligent, or sharp-witted",
    "Cheerful or optimistic in mood or outlook; characterized by hopefulness and positivity",
    "Showing or characterized by a vivid color or hue",
    "Easily seen from a distance due to contrast with surroundings"
  ],
  "brilliance": [
    "The quality of being extremely clever, talented, or skillful in a particular area.",
    "A brightness or shine, especially when referring to the color white.",
    "A person who is known for their exceptional abilities or qualities.",
    "Exceptional clarity or distinctness in sound or vision."
  ],
  "brilliant": [
    "Shining with a bright light, often used to describe objects made of reflective materials.",
    "Exceptional in intellect, talent or skill, often describing someone who is highly competent or gifted.",
    "A gemstone, especially a diamond, that has excellent clarity, color and cut.",
    "Vivid, intense or striking, often used to describe colors or emotions."
  ],
  "brioche": [
    "A type of enriched bread made with butter, sugar, eggs, and sometimes milk, characterized by a rich flavor, soft texture, and often braided or twisted shape."
  ],
  "brisket": [
    "A cut of meat from the breast or lower chest area of a cow, typically used for roasting or barbecuing.",
    "A dish made by cooking the brisket meat, usually served with gravy or sauce and accompanied by side dishes like potatoes or vegetables."
  ],
  "briskly": [
    "In a lively, energetic, or quick manner.",
    "With a swift or rapid pace.",
    "Characterized by brisk movement or action."
  ],
  "bristle": [
    "Stiff, thin hair-like structures that grow from the skin of certain animals, such as pigs or hedgehogs, which are used in brushes and other tools to provide a stiff, firm surface for various applications.",
    "A stiff, thin rod or wire, typically used in cleaning tools, brushes, or in various mechanical parts.",
    "To react with irritation or anger at some slight or annoyance, as in the phrase \"bristle at criticism.\""
  ],
  "brittle": [
    "Easily breaking into pieces, especially when subjected to force or stress.",
    "Lacking flexibility or resilience; fragile.",
    "(Of a material) tending to fracture under relatively little stress."
  ],
  "broach": [
    "To bring up a subject, especially one that is sensitive or difficult to discuss. For example, \"I wanted to broach the topic of my salary increase with my boss.\"",
    "To begin or start something, particularly after breaking through an obstacle or barrier. For instance, \"We finally managed to broach the new market by partnering with a local distributor.\"",
    "To pierce or penetrate something using force, like a spear or axe blade. For example, \"The blacksmith carefully broached the metal to create a well-crafted sword.\""
  ],
  "broad": [
    "Extending far from side to side; wide: a broad river.",
    "Not narrow or confined in any way; spacious: broad prospects.",
    "Having a scope, range, or extent: a broad interpretation of the law.",
    "Unrestricted or uninhibited: felt free to express her opinions broadly.",
    "Unusually or strikingly large or great: a broad smile.",
    "Wide in scope, as a subject or category; encompassing or comprehensive: a broad curriculum."
  ],
  "brochure": [
    "A small, folded booklet usually containing information about a particular place, product, or event."
  ],
  "brogue": [
    "A type of shoe, typically made from leather, featuring a distinct stitched pattern on its surface, often associated with casual or outdoor wear.",
    "A regional accent or way of speaking, characterized by a unique set of pronunciations and intonations, particularly found in rural areas or among certain ethnic groups."
  ],
  "broke": [
    "Not having a certain amount of money needed to buy something, pay a bill, etc.: \"I'm broke and can't afford to go out tonight.\"",
    "Shattered or broken into pieces: \"The vase was accidentally dropped and is now broke.\"",
    "(Of an animal) trained and controlled by its owner using physical force: \"That horse is well-broke and easy to ride.\"",
    "Out of work and unable to find a job; unemployed: \"With so many people broke, it's hard to find a job in this economy.\""
  ],
  "bromide": [
    "A compound of bromine combined with a metal, such as sodium or potassium, used in photography to reduce fogging on film or paper, or to produce certain colors in the final image.",
    "A substance that is dull, unexciting, or uninteresting; something unoriginal or commonplace.",
    "A chemical compound containing bromine and hydrogen (HBr), which can be used as a refrigerant, solvent, or fumigant."
  ],
  "bronze": [
    "A yellow-brown color.",
    "An alloy of copper, tin, and sometimes other elements, often used for sculptures, coins, and other decorative items.",
    "A medal, typically third place, awarded in competitions such as sports or the arts."
  ],
  "brooch": [
    "A decorative piece of jewelry, typically featuring a central gemstone or engraved design, which can be attached to clothing using pins or other fastenings."
  ],
  "browser": [
    "A person who visits websites or uses the internet, typically for leisure or personal interests.",
    "A computer program used to access and view web pages on the World Wide Web.",
    "A device or tool that allows users to browse through information, such as a bookmarking tool or search engine."
  ],
  "bruise": [
    "A mark on the skin caused by a blow, bump, or fall that results in damaged blood vessels and a mixture of red, blue, green, or yellow colors appearing under the skin."
  ],
  "brunch": [
    "A meal that combines elements of both breakfast and lunch, typically eaten in the late morning to early afternoon."
  ],
  "brush": [
    "A handheld tool with bristles, fibers, or wire used to clean, smooth, or apply substances onto surfaces such as teeth, paint, hair, or skin.",
    "To sweep or rub against something quickly and lightly, like sweeping away dirt or dust with a broom or moving the hands across strings of an instrument.",
    "A dense thicket of trees, bushes, or undergrowth in a forest or wilderness area.",
    "A momentary collision between two moving objects, such as cars or athletes in sports."
  ],
  "brushed": [
    "To sweep or move something bristly, feathery, or furry against a surface with short strokes to clean, smooth, or arrange it.",
    "To pass over the surface of (something) in quick light strokes in order to remove dirt or other impurities.",
    "To give a soft and pleasant sensation by touching lightly or gently.",
    "To move quickly across something with short swift strokes.",
    "To create an effect or pattern on a surface, especially with the intention of making it look more attractive or finished."
  ],
  "brusque": [
    "Characterized by an abrupt, short, and often impolite manner in speech or behavior; rude.",
    "Moving or happening quickly with no smooth transition; sudden.",
    "Sharp and angular in outline or form; not softened or rounded.",
    "(Of weather) characterized by a sudden change to cold, wet, or windy conditions."
  ],
  "bubble": [
    "A round, hollow object filled with air or gas that floats on water or other liquid.",
    "An area of overvalued assets such as stocks, often driven by irrational enthusiasm, which is likely to collapse eventually.",
    "A spherical space enclosing a substance or group of substances separate from its surroundings; a vesicle.",
    "An area of gas, liquid, or air trapped within the walls of a structure, such as a building or a roadway, that can expand and contract with temperature changes.",
    "A sound or noise resembling that made by something bursting, popping, or exploding.",
    "(Slang) A group of friends or associates who share common interests, often excluding others."
  ],
  "bucket": [
    "A container made of metal, plastic, or other material with a handle and opening at the top for carrying water, grain, or other loose materials, often with a hinged lid to prevent spills.",
    "An informal term for a large quantity of something; \"a bucket of flowers\" refers to a large arrangement.",
    "In computer programming and data storage, a group of related items arranged together in memory.",
    "A compartment or space that holds a fixed amount of water or liquid, as in a car's cooling system or an airplane's hydraulic system.",
    "In sports, a term for the act of taking a break by sitting on a chair placed on the court or field during play."
  ],
  "bud": [
    "The swollen tip of a plant shoot where leaves and flowers will develop, forming part of the stem and a vital stage in the life cycle of a plant.",
    "A small shoot or sprout that grows from the base of a leaf or from the roots of certain plants.",
    "An informal term for a young person, especially one who is just starting a new activity or job.",
    "A slang term for a small amount of marijuana or cannabis."
  ],
  "budget": [
    "An estimate of income and expenditure for a set period of time, often used to plan and control spending.",
    "A sum of money available for a particular purpose.",
    "A planned arrangement of funds for specific activities or projects.",
    "A list or schedule of proposed financial transactions."
  ],
  "bug": [
    "An insect of various families, especially the Coleoptera and Heteroptera, that is often a pest in gardens or crops.",
    "A brief piece of computer code inserted to test, fix, or otherwise modify a larger program.",
    "A fault or mistake in a system, process, or machine; an error that causes the problem.",
    "An outdated or obsolete device or technology.",
    "A short phrase used as a password or secret message."
  ],
  "bugs": [
    "Insects, especially those that can be annoying or destructive to humans, agriculture, or the environment.",
    "(In computing) software errors, usually caused by coding mistakes and resulting in unexpected program behavior."
  ],
  "build": [
    "To construct something, especially a structure or object, using various materials and techniques.",
    "To create or compile something from individual elements, such as a program or website.",
    "To increase in physical strength or endurance through exercise and training.",
    "In computing, to assemble a software application or system by linking together smaller components or modules.",
    "To cause an emotional response by accumulating instances of something over time (e.g., building trust)."
  ],
  "bulbous": [
    "Having a large, rounded, and usually swollen base or part; resembling or suggesting a bulb in shape or form.",
    "(Of a vehicle's tire) having a large, round, and swollen appearance.",
    "(Of a plant) having a large, rounded, and usually swollen base or part, particularly at the base of a stem or leaf."
  ],
  "bulletin": [
    "A brief statement of news or information that is sent out by a company, organization, or government department to inform people about recent events or developments.",
    "A publication that contains current news and information on a particular subject or event, such as a sports bulletin or weather bulletin.",
    "A message or notice displayed on a screen, board, or other public place to inform people of important updates or announcements."
  ],
  "bulwark": [
    "A defensive wall, barrier, or other form of protection, especially against attack or invasion.",
    "A person or thing that protects or defends something or someone from harm or danger.",
    "A strong or firm support or foundation on which something else relies or depends."
  ],
  "bum": [
    "A slang term for a person who begs or lives in poverty, often associated with homelessness.",
    "The back part of the human body, also referred to as the buttocks or rear end.",
    "In slang, a mistake, error, or blunder; may also refer to someone who consistently makes mistakes."
  ],
  "bumble": [
    "To move clumsily, as in a confused or uncontrolled manner.",
    "To make a lot of noise while moving, especially when trying to be quiet.",
    "To be unable to decide what to do or how to act, often because there are too many options or possibilities."
  ],
  "bumbling": [
    "Clumsy or awkward in movement, actions, or speech.",
    "Inexperienced or unskilled in a particular area or activity.",
    "Characterized by confusion and lack of direction or purpose."
  ],
  "bump": [
    "A small raised area on a surface, object, or person's skin.",
    "To push or strike gently but firmly against something.",
    "A sudden impact or collision between objects, often resulting in damage or injury.",
    "An abrupt increase or decrease in a situation, such as a sudden rise in temperature or a jump in sales.",
    "To move or force someone or something to change direction suddenly, often with a jolt."
  ],
  "bumptious": [
    "Proudly self-important in a rude, obnoxious way.",
    "Arrogantly or insolently assertive; boorishly forward.",
    "Haughty and presumptuous in manner or tone."
  ],
  "bumpy": [
    "With uneven, irregular, or rough surfaces; lumpy, or full of small hills or valleys; not smooth or flat.",
    "To cause to have bumps or irregularities; to make something not smooth or even."
  ],
  "bun": [
    "A round piece of dough, often containing a savory or sweet filling, that is typically baked or fried. Examples include hamburger buns, hot dog buns, and doughnut holes.",
    "(slang) The top of the head or skull; informal. For example, \"he has a shaved bun.\""
  ],
  "bunched": [
    "Arranged in a tight, compact group or cluster, with items crowded together.",
    "(In clothing) gathers or pleats of fabric gathered or bunched together, typically to adjust the fit of a garment around the waist, legs, or sleeves.",
    "(In sports) the act of gathering or bunching up in a certain area, often due to competing for the same resources or territory."
  ],
  "bungle": [
    "To make a mistake, often through carelessness or lack of skill; botch or muddle something up.",
    "To do something clumsily or ineptly, resulting in confusion or failure.",
    "To interfere with or spoil someone's plans or activities, usually unintentionally."
  ],
  "bureau": [
    "A piece of furniture with drawers, typically used for storing office supplies or papers.",
    "An office or department within an organization responsible for a specific function or task.",
    "A group of people working together to achieve a common goal or purpose.",
    "The French language spoken in France and Belgium as well as the official language of 29 countries in Africa"
  ],
  "bureaucracy": [
    "A system in which many people work together to carry out a government, organization, or institution's tasks and responsibilities.",
    "A large organization that is often seen as rigid and inefficient due to its complex rules and procedures.",
    "The administration of a country, organization, or institution, especially through an extensive system of offices and officials."
  ],
  "bureaucratic": [
    "Relating to a government department, especially in terms of its management style, procedures, and organization.",
    "Characterized by red tape, routine, and officialdom; marked by excessive adherence to rules, procedures, or traditions, often at the expense of flexibility and responsiveness."
  ],
  "burgeon": [
    "To grow rapidly or begin to flourish, especially after a period of little or no growth.",
    "(Of flowers or fruits) begin to open or ripen.",
    "(Of plants) Produce an abundance of seeds.",
    "(Of a business or industry) experience rapid growth."
  ],
  "burgher": [
    "An inhabitant of a burgh, which was a Scottish town with certain administrative rights and responsibilities.",
    "(obsolete) A freeman or citizen of a particular town, especially in medieval Europe."
  ],
  "burglary": [
    "The act of entering a building or other structure with the intent to commit theft inside, often by breaking and entering."
  ],
  "burin": [
    "An engraving tool with a sharp, chisel-shaped point, used to incise designs or inscriptions onto various materials such as metal, stone, or wood.",
    "A type of cutting instrument used by Native Americans for carving on birch bark, bone, and antler, typically made from animal bones or antlers.",
    "In a broader context, any sharp-pointed tool used to carve or etch designs into surfaces."
  ],
  "burlesque": [
    "A humorous imitation of a serious literary, artistic, or musical work, often by exaggeration or reduction to absurdity.",
    "A theatrical entertainment characterized by bawdy humor and satirical imitations of serious works, typically featuring lively music, dancing, and striptease.",
    "A style of art, literature, or theater marked by grotesque or ludicrous imitations or combinations of serious works."
  ],
  "burly": [
    "Robust, large, or muscular in build.",
    "Thick, dense, or sturdy; strong in texture or composition.",
    "Hefty, substantial, or considerable; weighty.",
    "Bulky or clumsy in shape or appearance; ungainly."
  ],
  "burned": [
    "Past tense of the verb \"burn\" which means to be destroyed, damaged, or altered by fire, heat, or another source of energy, often causing pain and discomfort.",
    "(Physical) To undergo combustion; to be consumed by fire, heat, or some other agent that causes the material to change into ashes, gases, or other products.",
    "(Metaphorical) To experience a strong feeling of regret, guilt, or shame for something done in the past.",
    "(Literary/Idiomatic) To lose one's hair due to over-processing, excessive sun exposure, or medical conditions like alopecia."
  ],
  "burning": [
    "A process of rapid oxidation, resulting in the release of energy in the form of heat, light, and various chemical compounds.",
    "The sensation experienced when skin is exposed to a source of heat or fire.",
    "An ongoing event characterized by widespread fires, such as a forest fire or wildfire.",
    "A feeling of intense emotion or passion about something.",
    "In music, an effect that increases the amplitude of a sound wave over time."
  ],
  "burnt": [
    "Having been exposed to fire, heat, or another source of high temperature for a long enough time that the material has turned black or brown due to carbonization.",
    "To cook food by exposing it to dry heat, such as in an oven or on a stovetop, until it is fully cooked and browned on the outside.",
    "In photography or digital imaging, to darken or desaturate an image to create an effect of age, wear, or damage.",
    "To experience a severe sunburn or other type of burn from exposure to sunlight or other sources of ultraviolet radiation.",
    "To be subjected to intense heat or fire, causing damage or destruction.",
    "In chemistry, to undergo a chemical reaction where the bonds between atoms in a molecule are broken and rearranged into different bonds, typically leading to a change in color or physical properties of the substance."
  ],
  "burrow": [
    "A hole or tunnel made by an animal, especially a small mammal such as a rabbit or rodent, for living or sheltering in.",
    "(In some contexts) to dig or make a burrow.",
    "To hide or take refuge in a secret place."
  ],
  "burst": [
    "An explosive expansion, as of a balloon when it pops or a bubble when it bursts.",
    "A sudden release of energy, force, or material, such as a firework explosion or a volcanic eruption.",
    "A sudden and violent release of emotion or anger.",
    "To expand or increase suddenly and sharply, such as stock prices rising rapidly or a crowd gathering quickly.",
    "A momentary opening or gap in something solid or continuous, such as a burst pipe or a torn piece of paper."
  ],
  "bury": [
    "To cover something completely with earth, as in a burial of a deceased person or an object.",
    "To hide or suppress something by not bringing it to attention or discussion.",
    "To invest money in such a way that the return is not immediately available for use; put aside or conceal (money) in order to prevent its immediate use or recognition.",
    "In sports, to score over an opponent by a large margin.",
    "In computing, to delete files or data from a storage device, making them unrecoverable without special tools or techniques."
  ],
  "bus": [
    "A large motor vehicle with many seats, used to transport passengers along fixed routes and schedules, such as city or intercity buses.",
    "A small electric or electronic component that connects other components on a circuit board, allowing the transfer of data and power between them."
  ],
  "business": [
    "A commercial activity, involving the exchange of goods or services for money.",
    "An organization engaged in such activity, which may include entrepreneurship, production, distribution, and sales.",
    "A specific task, role, or duty one must perform within an organizational context.",
    "The economic system, trade, or market as a whole, involving the allocation of resources and distribution of goods."
  ],
  "but": [
    "A conjunction used to introduce a contrasting statement, as in \"I like ice cream, but I don't like it too sweet.\"",
    "In computer programming, an operator that performs a logical negation, as in the code snippet: \"if (x != 0) { /*code block*/}\"."
  ],
  "button": [
    "A small flat object used to operate a device, such as a shirt cuff or an electronic gadget.",
    "In computing, a graphical element used to initiate an action, typically by clicking on it with a mouse or touchpad."
  ],
  "buttress": [
    "A structure, usually a column or beam, that provides additional support to an existing structure, especially to prevent it from collapsing under stress.",
    "(Architecture) A large stone block or slab used in medieval fortifications and churches for added strength and stability.",
    "An item or idea that provides support to another; a prop.",
    "A large, powerful argument that supports an idea or proposition."
  ],
  "buy": [
    "To obtain something by paying money or another medium of exchange, such as goods or services from a seller.",
    "To acquire ownership of an item or property from someone else in return for payment.",
    "To invest in securities, stocks, or commodities with the expectation of realizing a profit."
  ],
  "by": [
    "In a position to the side or near something; alongside of, beside.",
    "Near in time or space; shortly after or before.",
    "As part of a route or journey; through or during.",
    "Following or accompanying closely; immediately after.",
    "Serving as an example or model for; following the style or pattern of.",
    "Indicating the person, group, or agency responsible for something; by means of."
  ]
}