{
  "December": [
    "The twelfth and last month of the year in the Gregorian calendar.",
    "A month with 31 days, coming after November and before January.",
    "A time when winter is at its peak in many parts of the world."
  ],
  "dad": [
    "The biological father of a child, often providing care, guidance, and support to offspring.",
    "A term used affectionately by children or others for their father figure, regardless of blood relationship.",
    "A man who takes on the role of a father in a non-biological sense, such as a stepfather, adoptive father, or foster father."
  ],
  "daguerreotype": [
    "An early method of photography that used silver-coated copper plates to produce detailed, one-of-a-kind images known as daguerreotypes."
  ],
  "daily": [
    "Occurring or happening every day; daily activities such as eating, sleeping, and working are considered daily occurrences.",
    "Designed for use on a daily basis; a daily newspaper is published each day with current news.",
    "Happening frequently; the daily struggles of life can be overwhelming at times."
  ],
  "daisy": [
    "A common name for a large number of flowering plants in the family Asteraceae, known for their white petals surrounding a yellow center.",
    "A circular platform or raised area upon which important people sit, especially during ceremonies or formal occasions.",
    "A type of computer keyboard layout that allows users to select items on a screen by pressing a single button and then moving the cursor with another."
  ],
  "damage": [
    "Loss or harm to a person, property, or environment resulting from an event, action, or natural occurrence.",
    "Weakening or destruction of something, especially when referring to physical objects or infrastructure.",
    "Injury or impairment caused to living organisms or ecosystems by human activities, environmental factors, or other sources of stress.",
    "Negative effect on the reputation or standing of a person or organization, often resulting from misconduct or poor performance."
  ],
  "dance": [
    "To move one's body rhythmically, often in response to music, by taking steps, moving arms or body parts in an organized manner.",
    "A series of such movements performed as part of a social event, performance, or exercise.",
    "An animated or lively movement that resembles the action of dancing.",
    "To move lightheartedly and without a care, as if dancing."
  ],
  "dancer": [
    "A person who is skilled in the art of dancing, and performs dance routines or choreography.",
    "An individual who moves rhythmically to music with a high degree of grace, beauty, and fluidity.",
    "A performer who uses movement, steps, and physical motions to express emotions and tell stories through dance."
  ],
  "dandelion": [
    "A plant with yellow flowers that turns into a white, fluffy seed head.",
    "A common weed found in lawns and fields, known for its bright yellow flowers that turn into spherical clusters of seeds.",
    "An herbaceous plant with long taproots and leaves used in salads or as a tea substitute."
  ],
  "dangerous": [
    "Posing a threat to one's safety or well-being, potentially causing harm or injury.",
    "Having the capacity to inflict damage, harm, or injury, often due to its physical or chemical properties.",
    "Presents a high risk or perilous situation, requiring extra caution and care in handling or approaching.",
    "In a non-physical sense, refers to a person or situation that may lead to unfavorable outcomes or negative consequences."
  ],
  "dapple": [
    "A mottled or speckled appearance, often referring to the coloration of an animal's fur or a surface's texture.",
    "To mix colors in such a way as to produce an irregular or marbled pattern, often applied to paints or dyes."
  ],
  "daring": [
    "Showing courage or bravery in facing danger or difficulty, especially by acting boldly without fear of possible misfortune or consequences: \"The rescue team made a daring attempt to save the stranded hikers.\"",
    "Marked by readiness to take risks or face difficulties; brave or adventurous: \"She had a daring spirit that inspired others around her.\"",
    "Unusually bold, risqué, or audacious in expression or action: \"The politician's daring campaign speech earned him both supporters and critics.\""
  ],
  "dark": [
    "Devoid of light; having no illumination",
    "Denoting a color that absorbs all visible light or one that is deep or rich in hue",
    "Not bright or clear, especially in appearance",
    "Ominous, ominously appearing, or foreshadowing evil or misfortune",
    "Mysterious, mysterious-looking, or associated with the supernatural or the unknown"
  ],
  "dastardly": [
    "Cowardly or despicable, often used to describe someone who acts dishonorably or lacks courage in a situation."
  ],
  "date": [
    "A specific period of time, often a day or a certain amount of hours, during which something occurs or is scheduled to occur.",
    "A particular point or moment in time.",
    "An appointment made to meet someone socially or for business purposes.",
    "The arrangement of events and activities planned for an occasion, typically a social event or gathering.",
    "A number or symbol used to represent a specific quantity or value."
  ],
  "daunted": [
    "Intimidated or discouraged, especially when faced with difficulty or adversity.",
    "Dismayed or alarmed; startled into fear or apprehension.",
    "Overwhelmed or overawed by the scale, difficulty, or magnitude of something."
  ],
  "dawdle": [
    "Move or act slowly, typically because one is enjoying oneself or has no hurry.",
    "Waste time through procrastination or delay.",
    "Walk or travel at a slow and leisurely pace."
  ],
  "dawn": [
    "The first light of day appearing in the sky at the start of a new day.",
    "A period or event marking the beginning of something new or different.",
    "To rise or emerge gradually, like the sun rising over the horizon.",
    "An early, initial stage of development or growth."
  ],
  "day": [
    "A period of time from sunrise to sunset, approximately 24 hours in duration.",
    "The time during which one has to work or be awake, such as a business day or a school day.",
    "A particular period of time or era, as in \"a day of peace.\"",
    "A specific moment in time or event, as in \"That was the day I met her.\""
  ],
  "daze": [
    "Cause (someone) to lose consciousness or be stunned, usually by a blow.",
    "To confuse, bewilder or disorient someone, often by an overwhelming event or sensation.",
    "To make (someone) lose awareness of their surroundings, often temporarily, due to fatigue or physical exhaustion."
  ],
  "dazzled": [
    "Overwhelmed, confused, or unable to think clearly due to being given too much information or having too many things happening at once; also, affected with a sensation of brightness, brilliance, or shininess that is so intense it interferes with normal vision or activity."
  ],
  "deal": [
    "A transaction, especially involving the exchange of goods, services, or money between two parties.",
    "To handle or manage (a difficult situation) successfully.",
    "To distribute cards to each player in a card game.",
    "To mix together thoroughly.",
    "To supply or provide with something necessary or desirable.",
    "To perform an operation on a computer, such as saving or printing a document.",
    "In card games, the act of discarding one card from the hand in order to draw another."
  ],
  "dearth": [
    "A scarcity or lack of something; insufficiency.",
    "The state of being deprived or lacking in a resource or necessity.",
    "A deficiency or paucity of people, resources, or opportunities in an area.",
    "A condition where there is not enough of something to meet the needs or demands of people in an area."
  ],
  "debate": [
    "A discussion in which people present their different opinions, ideas or arguments on a particular topic, trying to convince others that their point of view is correct.",
    "A formal contest between two speakers, presenting opposed cases or propositions, before an impartial judge or judges, who awards a prize or gives a decision according to the merit of the argument."
  ],
  "debauchery": [
    "Immoral behavior involving excessive indulgence, especially in pleasure or sensuality.",
    "Engaging in lewd or licentious conduct; obscene or vulgar behavior.",
    "A state of moral decay, corruption, or depravity.",
    "Unrestrained dissipation or profligacy."
  ],
  "debilitate": [
    "Weaken, impair, or render less effective (someone's health, physical strength, mental abilities, etc.) as a result of illness, aging, or injury.",
    "Cause someone to be unable to perform tasks, functions, or responsibilities that they were previously able to do due to their weakened condition."
  ],
  "debutante": [
    "A young woman making her formal introduction into society at a special event, often referred to as a debutante ball or coming-out party."
  ],
  "decadent": [
    "Characterized by an excessive indulgence in pleasure, luxury, or sensuality.",
    "Belonging to or characteristic of a period marked by self-indulgence and moral decline.",
    "Of or relating to works of art that reflect such themes or characteristics."
  ],
  "deceit": [
    "An act of tricking or misleading someone through dishonest means, especially for personal gain.",
    "A thing that is false or misleading; an instance of dishonesty.",
    "The quality of being artful or skillful in deception."
  ],
  "deceitful": [
    "Characterized by a person who is not honest, truthful, or sincere in what they say or do; dissembler.",
    "Concerning something that appears to be true but is actually false; misleading or untruthful.",
    "Involving a deliberate act of dishonesty, such as lying, cheating, or stealing, for personal gain or to deceive others."
  ],
  "deceive": [
    "Trick, mislead, or cause someone to believe something that is not true by giving false information or creating a false impression.",
    "Cause someone to have a mistaken belief about something by deliberately misinforming them.",
    "Convince someone of an untruth, usually for personal gain or advantage."
  ],
  "december": [
    "The twelfth and final month of the year in the Gregorian calendar, following November and preceding January.",
    "A month length of 30 or 31 days, depending on the leap year."
  ],
  "decentralization": [
    "The distribution of power, authority, or resources away from a central location or authority towards smaller units or localities.",
    "A system or process where decision-making and control are dispersed among multiple entities rather than being concentrated in one centralized authority.",
    "In the context of computer networks, it refers to the distribution of tasks and responsibilities across multiple nodes or locations, rather than relying on a single central server or point of control."
  ],
  "decibel": [
    "A unit of measurement for sound intensity, used to express the relative loudness of sounds.",
    "The decibel scale is logarithmic, meaning that every increase of ten decibels represents a doubling of the sound power level or intensity.",
    "Decibel levels are widely used in various fields such as acoustics, electronics, and telecommunications to measure noise levels, signal strength, and volume."
  ],
  "decimal": [
    "A base-ten numeral system that uses ten digits (0, 1, 2, 3, 4, 5, 6, 7, 8, and 9) to represent numbers.",
    "A number expressed in this system, such as 42 or 0.75."
  ],
  "decimate": [
    "Reduce greatly in number; cause significant destruction or damage to a group, area, or thing through some event, action, or process.",
    "Remove or eliminate every tenth person from a group as a punishment or example during ancient Roman times.",
    "Decrease or reduce something by one-tenth of its original amount.",
    "Destroy a significant portion of a military force in battle, leaving a large number of casualties."
  ],
  "decipher": [
    "To understand and translate a difficult, mysterious, or encrypted text by breaking the code or language used.",
    "To make clear and easy to understand something that was previously complicated, ambiguous, or difficult to comprehend.",
    "To solve a cryptogram, puzzle, or other coded message by determining its meaning."
  ],
  "deciphered": [
    "To translate or understand text that was previously written in a code, cipher, or cryptic language, making it legible or comprehensible."
  ],
  "decision": [
    "A choice between different options or courses of action, often involving careful consideration.",
    "The act of determining or resolving something, usually by a group of people in an official capacity.",
    "An end to uncertainty; the result of making a choice or settling on a course of action."
  ],
  "declamatory": [
    "Characterized by vehement speech, especially in a public or formal setting.",
    "Employing exaggerated style or expression; bombastic.",
    "Expressing strong feelings or opinions in a forceful manner.",
    "Given to grandiose and dramatic expression or style; rhetorical."
  ],
  "declaration": [
    "An official statement or announcement, especially one that expresses a decision to do something or takes a position on an issue.",
    "A formal document or proclamation, such as a constitution, bill of rights, or declaration of independence.",
    "A clear and open expression of a person's feelings, opinions, or intentions, often in writing."
  ],
  "deduct": [
    "Subtract a specified amount from something, like an account balance or total cost, often to pay for expenses or taxes. For example, \"We will deduct the tax from your refund.\"",
    "Take away (a part) of something as if by subtraction, as in removing a sum of money from an account or decreasing a total amount owed. Example: \"Deducting 10% from the bill to cover the cost of services.\""
  ],
  "deductible": [
    "The amount of money that an individual must pay out-of-pocket for a product, service, or medical treatment before their insurance coverage begins to cover the costs.",
    "(Finance) An amount subtracted from a larger sum before calculating tax or other charges; used in budgeting, accounting, and financial planning."
  ],
  "deed": [
    "An act of kindness, bravery, or generosity that someone does.",
    "A formal written document that records the transfer of property from one person to another.",
    "The act of doing something, especially something good or important.",
    "Something that someone has accomplished or achieved, such as a task or goal."
  ],
  "deface": [
    "To mar or spoil the appearance of something by scratching, carving, painting over, or otherwise altering its original surface in a destructive manner.",
    "To make indecent or obscene images out of the existing design or art work on a surface.",
    "To damage, ruin, or destroy by scratching or marring a surface.",
    "To destroy or spoil the integrity of something by alteration or mutilation."
  ],
  "defalcate": [
    "To deduct or withhold a portion of something, such as money or interest, usually for the benefit of a third party.",
    "To make a reduction or withdrawal from a sum of money, often used in legal and financial contexts.",
    "To cut back on expenses or resources in order to save money or conserve resources."
  ],
  "defamation": [
    "The act of damaging someone's reputation through false statements, either spoken (slander) or written (libel).",
    "The state of being defamed or the offense of defaming a person or their character."
  ],
  "default": [
    "A situation where an obligation, such as a payment, is not met in time or as agreed upon; typically associated with missed credit card payments, loans, or bills.",
    "In computing, a setting or action taken when no specific choice is made by the user; for example, a default program that opens a certain file type if no other program is specified to open it.",
    "In programming, the value assigned to a variable when no other value has been provided; used when the actual desired value may vary.",
    "A pre-selected option in a software interface or system settings that is set as the initial choice for new users or when no specific choice has been made by the user.",
    "In legal documents, if terms are not explicitly agreed upon, default terms may apply; these terms are specified within the contract and take effect unless specifically rejected by the parties involved."
  ],
  "defeated": [
    "Overcome or conquer in battle or by force.",
    "Prevent from winning, achieving, or accomplishing something.",
    "To stop or bring to an end something undesirable, like a bad habit.",
    "To win a competition or contest against an opponent."
  ],
  "defendant": [
    "An individual or organization that is being prosecuted, sued, or accused in a legal case.",
    "A person who is officially charged with an offense or crime and must answer to the charges in court.",
    "An entity against whom legal action is taken, such as a lawsuit or indictment."
  ],
  "defenestrate": [
    "Throw someone or something out of a window, especially as an act of violence or punishment."
  ],
  "deference": [
    "Respect shown by one person or group to another, often through behavior that acknowledges superior status or authority.",
    "A willingness to yield or submit to the judgment or wishes of others, often out of respect for their expertise or position.",
    "The act of treating someone or something with consideration, often in recognition of their importance or significance."
  ],
  "defiance": [
    "Open opposition; active resistance to authority or convention.",
    "A bold assertion of one's rights or opinion in spite of authority.",
    "The act of refusing to submit or give in, even when faced with force or authority."
  ],
  "defiantly": [
    "In a manner that shows determination to resist authority or give opposition; boldly or courageously refusing to obey, give in, or change one's actions despite facing difficulty, opposition, or authority; by standing up and saying \"no\" forcefully to someone or something that is trying to control or dominate."
  ],
  "deficiencies": [
    "A lack or shortage of something, such as nutrients, vitamins, minerals, or other essential substances.",
    "The state of being incomplete or insufficient in a specific area, often referring to skills, knowledge, or abilities.",
    "An imperfection or flaw in an object or system, indicating that it does not meet the required standards or expectations."
  ],
  "deficiency": [
    "A lack or insufficiency of something, such as nutrients in a diet or essential elements required for normal functioning.",
    "Inadequacy or shortage in quantity, quality, or capacity.",
    "Insufficient amount or level to meet a standard or requirement, often used in reference to vitamins and minerals in food."
  ],
  "deficient": [
    "Insufficient in quantity, quality, or capability to fulfill a specific requirement or need.",
    "Lacking something necessary or desirable; inadequate, as in skills, resources, or knowledge.",
    "Not meeting an established standard or level of performance.",
    "Not adequate or complete; incomplete or lacking something essential."
  ],
  "definition": [
    "A clear explanation of what a word, concept or thing means, usually in a dictionary or glossary.",
    "In mathematics, a precise statement that defines what a certain term represents or the relationship between two terms.",
    "In art and photography, the clarity of an image, often measured by the number of distinct vertical lines per unit distance.",
    "A clear boundary between areas of different characteristics, such as countries or forest types.",
    "In computing, a set of rules that determine how a program should function."
  ],
  "definitive": [
    "Conclusively final, decisive, or authoritative; serving as a standard for comparison.",
    "Providing a clear and complete answer to a question or problem; definitive.",
    "Unambiguous and unequivocal; leaving no doubt about the meaning or intentions."
  ],
  "defoliated": [
    "The complete removal of leaves from a plant, typically by natural processes like shedding or disease, or human intervention like harvesting or pesticide application."
  ],
  "defoliation": [
    "The act or process of removing leaves from a plant, typically by natural causes such as wind, rain, or insects, or artificially through human intervention like pruning or harvesting."
  ],
  "defoliator": [
    "An agent, such as a pest or a machine, that removes leaves from plants, particularly in agriculture for easier harvesting or pest control.",
    "A device used in forestry to remove tree branches and foliage for easier transportation and processing."
  ],
  "deforestation": [
    "The process of removing trees from an area, often leading to environmental problems such as soil erosion and loss of habitat for animals."
  ],
  "defunct": [
    "No longer in operation, use, or effect; obsolete, discontinued, or out of date.",
    "Not functioning; broken or dead.",
    "Bankrupt or insolvent; unable to meet financial obligations.",
    "Having ceased to exist or be effective; extinct.",
    "Inactive or dormant; no longer active or productive."
  ],
  "degree": [
    "An individual level of a scale, especially in terms of intensity, temperature, or difficulty.",
    "A unit of measurement used to express the angle between two lines or planes, such as in geometry or trigonometry.",
    "The rank or status granted by an institution after successful completion of a course of study, such as a bachelor's degree, master's degree, or doctorate."
  ],
  "deign": [
    "To condescend to; to show oneself willing to do something; to deem it appropriate or necessary to do something.",
    "To consent to, permit, or allow; to grant permission for something.",
    "To be gracious or generous enough to do something; to consider it worthy of one's effort.",
    "To consider or treat (someone) with superiority or contempt."
  ],
  "deity": [
    "A supernatural being, typically regarded as divine or sacred, often considered to be a ruling power in the universe, and worshipped in some religious traditions.",
    "Any god or goddess from any religion or mythology, including Greek, Roman, Egyptian, Hindu, or Norse deities, among others."
  ],
  "dejected": [
    "Feeling very sad, disappointed, or downhearted; depressed in spirits or mood."
  ],
  "delayed": [
    "Occurring or happening later than planned or expected.",
    "Not being immediately available; having a delay in arrival or accessibility.",
    "Being behind schedule; experiencing a delay in progress or completion.",
    "Postponed or put off from the usual time, date, or event."
  ],
  "delegation": [
    "A group of people appointed to represent their organization, country, or region in a specific event, meeting, or negotiation.",
    "The act of delegating duties, tasks, or responsibilities from one person or group to another for the purpose of efficient work division or expertise utilization."
  ],
  "deleterious": [
    "Harmful or damaging, causing a decrease in the quality or value of something."
  ],
  "deliberate": [
    "Pursue a course of action with careful thought and consideration.",
    "Choose something carefully after thinking about it for some time.",
    "Move slowly or steadily on purpose, often to avoid detection or to make a specific decision."
  ],
  "deliberation": [
    "Pondering over an issue or problem before deciding on the course of action.",
    "Reflecting deeply on something, usually as a part of decision-making process.",
    "Careful examination and evaluation of different options before taking a final decision.",
    "Considering various aspects of a topic or issue thoroughly before reaching a conclusion.",
    "Taking time to consider the implications of a course of action before making a decision.",
    "Thinking carefully about something in order to arrive at an accurate judgment.",
    "Engaging in an in-depth analysis to reach a well-considered decision or opinion."
  ],
  "delicatessen": [
    "A specialty food store offering a variety of cured meats, cheeses, pickled vegetables, olives, etc., often also serving sandwiches and light meals.",
    "An establishment that sells high-quality foods such as fresh produce, gourmet items, or prepared dishes, typically featuring an extensive selection of imported or specialty items."
  ],
  "delicious": [
    "Tasting extremely good, enjoyable to eat or drink",
    "Relating to or expressing a strong liking for something pleasant",
    "Indicating that something is very pleasing to the senses, particularly taste"
  ],
  "delineate": [
    "To draw or outline something, especially a clear or detailed picture of it, in order to show its shape, details, and position accurately.",
    "To make the difference between two things more noticeable by highlighting their contrasts or differences."
  ],
  "delinquent": [
    "A person who is habitually negligent in the fulfillment of their obligations, duties, or responsibilities.",
    "Someone who has not paid a debt, bill, or other financial obligation when it was due.",
    "An individual who violates laws or rules and commits criminal acts, especially as a regular way of life.",
    "A young person who is involved in criminal behavior or activities."
  ],
  "deliquesce": [
    "To dissolve and become liquid, especially as a result of absorbing moisture from the air."
  ],
  "delirious": [
    "Marked by a state of wild and disordered imagination, often in a confused or excited state, as due to fever, extreme fatigue, or a strong emotional response.",
    "In a frenzied or unrestrained state, characterized by wild, extravagant, or illogical behavior, thoughts, or speech.",
    "Overwhelmed with excitement, joy, amusement, or enthusiasm, usually to the point of losing control over one's actions or feelings."
  ],
  "deliver": [
    "To bring something to a specific destination or person, especially through transportation.",
    "To give birth to a child, as in childbirth.",
    "To complete or fulfill a promise, responsibility, or obligation.",
    "In sports, to score by kicking the ball between the goalposts.",
    "In business, to provide a product or service to the customer."
  ],
  "delivered": [
    "Handed over, presented, or produced (something) to another person, group, or organization.",
    "Carried out successfully an action or task that was planned, promised, or expected.",
    "Conveyed or transmitted something from one place, point, or stage to another; as in transportation of goods or information.",
    "Brought a child into the world during childbirth; as in 'The baby was delivered by a doctor'."
  ],
  "deliveries": [
    "The number of times a baseball pitcher delivers the ball to the catcher during a game.",
    "A delivery service is a company that transports packages and goods from one place to another, often for a fee. It can also refer to a process in which an idea or message is delivered to its intended recipient."
  ],
  "delude": [
    "Deceive or mislead someone, often intentionally, into believing something that is not true."
  ],
  "delusion": [
    "A strongly held belief that is false or incorrect, even though evidence proves it to be so.",
    "An idea or situation that someone believes in despite the fact that it is not true or cannot possibly exist."
  ],
  "delusional": [
    "Having false beliefs or impressions that are firmly held despite strong evidence to the contrary.",
    "Involving or characterized by hallucinations, irrational thoughts or beliefs, and other signs of mental disorder.",
    "Believing or imagining something that is not true or real, typically as a symptom of a mental disorder."
  ],
  "delusionary": [
    "Relating to or marked by a false belief or impression that is held despite evidence to the contrary; characterized by delusions."
  ],
  "delve": [
    "To explore something in great detail by studying, examining, or researching it thoroughly.",
    "To dig deeply into something with determination, such as finding information or solving a problem.",
    "To dig or excavate something, like a tunnel or mine shaft, by going deep below the surface.",
    "To search for information or details about something by going through various sources or materials.",
    "To go deeply or thoroughly into something, in any sense of the term."
  ],
  "demagnetize": [
    "Remove magnetic properties from an object by applying opposing magnetic force or exposure to a non-magnetic field, restoring its original state as a non-magnetic material."
  ],
  "demagogue": [
    "A leader who gains power by making emotional appeals to the people, often using simplistic arguments, promises that seem too good to be true, and exploiting fears or prejudices for personal gain."
  ],
  "demagoguery": [
    "The practice of gaining popularity by appealing to the emotions, prejudices, and wishes of the people for personal or political advantage.",
    "A style of leadership characterized by populist appeals and a disregard for constitutional principles.",
    "Excessive or misguided zeal in the pursuit of a cause or ideal."
  ],
  "demarcate": [
    "To establish, mark, or designate boundaries or limits between two or more areas, regions, or territories.",
    "To separate or distinguish one thing from another by drawing a boundary or line.",
    "To indicate the beginning and end of an area or region, often on a map or chart."
  ],
  "demarcated": [
    "Dividing or marking out boundaries or limits between two areas, territories, or regions.",
    "Showcasing the separation of different sections or aspects within a subject or topic.",
    "Identifying and defining the limitations or distinctions between various subjects, fields, or categories."
  ],
  "demarcation": [
    "The act of drawing a boundary or dividing line between two areas or territories.",
    "A boundary or line that separates one area or territory from another.",
    "The process of distinguishing the limits of something, such as responsibilities or jurisdictions.",
    "In maps and charts, the outlines that define the borders of countries, regions, or areas."
  ],
  "demarcations": [
    "Distinct boundaries or borders between different areas, regions, or territories.",
    "Clear divisions or separations between different subjects or concepts in a particular field of study.",
    "The act of setting limits or defining the extent or scope of something.",
    "A line or area marking the boundary between two countries or territories.",
    "The division or separation of something into distinct parts or categories."
  ],
  "democracy": [
    "A system of government in which power is held by the people, either directly or through elected representatives.",
    "A form of government where citizens have the right to vote for their leaders, and decisions are made through majority rule.",
    "A political system characterized by free and fair elections, civil liberties, human rights, and the rule of law."
  ],
  "demographic": [
    "Refers to the characteristics of a population, such as age, gender, education level, occupation, and location, used to segment and understand the needs or preferences of that group.",
    "A classification or categorization of people based on shared attributes, often for marketing, political, or social research purposes."
  ],
  "demographics": [
    "The characteristics of a population, such as age, gender, income, occupation, education, and location. These features are used in statistics to analyze and understand the population."
  ],
  "demolition": [
    "The act of destroying or dismantling a building or structure, often through controlled explosions or systematic disassembly, typically as part of a construction project or to reclaim the space.",
    "An event or situation in which something is destroyed, damaged, or undermined, especially by deliberate action."
  ],
  "demonstrable": [
    "Able to be shown or proven through evidence, facts or examples.",
    "Capable of being made clear or obvious by tangible signs or indications.",
    "Subject to clear and convincing proof; capable of being made evident."
  ],
  "demonstrate": [
    "Show clearly that something is true, real, or possible by giving evidence or examples.",
    "Display or perform a skill, idea, or technique to teach or explain it to others.",
    "Publicly exhibit or present something for people's approval, appreciation, or awareness."
  ],
  "demonstrates": [
    "Shows or presents evidence of something, such as a fact, skill, or idea.",
    "Provides clear examples or instances to support a claim or statement.",
    "Displays or outwardly expresses an emotion or reaction.",
    "Illustrates or makes evident through actions or behavior."
  ],
  "demonstration": [
    "A public display of support or protest for a particular cause, often involving people gathering together to march, rally, or hold signs.",
    "An act of showing or proving something through actions, examples, or evidence.",
    "A process or method of explaining something by using visible and tangible examples."
  ],
  "demonstrative": [
    "Adjective - Referring to someone who is expressing feelings openly, such as affection or enthusiasm.",
    "Adjective - Describing a word or phrase that directly refers to something specific nearby, such as \"this\" or \"these.\"",
    "Adjective - Relating to an action or display that visibly demonstrates or illustrates something, like a demonstration."
  ],
  "demoralize": [
    "Undermine someone's confidence, spirit, or morale, often through criticism, defeat, or adversity.",
    "Cause a group to lose courage, determination, or willpower, typically by undermining their belief in themselves or their cause."
  ],
  "demoralizing": [
    "Depriving of spirit, courage, or morale; discouraging or disheartening.",
    "Making someone feel depressed, hopeless, or less confident in their abilities or worth.",
    "Causing a group or organization to lose strength, confidence, or unity."
  ],
  "demulcent": [
    "An agent that soothes or alleviates inflammation or irritation, particularly in the form of a medicine or remedy.",
    "A substance that provides relief and comfort to sore or irritated parts of the body by creating a protective barrier or coating.",
    "A medication or treatment that eases pain or discomfort caused by inflammation or irritation."
  ],
  "demure": [
    "Modest, shy, or quiet in a pleasant and unassuming way, often with lowered eyes or downcast gaze.",
    "Showing reserve or restraint in behavior or appearance, especially in a charming or attractive manner.",
    "Displaying or expressing humility or meekness, typically as a virtue or part of one's character."
  ],
  "demurrage": [
    "A fee or charge imposed on a ship owner or carrier for delayed loading or unloading of cargo beyond an agreed-upon time, typically in maritime contexts.",
    "In insurance, the amount subtracted from a claim when it is paid out later than expected or due to delays caused by the insured party."
  ],
  "demurral": [
    "A refusal to accept or acknowledge something, often as a protest or objection.",
    "A delay in accepting or performing a duty or obligation due to valid reasons or objections.",
    "In shipping and transportation, the act of detaining or holding back a vessel or cargo for an agreed-upon period."
  ],
  "demystify": [
    "To make something less confusing, complex, or mysterious by providing a clear explanation or understanding of it.",
    "To reveal the truth or facts about something previously obscure or misunderstood.",
    "To simplify a concept or idea so that it is easier to comprehend and grasp."
  ],
  "denigrate": [
    "To belittle, disparage, or discredit someone or something.",
    "To lower the reputation or standing of a person or thing by spreading false information or rumors.",
    "To degrade, humiliate or make less important by criticizing."
  ],
  "denigration": [
    "An act of lowering someone's reputation, standing or character by expressing negative opinions about them.",
    "The expression of disrespect, contempt or ridicule towards an individual or group.",
    "A deliberate attempt to discredit someone or something through criticism, disparagement or defamation."
  ],
  "denim": [
    "A durable fabric made of cotton, usually blue in color, commonly used for making jeans and other clothing items.",
    "Clothing, particularly trousers or jackets, made from the denim fabric.",
    "Any product made from denim fabric, such as bags or accessories."
  ],
  "denizen": [
    "A person who has lived in a particular place for a long time, especially a foreign-born person living in a country other than their own.",
    "A native or inhabitant of a specific region or country.",
    "In literature and mythology, any supernatural being, creature, or entity that is said to dwell in a certain place."
  ],
  "denomination": [
    "A group of individuals who adhere to a specific set of beliefs, practices, and principles in a religious or spiritual context, often with its own distinct name and organization.",
    "In finance, a term used to describe different types of money, such as coins or banknotes, based on their material, size, and denomination value.",
    "A brand name given to products made by a specific company, such as a 'brand denomination' for cereals, chocolates, or beverages."
  ],
  "denominator": [
    "In mathematics, specifically in fractions, the number below the fraction bar that indicates how many parts there are in each whole. For example, in the fraction \"3/4\", the denominator is 4 because there are four equal parts in one whole.",
    "(In a more general sense) The number of elements or values in a group or set being compared to another number to determine a proportionate relationship. This concept can be found in various fields like statistics, chemistry, and physics."
  ],
  "denouement": [
    "The resolution of a complex situation, storyline, or problem in which various threads come together.",
    "In literature, theater, and film, the conclusion or ending of a story, especially one that reveals and untangles the complications that have occurred throughout the work."
  ],
  "denouncing": [
    "To publicly declare someone or something to be wrong, immoral, or undesirable; to condemn strongly.",
    "(In a legal context) To formally disavow or repudiate an agreement, treaty, or contract.",
    "To renounce or reject someone or something in no uncertain terms."
  ],
  "dental": [
    "Pertaining to the teeth, mouth, or dentistry",
    "Involving or using dental tools or techniques",
    "Relating to the study of the structure, function, and health of teeth",
    "Associated with the prevention, diagnosis, and treatment of oral diseases and conditions",
    "Concerning the design, manufacture, or sale of dental products and equipment"
  ],
  "denunciation": [
    "A public declaration of something as morally wrong, bad, or deserving criticism; a strong disapproval.",
    "An act of condemning or denying someone or something, often in writing.",
    "The act of publicly accusing or criticizing another person, group, or thing."
  ],
  "deodorant": [
    "A substance applied to the skin, especially under the arms, to prevent body odor by neutralizing perspiration or masking its smell."
  ],
  "department": [
    "A group within an organization, such as a company or government agency, that focuses on a specific area or function like sales, finance, or human resources.",
    "A section of a larger building, especially in a school or store, where one type of activity takes place, such as math classes or clothing sales."
  ],
  "departure": [
    "The act of leaving a place, especially after an extended stay or upon completion of a trip.",
    "A difference between two related things, such as one version of software and the previous version.",
    "In aviation, the moment when an aircraft begins to move away from the gate, terminal, or parking spot, commencing its journey.",
    "The amount by which a measured value or observed phenomenon differs from the expected or standard value."
  ],
  "depend": [
    "Be reliant or contingent upon something or someone for support, success, or well-being.",
    "Have an effect or result that is influenced by or determined by another thing or action.",
    "To be in a state of uncertainty or waiting due to the outcome of another event.",
    "Be subject to change or modification based on various factors or conditions."
  ],
  "dependent": [
    "Needs help or support from someone else in order to exist or survive, typically because of age, illness or disability.",
    "Subject to another person or thing for support, assistance or protection; reliant.",
    "(Of a variable in mathematics) having a value that is determined by the values of one or more other variables."
  ],
  "depict": [
    "To represent something, especially in a drawing or painting; to illustrate or portray visually.",
    "To present an idea or feeling in words; to describe vividly or convey imaginatively.",
    "(In computing) To display or show (a graphic or image) on a screen or monitor."
  ],
  "deponent": [
    "A person who makes a formal declaration, especially in a legal document or under oath.",
    "In Christianity, a term used to describe someone who has been baptized and therefore become a follower of Jesus Christ.",
    "An obsolete term for someone who is considered worthy of belief or trust."
  ],
  "deposit": [
    "An act of placing something, such as money, in a bank account.",
    "A substance that is left behind after another substance has been removed or evaporated.",
    "To place an object onto or into a designated area or container.",
    "A layer or layer-like accumulation of sedimentary material, especially in the bed of a watercourse or on the floor of a lake or sea."
  ],
  "deposition": [
    "The act of depositing something, such as money into a bank account.",
    "A statement given by a witness in a legal case that is written down instead of spoken out loud in court.",
    "In geology, a layer of sediment or rock formed by the accumulation of materials transported by water, wind, or other natural processes."
  ],
  "depository": [
    "A central location used to store, maintain, and manage financial instruments such as stocks, bonds, and other securities for safe-keeping and administration on behalf of investors.",
    "In banking terms, a place where banks keep their cash reserves or valuables in safe custody."
  ],
  "depraved": [
    "Having a deeply corrupt moral nature; wicked, immoral, or evil.",
    "Corrupted in mind or character, as a person who is morally perverse and lacks the ability to distinguish between right and wrong actions.",
    "Depraved can also refer to inanimate objects or situations that are corrupted or have become warped due to some kind of moral decay or perversity."
  ],
  "depravity": [
    "A high degree of moral corruption; wickedness, immorality, or villainy.",
    "An act or instance of indulging in vice or sinful behavior.",
    "The state or quality of being depraved, morally corrupt, or wicked."
  ],
  "deprecate": [
    "Express disapproval of; criticize.",
    "To formally discourage something, especially for historical or cultural reasons.",
    "In programming, to mark a piece of code as deprecated, indicating that it should not be used and will be removed in the future."
  ],
  "deprecation": [
    "Disapproval or criticism, often in a mild or polite way.",
    "A formal expression of disapproval of something, such as a software feature.",
    "In programming, a method of marking code or practices that are considered obsolete or inferior and should no longer be used."
  ],
  "depreciate": [
    "To experience a decrease in value, especially over time.",
    "To reduce the estimated value of an asset for accounting purposes due to factors such as wear and tear or obsolescence.",
    "To lessen the worth or value of something by overuse, neglect, or passing of time."
  ],
  "depreciated": [
    "Lowered in value, worth or quality over time.",
    "Reduced in price due to age or usage.",
    "Accounting term referring to the allocation of a asset's cost over its useful life.",
    "In computing, refers to the decline in value of hardware or software due to technological advancement or obsolescence."
  ],
  "depreciation": [
    "In accounting, the allocation of the cost of an asset over its useful life, often through depreciation expense, which reduces the reported value of the asset on a company's balance sheet. This process is used for tangible assets like buildings, machinery, and vehicles as well as intangible assets such as patents or copyrights.",
    "When speaking in the context of personal finance, depreciation can refer to the decrease in the value of an investment over time, often due to market fluctuations or other external factors.",
    "The term \"depreciation\" may also refer to the gradual loss in value that occurs when a product or service is used or consumed, such as the way a car loses value after it's driven off the lot."
  ],
  "deprivation": [
    "The act of taking away or withholding something from someone, such as a right, freedom, opportunity, or resource.",
    "A state or condition where one lacks basic necessities such as food, water, or shelter.",
    "The loss of something that is considered essential or important to an individual's well-being, such as emotional support, social interaction, or intellectual stimulation."
  ],
  "depth": [
    "The distance from the surface of something, such as a lake or ocean, to its bottom; also refers to the depth of an object or space.",
    "A state of emotional seriousness or intensity.",
    "In art and design, the illusion of three-dimensionality created by the use of overlapping shapes or colors that gradually recede into the background."
  ],
  "derailment": [
    "The act of causing a train to come off its rails, often due to an accident or mechanical failure.",
    "A sudden change in the course of events, leading them away from their original direction or goal.",
    "(Railway terminology) An incident where a train leaves its intended track, usually due to mechanical faults or external factors."
  ],
  "derelict": [
    "Abandoned, neglected, or in a state of disrepair."
  ],
  "derision": [
    "Contemptuous laughter, mockery, or scorn directed towards someone or something.",
    "The act of making fun of, ridiculing, or laughing at someone or something in a contemptuous way.",
    "Disrespectful treatment or attitude displayed by belittling remarks or actions."
  ],
  "derivation": [
    "The process of forming a word by modifying an existing one, often through adding, changing or removing parts of the base word.",
    "A deduced result or conclusion reached through reasoning or logical analysis.",
    "The act of tracing something back to its origin, source, or earlier form."
  ],
  "derivative": [
    "A mathematical concept representing the rate of change of a function with respect to one of its variables, calculated by taking the limit of the ratio of infinitesimal changes in the function and its variable as the infinitesimal approaches zero. In calculus, derivatives are used to analyze how the value of a function changes when its input is varied.",
    "An investment or financial instrument whose value is derived from an underlying asset, such as a stock or bond, used for hedging or speculation. Derivative securities include options, futures, and swaps.",
    "In literature or art, a work that imitates or is based on the ideas, style, or themes of another work. This can also refer to a secondary expression of a primary idea."
  ],
  "dermatologist": [
    "A medical specialist who diagnoses and treats skin, hair, and nail conditions and diseases."
  ],
  "derogation": [
    "The act of reducing, lessening, or diminishing something.",
    "A departure from a rule, standard, or principle.",
    "An act or instance of belittling or disparaging someone or something."
  ],
  "derrick": [
    "A tower-like structure used to hoist heavy materials, such as goods, construction materials, or people.",
    "A machine with a boom that supports a cable or chains attached to a hoist, typically used in the lifting and lowering of materials.",
    "A device used for drilling or extraction purposes, often found in oil rigs or mines."
  ],
  "descendant": [
    "A person or thing that is a later issue of an earlier one; especially a child, grandchild, etc., of a person or family.",
    "Something derived from or developed from something else; as a computer program or language.",
    "In genealogy, a member of the next generation below another in the line; a child or direct lineal descendant."
  ],
  "description": [
    "A detailed account of something in words, typically used to convey its appearance, characteristics, or nature.",
    "An explanation or representation of a situation or event.",
    "A written or spoken statement that gives information about someone or something.",
    "The act of making an account or giving details.",
    "(In art) The process of representing or depicting the appearance of something in words, images, or other forms of expression."
  ],
  "desecrate": [
    "To show disrespect towards a sacred place, object, or person by defiling or damaging it.",
    "To violate the sanctity of something considered holy or important.",
    "To commit an act that is seen as profaning or polluting something sacred or significant."
  ],
  "desecration": [
    "The act of treating a sacred place, object, or text with disrespect or abuse.",
    "The act of destroying, damaging, or profaning something that is held in high regard or reverence.",
    "An action that shows a lack of respect for something or someone, often involving a violation of its sanctity or purity."
  ],
  "desensitized": [
    "Having become less sensitive or responsive to something, especially as a result of repeated exposure to it."
  ],
  "desert": [
    "An area of land that is dry, barren, and has little or no vegetation.",
    "A region characterized by extreme heat during the day and cold at night, often found in continental interiors.",
    "To abandon someone or something, leaving them without support or assistance.",
    "A sweet dish made from a rich sauce thickened with egg yolks or custard and served with fruit, nuts, or cookies."
  ],
  "desiccant": [
    "A substance that absorbs moisture from the air, used to keep equipment or materials dry in humid conditions.",
    "An agent added to a product packaging to prevent damage caused by moisture absorption during transportation and storage."
  ],
  "desiccated": [
    "Dried out or dehydrated, especially referring to something that has lost its natural moisture content.",
    "Shriveled or withered, often describing a plant or plant matter due to lack of water.",
    "In medicine and pharmaceuticals, refereing to a dried preparation, usually of a natural substance such as herbs, fruits, or other plants.",
    "Dry, arid, or parched in terms of climate or geography."
  ],
  "desiccating": [
    "Drying out or causing something to become dry.",
    "Causing something to lose its moisture or cause it to wither."
  ],
  "desiderata": [
    "Objects or situations that one desires to have or experience but does not currently possess or encounter, often implying a sense of longing or aspiration."
  ],
  "desideratum": [
    "Something that is desired, wanted, or needed; a necessity, requirement, or prerequisite for completion of a task or project.",
    "A thing required to make something complete or perfect; an essential element missing from a situation or system.",
    "A state or condition to be achieved or obtained; an ideal or goal to be realized."
  ],
  "design": [
    "The art of creating plans, drawings, or models to show how a building, object, or system should look or work before it is built or created.",
    "A plan or drawing made by an architect, engineer, or designer that shows the appearance, layout, or structure of something before it is constructed or produced.",
    "The process of devising or specifying what an object or system should be like or how it should function.",
    "A particular arrangement of details in something such as a building, piece of furniture, or machine; the way in which it looks or works."
  ],
  "designate": [
    "Choose or appoint someone to a specific position or role.",
    "Indicate or identify something as belonging to a certain category or type.",
    "Point out or select someone or something for a particular purpose or function."
  ],
  "desirable": [
    "Worth having, seeking, or obtaining because it is good, useful, or pleasant; attractive or appealing.",
    "Likely to bring success, profit, or other benefits; advantageous or beneficial.",
    "Pleasing or acceptable to a person, group, or society; socially desirable.",
    "Valuable or useful for a specific purpose or situation; appropriate or fitting.",
    "Regarded as a standard or model for others to follow; exemplary or ideal."
  ],
  "desk": [
    "A piece of furniture with a flat surface and usually drawers, often used for writing, reading, or working on a computer.",
    "An office or position in which one has responsibilities or duties."
  ],
  "desolate": [
    "Completely empty, devoid of people, life, or activity; barren.",
    "Filled with feelings of utter loneliness, solitude, or despair.",
    "To destroy completely or leave in a state of ruin or desolation."
  ],
  "desolated": [
    "Completely devastated, destroyed or ruined; utterly desolate."
  ],
  "desolation": [
    "A state of complete loneliness or desolateness, as if no one had ever been there before.",
    "A place or area that has been destroyed or devastated, leaving it barren and devoid of life.",
    "An intense feeling of sadness, emptiness, or hopelessness."
  ],
  "desolationism": [
    "A concept related to the study of the emotional and psychological effects of experiencing desolate environments, such as barren landscapes or abandoned areas.",
    "The philosophy or practice of embracing a minimalist lifestyle in order to reduce clutter, excess possessions, and unnecessary distractions from one's life."
  ],
  "desperado": [
    "A person who is facing extreme difficulty or danger, often as a result of their own actions or circumstances.",
    "A dangerous or violent outlaw, especially one from the American Wild West.",
    "A person who engages in risky behavior without regard for the consequences."
  ],
  "desperate": [
    "In a state of extreme fear, anxiety, or hopelessness, often indicating that one is in a critical situation without any apparent means of escape.",
    "Extremely anxious or worried; deeply concerned about something.",
    "Showing great urgency or eagerness; desperate for something usually indicates an urgent need or desire for it."
  ],
  "despise": [
    "Hold in contempt; regard with intense dislike or disgust.",
    "Consider as worthless or inferior; undervalue.",
    "Look down upon or scorn.",
    "Treat with disdain or derision.",
    "To have a strong aversion to, be repelled by."
  ],
  "despondency": [
    "A state of deep sadness, despair, or hopelessness.",
    "A feeling of being downhearted or dejected.",
    "A lack of enthusiasm or interest due to disappointment."
  ],
  "despondent": [
    "Feeling extremely discouraged, hopeless, or sad to the point of not wanting to do anything.",
    "A person who is in this state of mind, showing no signs of improvement or recovery from their current emotional state.",
    "A state of deep dejection or depression that can be temporary or prolonged."
  ],
  "despotic": [
    "Characterized by absolute power or unrestricted authority, often involving oppressive and cruel treatment of subjects.",
    "Referring to a government or ruler that exercises absolute and unrestricted power over its citizens or subjects.",
    "Having qualities or characteristics typically associated with a despot, such as arbitrary and unreasonable behavior."
  ],
  "despotism": [
    "A form of government where one person has complete power over the people, making decisions without considering their opinions or interests.",
    "Refers to a system in which an individual holds absolute authority and control, often characterized by oppression and lack of freedom for those under its rule.",
    "(Optional) A situation where someone exercises unrestricted control over others, typically in a harsh or unfair way."
  ],
  "destitute": [
    "Without sufficient resources, such as money or possessions, to meet basic needs like food, shelter, and clothing; lacking means of support or sustenance."
  ],
  "destroy": [
    "To damage or ruin something completely, either by force or by natural causes.",
    "To bring an end to someone's career, reputation, or life, often through malicious intent or aggression.",
    "To cause the complete breakdown or collapse of a system, organization, or plan.",
    "In gaming or competitions, to eliminate, defeat, or prevent a player or team from advancing further."
  ],
  "destroyed": [
    "Completely destroyed, annihilated, or ruined: The storm left entire neighborhoods destroyed.",
    "To bring to an end; to put an end to something, often forcibly or by causing damage: The war destroyed the economy.",
    "To ruin or spoil something, such as a relationship or a reputation: His lies destroyed his credibility.",
    "To obliterate, erase, or eliminate completely: The fire destroyed all evidence of the crime."
  ],
  "desuetude": [
    "The state of being no longer in common use, especially as a result of lapse of time.",
    "The act or process of falling into disuse or abandonment.",
    "A state of neglect or disrepair resulting from lack of use or attention."
  ],
  "desultorily": [
    "In a scattered, disjointed, or aimless manner; lacking a clear direction or organization."
  ],
  "desultory": [
    "Marked by a lack of order, purpose, or coherence; haphazard or aimless.",
    "Characterized by sudden, unpredictable changes in activity, mood, or behavior; erratic or fitful.",
    "Displaying a lack of concentration, persistence, or energy; indifferent or half-hearted."
  ],
  "detachable": [
    "Capable of being removed from a larger unit, either temporarily or permanently; separable.",
    "Able to be taken apart from another object or piece so that they can be used independently; removable."
  ],
  "deteriorate": [
    "To gradually become worse, decline, or decay over time.",
    "For something to degrade, weaken, or lose its quality or value.",
    "To suffer from a decline in health, condition, or appearance.",
    "The worsening of a situation or condition, making it less desirable or favorable."
  ],
  "determinant": [
    "A factor that helps to establish, fix, or make certain something definite or definitive.",
    "In mathematics, specifically in linear algebra, a scalar value associated with an n × n matrix that can be used to determine properties of the matrix, such as its invertibility and rank."
  ],
  "determine": [
    "Decide upon an answer, course of action, or outcome after careful consideration.",
    "Figure out the exact nature, amount, or quality of something through analysis or experimentation.",
    "Establish or assign a specific value, limit, or condition to something.",
    "Find out or establish (a fact, truth, etc.) by inquiry or research.",
    "Identify or designate (an individual) as eligible for a prize, award, or similar honor.",
    "Ascertain the precise location of (someone or something)."
  ],
  "deterrent": [
    "Something that discourages or prevents an action by making the possible consequences unpleasant or undesirable.",
    "A substance, factor, or measure designed to discourage or prevent a certain behavior or action, particularly criminal activity."
  ],
  "dethrone": [
    "Remove someone from a position of power, authority, or honor, especially by defeating them in battle, election, or other contest.",
    "Take away the throne or crown of a king or queen, thus ending their reign.",
    "Cause someone to lose their prestigious status or position, possibly due to scandal or misconduct."
  ],
  "devastate": [
    "To cause widespread destruction, damage, or ruin, typically as a result of war, disaster, or other calamitous event.",
    "To greatly distress, upset, or demoralize someone or something.",
    "In finance, to reduce the value of an investment portfolio by a large percentage."
  ],
  "developed": [
    "Having undergone significant growth, change, or improvement, particularly in terms of economic, technological, social, or cultural development.",
    "In the context of a country, referring to a nation that has reached a certain level of industrialization and modernization, typically with high standards of living and advanced infrastructure.",
    "In the context of real estate or land use, describing an area that has been planned, built on, and made more useful or valuable through development."
  ],
  "deviation": [
    "A departure from a standard, norm, or expected course.",
    "Variation or difference from an established model, rule, or path.",
    "An instance of diverging or straying from the intended direction or course.",
    "In mathematics, a measurement of how far a point or set of points deviates from a given line, curve, or surface."
  ],
  "devilry": [
    "The use of cunning, mischief, or evil in order to cause harm or disruption.",
    "Trickery or deceitful behavior, typically with a humorous intent.",
    "Playful or lighthearted teasing or mocking.",
    "Sinister or malevolent action carried out by someone considered to be the embodiment of evil."
  ],
  "devour": [
    "Consume (food) rapidly and hungrily",
    "Destroy or absorb something completely, typically by using up all its resources",
    "Look at attentively; concentrate on",
    "Cause to be absorbed or destroyed completely",
    "Speak with great rapidity and assiduity"
  ],
  "dexterity": [
    "Skill in using your hands to manipulate objects, particularly in activities such as sewing, writing or playing a musical instrument.",
    "The ability to perform complex and precise movements quickly and with great accuracy, especially in sports or other physical activities.",
    "Nimbleness of fingers or limbs; agility or adroitness."
  ],
  "dexterous": [
    "Skilled in using hands to manipulate objects, especially with agility and grace.",
    "Clever or resourceful in dealing with difficult situations.",
    "Adroit or nimble, especially in handling complex tasks.",
    "Capable of performing intricate movements with ease and precision."
  ],
  "diacritical": [
    "Referring to a small mark added to a letter or symbol, altering its sound or meaning in written language."
  ],
  "diacritics": [
    "Small symbols added to a letter or character, used to alter its pronunciation or to distinguish it from another similar character."
  ],
  "diagnosis": [
    "The identification of a disease, condition, or problem by examining its symptoms, using medical tests, or considering the individual's history.",
    "The formal declaration of the nature and cause of an ailment, reached after a thorough evaluation."
  ],
  "dialect": [
    "A variety of a language, usually characterized by its accent, vocabulary, grammar, and pronunciation patterns that is used in a specific region or by a particular group of people.",
    "A subdivision of a language, which may include differences in syntax, lexicon, phonology, or morphology, typically spoken within a particular geographic area or social group."
  ],
  "dialogue": [
    "A conversation between two or more people, often used to exchange ideas, information or opinions.",
    "The written form of such a conversation in books, plays, movies, etc.",
    "A means of communication and cooperation between different groups, organizations, or countries.",
    "An exchange of information or messages between computer programs or devices."
  ],
  "dialogued": [
    "Engaged in a conversation or discussion with another person, character, or entity.",
    "Communicated or exchanged information, ideas, or views through spoken or written words."
  ],
  "diameter": [
    "The straight line passing through the center of a circle and having its endpoints on the circumference, which defines the width or size of the circle.",
    "(For shapes other than circles) A line segment whose endpoints lie on the boundary of a shape and whose length is equal to the distance between the farthest two points on the boundary."
  ],
  "diametrically": [
    "Opposite in direction, position, or nature; on opposite sides of a circle or other curved figure. For example, diametrically opposed ideas would be completely opposite from one another.",
    "Directly across from something or someone; in the farthest possible place from it. For instance, two people could be standing diametrically across a large room from each other."
  ],
  "diamond": [
    "A hard, transparent mineral composed mainly of carbon atoms arranged in a regular pattern of tetrahedra; used as gemstones and for cutting tools.",
    "A precious stone prized for its brilliance, often used as a symbol of love or status.",
    "A cut and polished diamond, especially when shaped as a round or rectangular tablet.",
    "The traditional December birthstone, signifying love and eternity.",
    "A unit of measurement for the hardness of materials, especially in scratch resistance; diamond is rated at 10 on the Mohs scale.",
    "A symbol of power, wealth, or authority, often used as a metaphor."
  ],
  "diaphanous": [
    "Transparent, light, and thin like a delicate veil or mist.",
    "Having a delicate, sheer appearance that allows light to pass through it."
  ],
  "diarrhea": [
    "A medical condition characterized by frequent, watery, and sometimes urgent bowel movements."
  ],
  "diatomic": [
    "Pertaining to or consisting of atoms that bond with one another to form a molecule, specifically in chemistry where it often refers to elements that can combine to form diatomic molecules such as hydrogen (H2), oxygen (O2), and nitrogen (N2)."
  ],
  "diatribe": [
    "A vehement invective or harangue, especially in writing.",
    "A long angry speech or writing in which someone expresses strong dislike for something.",
    "A detailed analysis or critique of a topic or person, often expressing harsh criticism."
  ],
  "dice": [
    "Small cubes with spots, used to predict an outcome by throwing them.",
    "The plural of the noun \"die,\" which is a small cube with numbers or symbols on each face, used for gambling games and other random determination processes."
  ],
  "dichotomy": [
    "Division into two distinct parts, categories, or opposing sides.",
    "A situation where things can be divided into only two groups or categories.",
    "A contrasting division between two aspects of something."
  ],
  "dictum": [
    "An authoritative statement or a maxim, especially one made by an expert in their field.",
    "A single point or principle within a larger work or body of knowledge.",
    "A decision, judgment, or resolution reached after careful consideration.",
    "A rule or law governing a specific area of activity, particularly within a specialized profession."
  ],
  "didactic": [
    "Characterized by or having the purpose of teaching a moral lesson, especially in literature or art.",
    "Designed to instruct or teach, typically in a formal or systematic way.",
    "Marked by a condescending or patronizing attitude toward others; excessively moralistic or pedantic."
  ],
  "dietary": [
    "Related to the food and drinks that a person consumes, especially when considering their health or nutritional needs.",
    "Referring to a particular type of food or eating habits, such as a vegetarian diet or a low-carbohydrate diet."
  ],
  "difference": [
    "A variation between two or more things, usually in terms of quantity, quality, or nature; a distinction.",
    "The amount by which one thing is greater or lesser than another; a disparity.",
    "A contrast or distinction between similar entities.",
    "The result of the subtraction of one number from another."
  ],
  "diffidence": [
    "A lack of confidence in one's own abilities or self-doubt, often resulting in shyness or timidity in social situations.",
    "Reserved or modest behavior due to a lack of self-assurance or fear of criticism.",
    "An unwillingness to assert oneself or express opinions because of the fear of appearing foolish or making a mistake.",
    "A tendency to be overly cautious or hesitant in decision-making due to uncertainty or self-doubt."
  ],
  "diffident": [
    "Marked by a lack of self-confidence, timid, or shy.",
    "Characterized by modesty or reserve in behavior or speech."
  ],
  "dig": [
    "To excavate or remove soil, rocks, or other materials from a hole or trench in order to uncover something hidden beneath the surface, such as fossils or artifacts.",
    "To obtain information or details about someone or something by asking questions and gathering data.",
    "To play a record repeatedly, as in digging for a favorite song on a vinyl record player.",
    "To dress fashionably or stylishly; to be well-dressed.",
    "Slang: to admire or appreciate someone or something, often used to express enthusiasm for a particular person's talents or appearance."
  ],
  "digit": [
    "A finger or toe, consisting of a series of bones and joints used for grasping, gripping, or standing.",
    "A number or symbol representing a numerical value (such as '5' or 'V').",
    "A unit of measurement in the binary numeral system, represented by either 0 or 1."
  ],
  "digraph": [
    "A pair of letters or characters that represents a single sound, such as \"ch\" in \"chat\" or \"sh\" in \"ship.\"",
    "In computing and cryptography, two consecutive characters that function as a code for another character or data element.",
    "In linguistics, a combination of two letters that represent a distinct unit of sound or meaning in a specific language or writing system."
  ],
  "dilatorily": [
    "Moving or proceeding slowly, hesitantly, or at a leisurely pace.",
    "Delayed or procrastinating in starting or completing tasks.",
    "Gradually widening or enlarging something (especially an opening), often by applying force or pressure."
  ],
  "dilatory": [
    "Tending to delay or prolong action or decision; procrastinating."
  ],
  "dilemma": [
    "A difficult problem, question, or situation, typically involving a choice between unfavorable alternatives.",
    "A predicament or problematic circumstance where all possible solutions are undesirable or involve significant costs and risks."
  ],
  "diligent": [
    "Working hard and showing care in order to achieve a goal or do a task well.",
    "Giving full attention to something, especially because it is difficult or needs careful thought.",
    "Showing determination or perseverance, often over a long period of time."
  ],
  "diminish": [
    "Reduce in size, amount, power, influence, etc.",
    "Lessen or decrease something, such as the intensity of a feeling or the extent of an area.",
    "Cause to be less significant or valuable than before.",
    "Make less important, weaker, or less effective."
  ],
  "diminution": [
    "A decrease, reduction, or lessening in size, quantity, importance, value, power, etc.",
    "A gradual decline or fading away of something over time.",
    "The act of making something smaller or less in amount, importance, or value."
  ],
  "diminutive": [
    "Small in size, stature, or scale.",
    "A term used to describe something that is much smaller than expected, or smaller than other similar things.",
    "A term used to describe a small version of something, often used affectionately.",
    "A term used in linguistics to describe a word that has been reduced in size or formality."
  ],
  "dine": [
    "To have a meal, especially at a table with utensils, often in a social setting.",
    "(In cooking) to prepare or cook food for consumption, typically by using heat.",
    "(Of a person or group) to be provided with or consume food, often in the context of providing hospitality or hosting an event."
  ],
  "direct": [
    "Going or coming without deviation; straight.",
    "In a way that is straightforward, clear, or easy to understand.",
    "Having the power to control, order, or influence someone or something.",
    "Instructing or guiding someone in what to do and how to do it.",
    "Involving no intermediary or middleman; done or carried out directly between parties.",
    "Presented or performed immediately before an audience, without any recording or editing.",
    "Following the shortest or most convenient route; not indirectly."
  ],
  "direction": [
    "The way or path one should go, usually used to indicate geographic locations. For example, \"Head north on Main Street.\"",
    "A course or line of action, as in \"The company is taking a new direction under its new CEO.\"",
    "A field of study or interest, such as \"She has a strong interest in the arts, particularly music and theater, which comprise her career direction.\"",
    "An order or instruction to move toward a particular place or goal, for example, \"The teacher gave us directions to the library.\""
  ],
  "dirt": [
    "A mixture of organic matter, minerals, and water that constitutes soil.",
    "Soil or earth used for gardening or planting.",
    "Mud or muck, especially when dirty or messy.",
    "Waste material, such as rubbish or garbage."
  ],
  "disadvantage": [
    "A situation in which someone is put at a lower position or level compared to others, usually because of something they cannot change or control.",
    "A condition that makes it harder for someone to do something or achieve success.",
    "An unfavorable circumstance or fact that places one at a disadvantage relative to others."
  ],
  "disagreement": [
    "A difference in opinion, belief, or perspective between two or more parties.",
    "An instance of one party opposing or refusing to accept another party's statement, decision, or action.",
    "A lack of consensus or harmony among individuals, groups, or organizations on a particular issue."
  ],
  "disappear": [
    "To cease to be seen, heard, tasted, touched, smelled, or otherwise perceived; to vanish from view or knowledge.",
    "To become invisible or no longer visible to the eye or senses.",
    "To gradually fade away until it is no longer noticeable or present.",
    "To leave a place or area without any trace of having been there.",
    "To end or cease to exist, especially suddenly and unexpectedly."
  ],
  "disappears": [
    "To vanish, become invisible, or no longer be seen or found.",
    "To cease to exist or be present in a certain area, situation or context.",
    "To fade away gradually, either physically or metaphorically."
  ],
  "disapproval": [
    "Unfavorable opinion, criticism, or objection expressed by someone regarding an action, decision, or proposal made by another person or group.",
    "A feeling of disagreement, dissatisfaction, or discontent about something that has been done or proposed."
  ],
  "disarray": [
    "A state of confusion, disorder, or chaos.",
    "Mixed up, disordered condition or arrangement.",
    "To throw into a state of confusion or disorder."
  ],
  "disastrous": [
    "Resulting in or causing great damage, loss, or suffering; catastrophic.",
    "Having a disastrous effect or influence; leading to disaster.",
    "Marked by complete and overwhelming failure; unsuccessful in every way.",
    "Of or relating to a disaster or disasters."
  ],
  "disavow": [
    "Deny one's connection, support, or responsibility for (someone or something); repudiate.",
    "Disown or reject formally; express formal denial of.",
    "Dissociate oneself from an opinion, statement, or action.",
    "Refuse to acknowledge or accept the validity or legitimacy of (something)."
  ],
  "disbursement": [
    "The act of paying out money, especially in the form of a loan or grant from an organization to an individual or for a specific project."
  ],
  "discard": [
    "In card games or similar games, to put aside a card that is no longer needed in the current round.",
    "To remove one's pawn from the board in a game like chess.",
    "In sports, to eliminate a player or team from further competition.",
    "In computing, to delete files, programs or data that are no longer needed."
  ],
  "discern": [
    "Perceive (something) by using one of the senses, especially sight.",
    "Recognize or identify (someone or something) from characteristics or qualities.",
    "Understand (the meaning or significance) of something.",
    "Tell apart or distinguish between different things based on their differences."
  ],
  "discernible": [
    "Distinctly perceptible, visible, or noticeable to the eye, ear, or mind.",
    "Capable of being clearly distinguished or differentiated from something else.",
    "Evident, discernible in character or quality; recognizable.",
    "Capable of being understood or detected by careful observation, analysis, or research."
  ],
  "discernibly": [
    "In a way that can be clearly seen, heard, or detected; noticeably or perceptibly."
  ],
  "discipline": [
    "The practice of training people to obey rules or a code of behavior, as in the armed forces or a school.",
    "A branch of knowledge or a field of study.",
    "The ability to control one's feelings and overcome one's weaknesses; self-control.",
    "A system of principles or rules that guide behavior within a particular activity or subject area, such as science or art.",
    "Training that develops skill and order in specific areas, like sports or music."
  ],
  "discomfit": [
    "Cause someone to feel uncomfortable or uneasy, especially in a situation where they are unable to act confidently or effectively.",
    "Embarrass or humiliate someone, often in front of others.",
    "Disturb the peace or calm of an individual or situation."
  ],
  "discomfited": [
    "Feeling embarrassed, uncomfortable, or put off by something or someone.",
    "Disturbing or unsettling someone's calmness or composure."
  ],
  "discomfiture": [
    "A state of physical or mental distress, unease, or embarrassment.",
    "An uncomfortable situation or experience that causes confusion, anxiety, or self-consciousness.",
    "A feeling of awkwardness or discomfort in a specific social or personal context."
  ],
  "discomfort": [
    "A feeling of unease, inconvenience, or physical pain.",
    "An awkward situation that causes embarrassment or distress.",
    "A state of being unable to feel at ease in a particular environment or situation.",
    "Something that interferes with one's ability to relax or be comfortable."
  ],
  "disconcert": [
    "Disturb one's composure, self-confidence, or concentration, often by surprising them with an unexpected situation or development.",
    "Cause confusion or uncertainty in a person, organization, or system.",
    "Unsettle someone emotionally, intellectually, or mentally.",
    "Throw into disorder or confusion; disarrange."
  ],
  "disconcerted": [
    "Feeling disturbed, confused, or unsettled, especially as a result of an unexpected or unanticipated event.",
    "Causing someone to become disoriented or perplexed, often due to a change in plans or expectations.",
    "Interrupting or disrupting the usual flow or routine of something, leading to confusion or disorder."
  ],
  "disconcerting": [
    "Causing confusion, perplexity, or disorientation; unsettling.",
    "Upsetting or troubling one's composure; discomfiting."
  ],
  "discontent": [
    "Unhappy, unsatisfied, or dissatisfied with one's current situation or circumstances.",
    "A feeling of being displeased, frustrated, or annoyed due to unfulfilled desires, expectations, or needs.",
    "A state of restlessness or unease caused by the lack of contentment or satisfaction in life."
  ],
  "discontinuance": [
    "The act of ending something, such as a service or policy, that was previously provided or in effect.",
    "A break or interruption in the continuity of something, such as a process or series.",
    "The termination of an agreement or contract between two parties."
  ],
  "discontinue": [
    "To stop doing something, such as a routine activity or providing a service.",
    "To cease producing or supplying something, such as a product or information.",
    "To end a relationship or connection with someone, either by choice or circumstance.",
    "To halt the progress of a project or plan."
  ],
  "discontinuity": [
    "A break, gap, or interruption in something continuous, such as a line, sequence, or function.",
    "In mathematics, an abrupt change in the value or behavior of a function or its derivative.",
    "In physics, a sudden change in a physical property, such as temperature or pressure, across a boundary.",
    "A break in the continuity of a geological formation, such as a fault or unconformity.",
    "An interruption or gap in the regular occurrence of an event or phenomenon, such as a natural disaster or political event."
  ],
  "discord": [
    "Conflict, disagreement, or disharmony between people or groups.",
    "A state of dispute, quarrel, or disunion.",
    "Noise, discordant sound, or harshness in music."
  ],
  "discordant": [
    "Not harmonious, in agreement, or consistent; contradictory, inconsistent, or conflicting."
  ],
  "discountenance": [
    "To disapprove, discourage, or express displeasure towards something or someone.",
    "To withhold one's support, approval, or sanction from a person or action.",
    "To refuse to give credit or recognition to an individual or their accomplishments."
  ],
  "discourage": [
    "To make someone feel less eager to do something by showing that it is not a good idea, or by making them feel unconfident.",
    "To prevent (someone) from doing something by making them believe that it will be difficult, unprofitable, or unwise."
  ],
  "discovery": [
    "The act or process of finding out or learning something new; a new fact, idea, or truth that is found.",
    "A significant event or happening that leads to new knowledge, understanding, or development.",
    "An object, place, or substance that has been newly discovered and is considered important or valuable.",
    "The identification of a previously unknown aspect of something, often leading to advancements in science, technology, or other fields."
  ],
  "discreet": [
    "Careful and considerate in speech and actions, showing good judgment and tact in dealing with others.",
    "Acting or able to act without being noticed or drawing attention; stealthy or unobtrusive.",
    "Not flashy, showy, or extravagant in appearance or behavior."
  ],
  "discrepancy": [
    "A difference, inconsistency, or contradiction between two pieces of information, statements, or facts.",
    "An inconsistency or variation in the results obtained from two different measurements or calculations.",
    "A difference between what was expected and what actually occurred or is recorded."
  ],
  "discrepant": [
    "Different or contradictory from one another; inconsistent or conflicting.",
    "Not in agreement or harmony; discordant or uncongruous."
  ],
  "discretion": [
    "The power or ability to make decisions or judgments, especially when faced with more than one option.",
    "A situation in which a person has the authority to decide what action should be taken.",
    "The act of using this power or authority to choose an action or course of action.",
    "The quality of being careful or sensible in making choices or decisions."
  ],
  "discuss": [
    "To talk about something in detail, often to share opinions or ideas, or to make decisions. For example, \"Let's discuss our weekend plans.\"",
    "(In writing) To present a topic for consideration by examining it from different angles, usually with the purpose of persuading readers. For instance, \"The author discusses the importance of recycling in her essay.\""
  ],
  "discussion": [
    "An informal talk in which people exchange ideas, views, or information on a particular subject.",
    "A written or spoken argument in which two or more people express their different opinions about something.",
    "A meeting where people have a debate on an issue and try to reach a decision by discussing it.",
    "A conversation or exchange of thoughts and ideas between two people."
  ],
  "disdain": [
    "A feeling of contempt or scorn for someone or something that is considered unworthy, inferior, or undeserving of respect or attention.",
    "The act of showing or expressing contempt or disapproval towards someone or something.",
    "To regard something as unimportant or unworthy of consideration; to dismiss or reject it out of hand.",
    "A deliberate and haughty rejection of what is commonly considered to be good, valuable, or important."
  ],
  "disdainful": [
    "Expressing, characterized by, or marked by disdain; contemptuously aloof or haughty in attitude or behavior; showing a scornful disregard for something or someone."
  ],
  "disembark": [
    "To leave a vehicle, such as a ship, boat, train, or aircraft, by getting off of it.",
    "To remove something from a vehicle or container, especially in large quantities."
  ],
  "disembodied": [
    "Separated from a body; existing in spirit form only.",
    "Not embodied or represented in any physical form.",
    "(Of a voice) Unaccompanied by its speaker, as in a disembodied message."
  ],
  "disenchant": [
    "Remove someone's enchantment, charm, or captivation.",
    "Deprive of illusion or idealism; make disillusioned.",
    "Make less enthusiastic about something that was previously appealing.",
    "Take away the magic or spell from a situation or relationship."
  ],
  "disenchanted": [
    "No longer enchanted, charmed, or beguiled; jaded or skeptical as a result of a previous belief, hope, or experience.",
    "Losing one's magical powers or ability to bewitch or captivate.",
    "(In linguistics) The reduction of the number of inflected forms in a language over time, leading to simpler grammar and less variation between words."
  ],
  "disgraceful": [
    "Bringing shame or dishonor upon oneself or others; highly embarrassing, degrading, or shameful.",
    "Unbecoming of a person in their position or role; an act that reflects poorly on the individual or organization involved.",
    "Actions or behavior that are below expected standards or norms; unacceptable and deserving of censure or condemnation."
  ],
  "disgruntle": [
    "Cause someone to become discontent, annoyed, or unhappy with a situation or person.",
    "Make someone feel dissatisfied, irritated, or displeased.",
    "Induce feelings of resentment or bitterness in an individual."
  ],
  "dishabille": [
    "Disheveled state or appearance, typically referring to a person's unkempt hair, clothing, or both."
  ],
  "disheveled": [
    "Unkempt or untidy, especially with hair or clothes appearing messy and disordered."
  ],
  "disingenuous": [
    "Not honest or sincere in expression or motive; insincere or dishonest, especially in order to gain an advantage."
  ],
  "disingenuousness": [
    "The quality of being insincere, dishonest or not fully open in expression or statement; hypocrisy.",
    "A lack of sincerity or honesty in speech or actions, often with the aim of deception.",
    "An unwillingness to face the facts and a tendency to misrepresent one's own beliefs or intentions."
  ],
  "disintegrate": [
    "To fall apart into smaller parts, break down or come undone.",
    "For materials to crumble, decay, or deteriorate over time.",
    "In nuclear physics, for an atom to undergo radioactive decay and emit particles."
  ],
  "disk": [
    "A flat circular object, often used in various contexts such as computer storage, optical media, and a part of many machines like a bicycle or car.",
    "(Informal) In the context of computer hardware, it refers to an electronic device used for data storage, like a hard disk drive or floppy disk.",
    "(Informal) In the context of optical media, it refers to a data storage medium that can be read by a computer using a laser. Examples include CDs and DVDs.",
    "A flat round object made from various materials such as glass, plastic, metal, etc., which may have different purposes like decorative items or tools.",
    "In the context of astronomy, it refers to a disk-shaped galaxy or planetary system that appears flat when viewed from the side."
  ],
  "dislike": [
    "Feeling a strong disinclination, opposition, or aversion towards something or someone.",
    "To not have a favorable opinion or sentiment about something or someone; to hold an unfavorable view or attitude.",
    "Not to enjoy, appreciate, or approve of something or someone."
  ],
  "dismantle": [
    "Take apart or remove parts from something, especially in order to reuse or study them.",
    "Demolish or destroy a structure by taking it apart piece by piece.",
    "Remove the components of a complex system in order to understand how they work individually.",
    "Disassemble a machine, weapon, or other device to examine its inner workings or for repair purposes."
  ],
  "dismantled": [
    "To take apart or to break down (something) into its individual parts, especially for the purpose of repair, reuse, or disposal.",
    "To defeat or destroy a military force or an organization by attacking and capturing its components one by one.",
    "To break down or analyze (a complex idea or situation) into its component parts in order to understand it more easily."
  ],
  "dismissal": [
    "The action of ending someone's employment, usually due to misconduct or poor performance. For example, \"He was dismissed from his job after stealing company property.\"",
    "Removing a person or thing from consideration or attention. For instance, \"The teacher dismissed the student's argument as irrelevant.\"",
    "The act of ending a meeting, event, or gathering before its scheduled time. An example would be, \"The conference was brought to an early dismissal due to bad weather.\""
  ],
  "disorient": [
    "To cause someone to lose their sense of direction, bearings, or orientation, often through sudden or unexpected changes.",
    "To confuse, bewilder, or perplex someone, causing them to become disoriented mentally or emotionally."
  ],
  "disparage": [
    "To belittle, criticize, or put down someone or something by making negative remarks about their abilities, character, or achievements.",
    "To express contempt, scorn, or a lack of respect for something or someone.",
    "To reduce the value, esteem, or worth of an individual or thing through disparaging comments or actions."
  ],
  "disparaged": [
    "To speak of in a way that belittles, demeans, or criticizes unjustly; to put down or make light of someone or something.",
    "To express an unfavorable opinion about; to denigrate or vilify; to express contempt for.",
    "To treat with scant respect or attention; to disregard or slight in a deprecatory manner."
  ],
  "disparaging": [
    "Expressing contempt, scorn, or criticism; belittling, demeaning, or insulting in nature; tending to lessen the worth, importance, or value of something or someone."
  ],
  "disparate": [
    "Different or distinct in nature, character, or quality; not resembling one another in any significant way.",
    "Not coherent or consistent with one another; conflicting or inconsistent.",
    "Not related or connected by any common factor or theme."
  ],
  "disparity": [
    "A noticeable difference, contrast, or variation between things or people.",
    "An inequality in opportunities, resources, or treatment among different groups of people.",
    "A significant difference in size, amount, quality, etc., between two or more related things."
  ],
  "dispatch": [
    "Send (someone) quickly to a place or event, typically as a messenger or representative.",
    "Deal with or settle (a problem or matter) promptly and effectively.",
    "Transmit (information, such as news reports) to a newspaper or broadcasting organization for immediate publication or broadcast.",
    "Arrange the transportation of goods or materials from one place to another."
  ],
  "dispatched": [
    "Sent away on a particular mission, task, or journey.",
    "Transmitted, sent out or forwarded, especially in a formal or official context.",
    "Distributed, delivered, or spread throughout a particular area.",
    "In the context of mail, to be physically sent from one place to another."
  ],
  "dispel": [
    "Scatter or drive away (something, such as darkness or fear) to make it no longer there or have an effect on someone or something.",
    "Make something no longer believed or talked about by showing that it is not true or important.",
    "Remove the confusion or uncertainty from someone's mind by giving them clear information."
  ],
  "dispense": [
    "Provide or supply something, typically following a prescription or request.",
    "Distribute or administer something, such as medicine or justice, according to a specific rule or principle.",
    "Give out something in small quantities, often from a dispenser or container.",
    "Release or let go of something, especially after holding it back.",
    "(Of a pharmacist) prepare and give medicines or drugs to patients as prescribed by a doctor."
  ],
  "dispersed": [
    "Scattered or distributed in different directions or locations.",
    "To cause something to be scattered or distributed in different directions or locations.",
    "To break up or dissolve a group into separate parts, often as a result of a force or action.",
    "To distribute the members of a group over an area so that they are evenly spaced or spread out."
  ],
  "displacement": [
    "The act of moving something from one place to another.",
    "The distance something is moved, usually measured as a product of its change in length and direction.",
    "In physics, the change in position of an object over time, which forms the basis for calculating momentum.",
    "In electronics, the shifting of electrical current from one component to another within a circuit.",
    "The use of an equivalent term or phrase to replace a problematic word or phrase."
  ],
  "display": [
    "Present visually, as on a screen or surface: \"He displayed his artwork at the gallery.\"",
    "Show (information) on a screen or other visual device: \"The smartphone displays time and date.\"",
    "Exhibit or reveal something openly: \"She displayed her emotions for all to see.\"",
    "Present (something, such as goods or merchandise) in an attractive arrangement: \"The store displayed its new clothing line in the window.\"",
    "Represent (something abstract) by means of a concrete example: \"The teacher displayed the concept of multiplication with a series of calculations.\""
  ],
  "disposition": [
    "The way someone usually behaves, thinks or feels towards something or someone.",
    "The arrangement of objects in a certain way or order.",
    "The act of disposing or giving away property after death, as stated in one's will.",
    "In law, the act of dividing an estate among heirs or legatees after the death of its owner."
  ],
  "disprove": [
    "To demonstrate that something is not true or valid, often by providing evidence to refute it.",
    "To show the inaccuracy or falsity of an idea, statement, or belief.",
    "To provide sufficient reasons or facts to negate the truthfulness or correctness of a claim or argument."
  ],
  "disputation": [
    "A formal discussion, often involving debate, in which people present and defend their opinions on a particular subject.",
    "A disagreement or argument between two parties, often involving differing beliefs or interpretations of facts."
  ],
  "disquiet": [
    "Unease, anxiety, or worry caused by something uncertain, unsettling, or disturbing.",
    "A state of being troubled, agitated, or disturbed emotionally or mentally.",
    "A feeling of restlessness, nervousness, or discomfort that may be difficult to explain or define."
  ],
  "disregard": [
    "To ignore, pay no attention to, or not take into account.",
    "To treat as if it did not exist or was unimportant.",
    "To refuse to consider or recognize something or someone.",
    "Not to be influenced by; act without considering."
  ],
  "disrepair": [
    "A state of dilapidation, deterioration, or damage where something is falling apart or not in good condition.",
    "The process by which a building or structure falls into disrepair due to lack of maintenance, neglect, or age.",
    "A situation where something is broken, worn out, or damaged and requires repair or replacement.",
    "An unfavorable state of an object that results from the failure to keep it in good condition over time."
  ],
  "disreputable": [
    "Not respectable; untrustworthy, dishonest, or unprincipled.",
    "Of poor or questionable reputation; disgraceful or infamous.",
    "Not worthy of public approval or support; discreditable."
  ],
  "disrepute": [
    "Loss of reputation, honor, or esteem; dishonor.",
    "A state of being regarded with contempt, scorn, or disrespect.",
    "The condition of being discredited or brought into ill repute."
  ],
  "dissect": [
    "Separate something into its component parts in order to study them carefully, especially by cutting it open.",
    "Analyze or examine (something) in great detail, typically by dividing it into its constituent parts.",
    "To break down (a complex subject or idea) into simpler components for the purpose of understanding it better."
  ],
  "dissecting": [
    "Separating something into its constituent parts in order to study it, especially by cutting open a biological specimen or using a microscope to examine its structure.",
    "To analyze something in detail, typically breaking it down into its component parts for thorough examination.",
    "In computing, the process of dividing a program into smaller parts or modules for easier debugging and maintenance."
  ],
  "dissection": [
    "The act or process of cutting something apart into its component parts to study it, often in a biological or anatomical context.",
    "A written analysis or critical examination of a subject, especially literature, music, or art, where different elements are separated and examined individually."
  ],
  "dissemble": [
    "To hide one's true feelings, motives, or intentions by giving a misleading appearance or statement.",
    "To deceive or mislead someone by concealing the truth or making false claims.",
    "To give a false appearance of something, typically in order to deceive or mislead others."
  ],
  "dissembling": [
    "Acting in a deceptive or misleading manner, often by hiding one's true feelings or intentions.",
    "Giving an impression that is intentionally false or misleading.",
    "Engaging in deceitful or insincere behavior."
  ],
  "dissension": [
    "Disagreement or disagreements among individuals, groups, or nations; discord or conflict.",
    "Opposition to an idea, proposal, policy, etc., expressed through argument or protest.",
    "A state of being divided or at odds with one another, often resulting in conflict or unrest."
  ],
  "dissentient": [
    "Not in agreement; discordant.",
    "Disagreeing with an official decision, judgment, or opinion."
  ],
  "dissever": [
    "To separate or distinguish something from other related things; to disentangle or differentiate.",
    "To deny responsibility for (an action) by stating that one is not connected to it in any way.",
    "In law, to set aside or annul a legal instrument or contract due to some defect or irregularity."
  ],
  "dissimilar": [
    "Not alike; different; unlike in form, nature, or character.",
    "Showing differences or contrasts; varied.",
    "Marked by difference in opinion, belief, or purpose.",
    "Diverse or distinct; not belonging to the same group or category."
  ],
  "dissimulate": [
    "Conceal or disguise one's true feelings, thoughts, or intentions by pretending to feel or believe something else."
  ],
  "dissipate": [
    "To spread out, disperse, or scatter something over an area.",
    "To cause or allow something to become weaker by using it up or wasting it.",
    "To make something disappear or vanish by spreading it away or using it up.",
    "To prevent something from building up or growing by using it up or dispersing it."
  ],
  "dissipation": [
    "The act of dispersing, scattering, or spreading something out.",
    "A gradual wasting away, typically due to reckless or excessive indulgence in pleasures or vices.",
    "The scattering or disappearance of energy or heat over a wide area.",
    "The dispersal of an atmosphere or gas through physical processes such as diffusion or wind."
  ],
  "dissociate": [
    "Separate (something) into its components or elements, especially to analyze or study them individually.",
    "Disconnect or withdraw oneself emotionally or mentally from a situation, person, or group of people.",
    "Cause or experience a disconnection between thoughts, memories, or aspects of one's identity, often as a coping mechanism for trauma or stress."
  ],
  "dissolved": [
    "Liquid or substance breaks apart and no longer holds together in its original form.",
    "An organization, such as a government or corporation, is officially disbanded or ceases to exist.",
    "A solution results from combining two or more substances, often resulting in one dissolving into the other.",
    "A formal agreement or treaty between nations comes to an end or is officially canceled.",
    "The members of a group or organization separate and go their own ways, leaving no unified body behind."
  ],
  "dissonance": [
    "A harsh, unpleasant sound produced by the simultaneous sounds of two different pitches that do not harmonize well together, often experienced in music or singing.",
    "A situation where there is disagreement, conflict, or disharmony between people, ideas, or things."
  ],
  "dissonant": [
    "Characterized by harsh, uncongenial, or displeasing harmony of sounds; not harmonious; out of tune.",
    "Figurative: Incompatible, discordant, or conflicting in ideas or opinions.",
    "Music: A combination of musical notes that produce an unpleasant or harsh sound when heard together."
  ],
  "dissuasion": [
    "The act of persuading someone not to do something, often by using reasons or arguments.",
    "A method or means used to discourage a certain action or behavior.",
    "A warning given to deter someone from engaging in an undesirable activity."
  ],
  "dissuasive": [
    "Serving to deter, discourage, or prevent something from happening; having a deterring effect.",
    "Making it difficult or unattractive for someone to do something, especially by showing the drawbacks or disadvantages."
  ],
  "distaff": [
    "Relating to women or domestic affairs.",
    "The side of a subject that is not related to men or politics.",
    "In ancient times, the term referred to the tool used by women for spinning thread from wool.",
    "Figuratively, the distaff side refers to one's family lineage, especially when discussing royalty or nobility.",
    "In computer science, a distaff CPU refers to a computer processor designed specifically for use in handheld or portable devices."
  ],
  "distance": [
    "The space or interval between two points, objects, or individuals; a measure of how far apart they are.",
    "The degree of separation in opinion, emotion, or other qualities between people or things.",
    "A unit of measurement used to express the extent of a particular characteristic or quality.",
    "In geometry, the extent of the straight line between two points on a plane or surface.",
    "The length of time that elapses between two events or situations, especially when they are considered in relation to each other.",
    "A measure of how far apart objects or people are located in cyberspace, such as on the internet or within a computer network."
  ],
  "distemper": [
    "A disease that affects animals, often causing fever, inflammation, and other symptoms.",
    "A temperamental or unstable mood.",
    "A type of paint with a rough texture used for walls and ceilings.",
    "A state of mental disarray or confusion.",
    "An old term for a kind of malaria caused by a parasite transmitted by mosquitoes."
  ],
  "distensions": [
    "The act of stretching, extending, or expanding something.",
    "An increase in size, scope, or extent; expansion.",
    "A swelling or enlargement of a body part due to fluid buildup."
  ],
  "distention": [
    "The act of stretching or expanding something, such as a muscle or an organ, beyond its normal size or shape.",
    "A visible swelling or enlargement of a body part, often caused by gas, fluid, or other substances accumulating within it."
  ],
  "distinction": [
    "A difference, usually in quality, between similar things.",
    "A particular quality or feature that makes something special or different from others.",
    "An honor, title, or award given to someone for their achievements or abilities.",
    "Recognition of the superiority of one thing over another in a specific area."
  ],
  "distinguishable": [
    "Visible or audible enough to be told apart from others, especially when similar things are close together or happening at the same time.",
    "Able to be recognized as different from something else because of clear differences in appearance, sound, or other qualities."
  ],
  "distinguished": [
    "Known for being exceptional or remarkable in a particular field, often recognized for achievements or expertise.",
    "Recognized as important, notable, or influential, often due to significant accomplishments or contributions.",
    "Standing out or being easily recognizable from others because of unique qualities or traits."
  ],
  "distorted": [
    "Altered from an original or proper form, shape, or appearance; deformed or misshapen.",
    "Misrepresented or distorted in meaning, usually for a specific purpose.",
    "Disrupted or damaged so that the original pattern, sound, or message is changed or scrambled."
  ],
  "distraction": [
    "A thing that attracts someone's interest and diverts them from something else they should be doing. For instance, one might be distracted by a mobile phone while trying to study.",
    "In mental health contexts, distraction can refer to techniques used in therapy to help patients focus on other thoughts or activities so as to cope with anxiety or intrusive thoughts.",
    "It could also refer to an event or situation that draws people's attention away from their primary objective. An example would be a political crisis distracting the government from its economic agenda."
  ],
  "distributed": [
    "Spread out over a wide area, space, or time.",
    "Given or shared among individuals or groups separately.",
    "Computing: Dealing with data or tasks divided into smaller parts and processed on different computers in a network simultaneously."
  ],
  "disturb": [
    "Cause someone to be upset, worried, or anxious by their behavior or words.",
    "To interrupt the usual routine of a person or thing.",
    "To cause a break in peace or quiet.",
    "To interfere with something, often in an unwelcome manner.",
    "(Physics) To disrupt the equilibrium of a system."
  ],
  "ditch": [
    "An artificially made water-filled depression in the ground, typically used to collect water from rain or for irrigation.",
    "A narrow, shallow trench or channel dug into the ground, often used for drainage or as a boundary.",
    "To dig or create a ditch; to excavate a trench.",
    "A long, narrow depression in the earth's surface, especially one formed by erosion or the flow of water."
  ],
  "dither": [
    "To vacillate or hesitate between two options, unable to make a decision.",
    "In computing, a visual artifact caused by insufficient color depth or resolution that results in pixelated or blurred images.",
    "In music and sound engineering, an unwanted noise or fluctuation in audio signals caused by rapid changes in amplitude or frequency."
  ],
  "dithering": [
    "The act of hesitating, unable to make a decision or take action due to uncertainty, fear, or lack of information.",
    "A state of constant indecision or fluctuation, as in opinions or beliefs.",
    "In digital signal processing, the variation of color or brightness that occurs when an image is compressed and then decompressed, resulting in a loss of quality."
  ],
  "diurnal": [
    "Occurring, active, or living during the daytime rather than at night; daily cycle related to the sun's position.",
    "A type of astronomical observation made during the day, as opposed to nocturnal observations done at night.",
    "A creature that is active during the day and sleeps at night; a day-dwelling or daytime animal."
  ],
  "divergent": [
    "Diverging, branching off in different directions; going separate ways.",
    "Moving away from a common point or origin; spreading outward.",
    "Showing differences or departures in direction, opinion, or approach.",
    "In mathematics, a sequence of numbers or function that does not converge but instead increases unboundedly or oscillates without bound."
  ],
  "diverse": [
    "Various; not all alike, different in nature, form, or quality; ranging through a variety of types, forms, or ideas.",
    "A mixture of people, things, or elements coming from many different backgrounds or having various qualities.",
    "Comprising or characterized by a varied range of elements, components, or aspects."
  ],
  "diversity": [
    "Different types or varieties within a group, population or system.",
    "A range of features, perspectives or backgrounds that people bring to an environment or situation.",
    "The presence or representation of several different characteristics (such as race, gender, religion) in a community or organization."
  ],
  "divination": [
    "The practice of seeking knowledge or guidance from supernatural forces, often through rituals or interpreting symbols.",
    "The act of foreseeing future events or discovering hidden knowledge by supernatural means, such as dreams, prophecies, or communication with spirits."
  ],
  "divisor": [
    "A number that can evenly divide into another number without leaving a remainder when divided, producing a quotient and a remainder of zero. For example, 4 is a divisor of 12 because 12 / 4 = 3 (quotient) with no remainder.",
    "In the context of fractions, a divisor refers to the number being divided by in order to create the fraction. For instance, in 1/2, \"2\" is the divisor.",
    "In algebra, divisors are terms or expressions that are being divided in an equation. For example, in x/y = 4, 'x' and 'y' are divisors."
  ],
  "dizzier": [
    "Feeling or appearing to be unsteady, lightheaded, or giddy; experiencing a spinning sensation in one's head.",
    "More disoriented, unbalanced, or unstable than someone or something else.",
    "Experiencing a more intense sense of vertigo or whirling motion than before."
  ],
  "dizziness": [
    "A feeling of lightheadedness, unsteadiness, or giddiness, often accompanied by a spinning sensation in one's head.",
    "A sensation of disorientation that can result from standing up too quickly, low blood sugar levels, or inner ear problems."
  ],
  "dizzying": [
    "Causing a sensation of giddiness or whirling, often due to a sudden change in position or spinning around.",
    "Impressive or overwhelming in scale or number; awe-inspiring.",
    "Causing confusion or disorientation by the speed or complexity of developments or changes."
  ],
  "do": [
    "Perform (an action, task, or operation)",
    "Make or create (something) by doing something to raw materials, one's own body, etc.",
    "Sing (a song, piece of music, etc.) as an actor does in a theatrical performance",
    "To leave and return: used especially of a boat or ship",
    "To cover or enclose by folding (a garment, parcel, etc.)",
    "Informal term for do it yourself: doing tasks without professional assistance"
  ],
  "docile": [
    "Obedient and easily controlled; willing to follow orders or directions without resistance.",
    "Mild-mannered or gentle in temperament, not likely to be assertive or aggressive.",
    "Easily taught or trained, responsive to instruction or guidance."
  ],
  "doctor": [
    "A person who has studied and holds a degree in a particular subject, allowing them to provide expert advice or teach others about that subject.",
    "A person who practices medicine as a profession, having completed a course of study at an accredited medical school and passed state licensing exams."
  ],
  "dodge": [
    "To avoid or evade something, especially by quick movement or skillful maneuvering; to dart or weave to avoid being hit or caught.",
    "To slip away or escape from a difficult or unpleasant situation by finding a way out or making an excuse.",
    "To make something smaller or less noticeable by reducing its size, removing parts, or altering its appearance.",
    "In sports, especially baseball, to swing at a pitched ball with the intention of hitting it, but using poor technique that often results in a foul ball."
  ],
  "does": [
    "Third person singular form of the verb \"to do\" (to perform an action, accomplish something). For example: \"She does her homework every night.\" or \"The cat does not like water.\"",
    "In a question, used to request information or ask for confirmation from another person. For example: \"Does this bus go to the city center?\" or \"Does John have a car?\""
  ],
  "dog": [
    "A domesticated carnivorous mammal, Canis lupus familiaris, that typically has a thick coat of fur, pointed or floppy ears, and a long snout with a black nose.",
    "A male person who behaves in a cowardly or unattractive manner; a weakling.",
    "An informal term for an easy task or job; a piece of work that is not difficult.",
    "A slang term for a motorcycle, especially a powerful one."
  ],
  "dogma": [
    "A principle or set of principles that is regarded as authoritative and not open to question or doubt.",
    "An opinion or doctrine held to be true without any reasonable ground except its general acceptance.",
    "A belief or set of beliefs that is taught by an authority or religion, often accepted uncritically."
  ],
  "dogmatic": [
    "Adhering to a set of beliefs or doctrines without questioning, open to new ideas or evidence.",
    "Emphasizing strict adherence to traditional principles and doctrines, often expressed in a rigid manner."
  ],
  "domesticity": [
    "The quality or state of being organized, orderly, and maintained within a home.",
    "Activities related to maintaining a household, such as cleaning, cooking, and taking care of family members.",
    "Characteristics or behavior associated with being a good housekeeper or homemaker.",
    "The condition of living in a stable, comfortable, and harmonious home environment."
  ],
  "domicile": [
    "The place where someone legally lives and has their permanent home, regardless of temporary absences.",
    "A person's fixed legal residence, even if they do not reside there currently.",
    "A place designated as a person's official residence for legal or tax purposes."
  ],
  "dominance": [
    "Preeminence, superiority, or control in a specific area or context, often resulting from strength, skill, power, or authority.",
    "The ability of an individual or group to exert influence over others, gaining compliance and submission through force, charm, or intelligence.",
    "In biology, the relationship between two species where one consistently outcompetes the other for resources, leading to a change in population numbers or distribution."
  ],
  "dominant": [
    "Being in a position of authority, control, or power over others.",
    "Being more prominent or significant than something else in a particular context.",
    "Prevalent or predominant in a specific situation or field.",
    "(Biology) Refers to the form of a gene that is expressed and masks the expression of another gene.",
    "(Genetics) Describes a character or trait that is most frequently exhibited by individuals within a population."
  ],
  "domination": [
    "The act or process of exercising authority, power, or control over something or someone.",
    "Preeminence in a particular field or activity, as demonstrated by exceptional skill or achievement.",
    "The practice of imposing one's will or ideas on others through force or coercion.",
    "Control or influence exerted by one group or individual over another in a social context."
  ],
  "done": [
    "Completed or finished a task or activity; no more work is required.",
    "Perfected or accomplished to the fullest extent possible, especially in artistic or creative endeavors.",
    "Done with something means that one has had enough or no longer wants to participate.",
    "In the past tense of the verb \"do,\" it signifies an action completed or a state achieved.",
    "Done for refers to something that has come to an end, often due to exhaustion or depletion of resources.",
    "Done in refers to completing an activity within specified limits, such as time or space constraints."
  ],
  "door": [
    "A moveable barrier, usually hinged, that can be opened or closed to permit entry or exit from a room, building, vehicle, etc.",
    "The entrance or exit of a place.",
    "A metaphorical opening or opportunity."
  ],
  "dormant": [
    "Not active, functioning, or growing; in a state of rest or inactivity.",
    "Asleep or inactive in a way that is normal for the species (e.g., hibernating animals).",
    "In law, a corporation that has not conducted business for a certain period and has not been dissolved.",
    "In medicine, referring to a part of the body that is temporarily inactive due to illness or injury."
  ],
  "dormitory": [
    "A building where people, especially students, live and sleep while attending a school or college."
  ],
  "dot": [
    "A small round spot or speck of color, typically used in drawings or paintings to represent an object or detail.",
    "A punctuation mark (.) indicating a pause or separation between sentences or words.",
    "To place a dot or dots on something, as in marking something off a list or map.",
    "In mathematics, a point with coordinates that represents the intersection of two or more axes on a graph.",
    "A single element within a digital display, especially in a pixel-based technology like computer screens or digital watches."
  ],
  "dote": [
    "To give a lot of attention or care to someone, often excessively or obsessively.",
    "(Obsolete) To observe or watch attentively; to attend to; to take care of."
  ],
  "doublet": [
    "A close-fitting jacket, often made of two layers sewn together with a lining or a contrasting fabric on the outside and worn as an outer garment during the Middle Ages and the Renaissance era.",
    "A double layer garment, usually consisting of two pieces of fabric sewn together with a lining or contrasting exterior, worn by both men and women in past centuries for warmth and style."
  ],
  "down": [
    "In a lower position; toward a lower place or level. For example, \"The balloon went down with a loud noise.\"",
    "Used to indicate that something is no longer in operation or use. For instance, \"They put the computer down for repairs.\"",
    "Describing something that has been lowered or reduced. Such as, \"The price of the shoes was down by 10%.\"",
    "A lightweight cloth filling often made from the fluffy outer layers of certain ducks and geese, used to insulate clothing and bedding. For example, \"I sleep under a comforter filled with down.\"",
    "Describing a feathered bird that is prized for its soft downy under-plumage, such as a duck or goose. For instance, \"The store sells down pillows made from real down.\"",
    "A slang term used to describe feeling sad, blue, or depressed. As in, \"I'm feeling down today.\""
  ],
  "downpour": [
    "A heavy fall of rain from a short, intense storm.",
    "A sudden, heavy shower or falling of something.",
    "A great amount or number of something coming at once.",
    "A large number of people arriving at an event or place all at the same time."
  ],
  "dozen": [
    "A group of twelve items, often used to describe a quantity.",
    "In cards, a set of thirteen cards, representing a complete cycle through all four suits or a round of play.",
    "In basketball, a term used to describe the act of scoring ten points in one possession, typically by making two free throws and then getting a rebound of the second missed free throw and making another basket before the defense can get possession, resulting in a total of 12 points for that possession."
  ],
  "drachma": [
    "A unit of weight used in ancient Greece, equivalent to approximately six ounces.",
    "The former currency of Greece, replaced by the Euro in 2002."
  ],
  "draconian": [
    "Excessively harsh, severe, or strict in nature.",
    "Characterized by extreme measures or laws.",
    "Originating from Draco, a Greek lawmaker known for his strict and cruel laws."
  ],
  "dramatic": [
    "Relating to or characterized by a high degree of emotional intensity, conflict, or suspense; often used to describe situations, events, or performances that evoke strong emotions in the audience or participants.",
    "Concerning or involving the portrayal of characters and situations on stage, screen, or other mediums through speech, movement, and other physical expressions.",
    "Of or pertaining to the field of drama or theatrical arts."
  ],
  "draw": [
    "To pull something towards oneself, typically by using force applied to a rope, string or similar object attached to it.",
    "To create a representation of something with lines, shapes, or colors on a surface, such as paper or canvas, often in the context of visual arts.",
    "To take money from an account, typically as part of regular payments or salary.",
    "To make a plan or conclusion based on information available, even if it's not perfect.",
    "In sports and games, to select teams, participants or sides by chance, often using cards or lots; or to tie in score in a competition.",
    "To represent a symbol, figure, or picture through lines or shapes.",
    "To cause a line or border to extend around something, like text or an image.",
    "In drawing, the act of making lines, shapes, or forms on a surface."
  ],
  "drawing": [
    "A representation made on a surface by means of lines, colors, shapes, etc., typically using pencil, charcoal, or paint.",
    "The action or process of pulling something, such as a weapon, towards oneself.",
    "A plan, proposal, or sketch, often used in a professional context for design, architecture, engineering, etc.",
    "An act of attracting people or attention, as in a drawing card.",
    "A series of events, tasks, or activities arranged or planned in chronological order."
  ],
  "dreadful": [
    "Extremely frightening, terrible, or unpleasant.",
    "Causing great fear, horror, or dismay.",
    "Involving or characterized by extreme suffering, misfortune, or evil.",
    "Very bad, unpleasant, or unsuccessful."
  ],
  "dream": [
    "A series of thoughts, images, or sensations occurring in a person's mind during sleep.",
    "An aspiration, ambition, or goal that one hopes to achieve in the future.",
    "To imagine something that is not real or present; to fantasize or have an idea without evidence.",
    "To engage in deep thought or contemplation about a subject or situation."
  ],
  "drench": [
    "Soak thoroughly or saturate something with water, as in washing clothes or rinsing vegetables.",
    "Flood an area with a liquid, typically in large quantities or forcefully.",
    "Make someone or something extremely wet by pouring or spraying water over them.",
    "Irrigate land or soil to provide plants with moisture."
  ],
  "dress": [
    "A garment consisting of a fitted bodice and an attached skirt or pants, typically worn by women and girls",
    "Clothing in general, especially when considered collectively (e.g., \"I have nothing to wear\")",
    "To clothe someone or something with appropriate garments",
    "A written account, report, or formal statement (not commonly used for this meaning)"
  ],
  "drew": [
    "Past tense of the verb \"draw\", meaning to pull or drag something, usually using force or effort.",
    "A place where water from a spring, well, or river can be obtained, typically by digging or drilling.",
    "The act of representing an image or object in detail using lines or colors, especially in art or drawing."
  ],
  "dribble": [
    "A thin stream of liquid, such as saliva or water, that escapes from a container or through weak muscles in the mouth or throat.",
    "The act of allowing small amounts of liquid to escape, typically accidentally or unwillingly.",
    "To drop or let something fall slowly and steadily, usually one at a time, especially referring to a ball in sports."
  ],
  "dried": [
    "Dehydrated, with water removed",
    "Shrunken or wrinkled due to loss of moisture",
    "Preserved through a process that removes moisture",
    "No longer wet or damp",
    "Used of food, no longer fresh but suitable for cooking or eating",
    "Dry or parched, as in 'dried up riverbed'"
  ],
  "drop": [
    "To let something fall from a height to the ground or another surface, usually due to the force of gravity. For example, \"I dropped my keys on the floor.\"",
    "To cease participating in an activity, often suddenly and without warning. For example, \"The band decided to drop that song from their setlist.\"",
    "To deliver or deposit something at a location; to make a delivery. For example, \"The mail carrier dropped off my package this morning.\"",
    "To decrease the level or amount of something, such as liquid in a container or value in a price. For example, \"The water level dropped after taking a shower.\"",
    "In fashion and design, a drop is a long piece of fabric that hangs from the shoulders. For example, \"This dress has a long drop to create a dramatic look.\""
  ],
  "drought": [
    "A prolonged period of time with little or no rainfall, leading to a shortage of water for plants, animals, and humans.",
    "An extended absence of precipitation in a specific region that causes significant negative impacts on agriculture, ecosystems, and water resources."
  ],
  "drown": [
    "To be submerged completely in water, leading to suffocation and death.",
    "To sink or become overpowered by something, such as emotions.",
    "In some contexts, to cover with a liquid or immersed in it."
  ],
  "drowsy": [
    "Feeling sleepy, tired, or as if one is about to fall asleep.",
    "Moving or causing something to move slowly, lazily, or with little energy."
  ],
  "drudgery": [
    "Hard, monotonous, and often boring physical work that must be done regularly.",
    "A task or activity that is repetitive, uninteresting, and requires a lot of effort to complete.",
    "Work that is unpleasant or tiresome but necessary to perform."
  ],
  "dry": [
    "Not containing or having a lack of liquid; not wet.",
    "Having no moisture, humidity, or dampness; arid.",
    "Absence of dew, rain, or other precipitation; parched.",
    "Lacking emotional or intellectual stimulation; monotonous.",
    "(Of wine) having a low residual sugar content and high acidity; tart or sharp in taste.",
    "(Of wood, paint, etc.) free from moisture and thus suitable for use; seasoned."
  ],
  "duck": [
    "A waterbird with a small head, broad short wings, a large body, and a sturdy bill, capable of taking off and landing on water, found in various species such as the mallard, wood duck, and muscovy duck.",
    "A young bird of any fowl or gamebird species, especially one that is under six months old, often raised for food or sport.",
    "To take evasive action by suddenly moving out of the way, especially in a game or sports context; to dodge or avoid (something).",
    "Informal: An expression of disdain or contempt, as in \"That's a bunch of duck.\"",
    "In baseball, the act of sliding into a base to avoid being tagged out, especially when sliding headfirst."
  ],
  "due": [
    "Owed or payable, especially as a result of a debt or obligation.",
    "Timely; occurring at the appropriate time.",
    "Belonging to a specific period, event, or person.",
    "Being or deserving something according to fair treatment.",
    "Required by law, rules, or customary practice."
  ],
  "duel": [
    "A competitive situation in which two competitors are trying to outperform each other.",
    "An intellectual or verbal contest between two parties expressing opposing ideas or viewpoints."
  ],
  "duet": [
    "A musical composition intended for two performers, typically a vocalist and an instrumentalist or another vocalist.",
    "Any situation in which two individuals or entities work together or depend on each other."
  ],
  "dug": [
    "Past tense of the verb \"dig\" meaning to remove earth, soil, or other materials in order to make a hole, trench, or excavation.",
    "In sports like volleyball, a successful hit of the ball towards the opponent's court.",
    "(Informal) To have sex."
  ],
  "dump": [
    "A place where unwanted or useless items, such as garbage or discarded materials, are collected and disposed of.",
    "To move (a large quantity of something) hastily or carelessly to a particular place.",
    "An area in a computer system where data that is no longer needed is stored or deleted."
  ],
  "dungeon": [
    "A dark, underground chamber or room used for imprisonment or as a place of confinement, especially during medieval times when they were often used for torture and punishment by authorities."
  ],
  "during": [
    "While something is happening; within a specified period of time.",
    "In the process of an activity or event occurring; concurrently.",
    "Occurring at the same time as another action or event; simultaneous.",
    "As part of a specific period; within the bounds of a certain timeframe."
  ],
  "dusk": [
    "The time of day when it is becoming dark, often characterized by a mix of light and shadow.",
    "A period of twilight at dawn or dusk.",
    "An atmosphere or mood suggestive of the time around dawn or dusk.",
    "The color or appearance of the sky during the hours surrounding sunrise or sunset, typically consisting of a range of colors from orange to deep blue."
  ],
  "duteous": [
    "Acknowledging and following the rules or customs of a particular society, group, or individual.",
    "Showing a consistent and careful regard for one's obligations or duties."
  ],
  "dutiable": [
    "Subject to a duty, tax, or levy; liable to be charged with a duty or tax.",
    "Belonging to or owing some kind of duty or obligation.",
    "Subject to certain legal requirements or duties, especially in international trade or commerce."
  ],
  "dye": [
    "A natural or artificial substance, usually a colored pigment, that can be applied to textiles, hair, skin, or other materials to change their color.",
    "The process of changing the color of something using dye.",
    "An instance of a specific color produced by a particular dye or combination of dyes.",
    "A person's appearance or characterization as a result of the dyeing process, such as \"dressed in dyed clothing\" or \"a dyed blonde.\""
  ],
  "dystopian": [
    "Describing a society that is characterized by an oppressive government, social misery, and human suffering; often found in fiction or depicted as a nightmare scenario of the future.",
    "Relating to or denoting an imagined place or society in which people lead lives of great misery, from which they do not seem able to escape."
  ]
}