{
  "January": [
    "The first month of the year in the Gregorian calendar.",
    "A time when many people set New Year's resolutions.",
    "Typically a cold and wintery month in the Northern Hemisphere, and warm in the Southern Hemisphere.",
    "January is named after the Roman god Janus, who has two faces, looking forward to the future and backward to the past."
  ],
  "Japanese": [
    "Pertaining to Japan or its people, culture, language, or customs.",
    "Of, relating to, or denoting the Japanese language, which is an East Asian language and the native language of Japan."
  ],
  "jackal": [
    "A small wild dog, typically having a thin body and long legs, with greyish-brown fur, found in Africa and Asia.",
    "A person who takes advantage of others for personal gain or profit.",
    "An inferior copy or version of something, especially a song or recording."
  ],
  "jacket": [
    "A piece of clothing worn on the upper body, typically with sleeves and fastening at the front or back, made to protect against cold weather or as an outer garment.",
    "To provide a protective covering for a book or document by encasing it in a durable material such as leather, plastic, or vinyl."
  ],
  "jade": [
    "A hard, compact mineral consisting of nephrite or jadeite, used for making ornaments and decorative objects due to its smooth texture and attractive green color.",
    "A person or thing that is old or worn out, lacking in energy, or no longer interesting or useful.",
    "In chess, a term used to describe a position where both players have only one piece of each type remaining, resulting in an easily memorized endgame tableau.",
    "The jade plant (Crassula ovata), a succulent with green leaves and small white flowers, popular as a houseplant."
  ],
  "jadedness": [
    "Fatigue, disinterest, or boredom resulting from excessive exposure to something, often due to repetition or familiarity."
  ],
  "jail": [
    "A place where people are kept in confinement as punishment for committing a crime or as a preventive measure before trial, typically operated by local government authorities.",
    "A place or situation from which it is difficult to escape or leave, often used metaphorically (e.g., \"He was stuck in a job he didn't like, like a bird in a cage.\")."
  ],
  "jalousie": [
    "A louvered ventilation device, often used in windows, that allows air to circulate while providing privacy and light control by adjusting the angle of the slats.",
    "An envious or jealous state of mind.",
    "A type of grille used for decorative purposes, typically made up of horizontal slats or bars."
  ],
  "jam": [
    "A thick, sweet spread made from fruit, sugar, and pectin, used on bread or other foods.",
    "A crowded or difficult situation; a traffic jam is an example.",
    "To force someone to leave their home by surrounding it with armed soldiers.",
    "A type of music, usually improvised, played by several musicians at the same time.",
    "In sports, especially basketball, to block or hinder an opponent's attempt to score."
  ],
  "jamboree": [
    "A large gathering, typically involving games, entertainment, and group activities.",
    "An event or celebration characterized by excitement and lively activity."
  ],
  "jamming": [
    "The act of packing a container, jar, or other receptacle with food so tightly that it is difficult to remove or extract.",
    "A musical improvisation, often in a jazz context, where the musicians play together without a pre-determined plan.",
    "In radio communication, interference caused by intentionally transmitting on the same frequency as another signal to block its transmission.",
    "In sports, a situation where multiple players rush toward the ball or puck at the same time, causing confusion and making it difficult for any one player to gain control."
  ],
  "jar": [
    "A container made of glass, ceramic, or plastic with a lid or stopper, used for holding food or drink, typically having a wide mouth and often being cylindrical in shape.",
    "To shake or disturb someone's emotional balance, causing them to feel upset or distressed.",
    "(In botany) The fruit of the coffee plant, consisting of two indehiscent, dry, and fleshy halves surrounding seeds."
  ],
  "jargon": [
    "A specialized language"
  ],
  "jealous": [
    "Envy or resentment of someone's advantages, achievements, or happiness; feeling of envy usually because of another person's possessions, relationships, or success.",
    "(Astrology) The position of the Moon in its orbit that makes it appear full; also referred to as the \"full moon.\""
  ],
  "jealousy": [
    "A feeling of envy, resentment, or anxiety caused by another person's achievements, advantages, or possessions.",
    "The fear that something one values will be taken away due to the success or happiness of someone else."
  ],
  "jeep": [
    "A type of motor vehicle with four-wheel drive capability, typically having a boxy shape, large tires, and a fold-down windshield for off-road use.",
    "A model of the automobile produced by Jeep, an American brand of SUVs (Sports Utility Vehicles) and off-road vehicles.",
    "A colloquialism referring to any type of vehicle, usually a utility or sports car, used for off-roading or all-terrain driving."
  ],
  "jellyfish": [
    "A type of aquatic, gelatinous animal found in oceans and seas, characterized by a soft, nearly translucent body and tentacles that sting prey or deter predators.",
    "(Informal) A person who is ineffectual, indecisive, or unassertive, often described as \"a jellyfish with no backbone.\""
  ],
  "jeopardy": [
    "A situation in which something is at risk, danger, or in peril; potential for loss or harm.",
    "The act of placing someone or something in a precarious or dangerous position.",
    "A game show where contestants answer questions to win money and avoid losing all their accumulated winnings."
  ],
  "jester": [
    "A person, especially in medieval Europe, who entertained others through humor and wit, often wearing colorful costumes and using physical comedy.",
    "In modern context, a person who makes jokes or amusing comments, often in a light-hearted and entertaining manner."
  ],
  "jet": [
    "A stream of fluid ejected at high speed from a nozzle, often used in spraying, cutting or cleaning.",
    "An aircraft propelled by jet engines, capable of traveling at extremely high speeds and altitudes.",
    "A dark-colored liquid produced by coal, shale, or lode deposits; \"oil from a jet\"",
    "A fast, powerful stream of water, especially one used to fight fires.",
    "To travel in or as if in an aircraft propelled by jet engines.",
    "To cut, carve, or remove material using a high-speed jet of fluid."
  ],
  "jettison": [
    "Throw or drop something from an aircraft, ship, or vehicle in order to make it lighter or safer.",
    "Discard or abandon something that is no longer needed or useful.",
    "Cast away or get rid of something, often in a hasty manner.",
    "Eject or remove something forcibly from a system or environment."
  ],
  "jettisoned": [
    "Thrown away, discarded, or ejected from something, often to lighten a load or in an emergency situation.",
    "(Slang) To give up or abandon something, usually due to its being useless or burdensome.",
    "(Aeronautics) Releasing excess weight or equipment from an aircraft in order to achieve better flight performance."
  ],
  "jewel": [
    "A precious or semiprecious stone, typically cut and polished, that is set in jewelry or other decorative objects.",
    "An object of great beauty or worth; a valuable possession.",
    "A highly regarded person or thing; an asset.",
    "A gemstone that is part of a decorative or prized collection.",
    "In gemology, a term used to describe the clarity, color, and cut of a gemstone."
  ],
  "jewelry": [
    "A collection of decorative ornaments made from precious metals, gemstones, or other materials, worn to enhance one's appearance or express personal style."
  ],
  "jib": [
    "The front part of a sailing ship, which includes the mast, boom, and the head of the sail.",
    "A crane or derrick used to lift heavy objects, especially one mounted on a motor vehicle for unloading cargo."
  ],
  "jingle": [
    "A catchy tune or song, often used in advertisements or as a refrain for rhymes.",
    "The sound made by coins, bells, or other metal objects when shaken or struck together.",
    "A short and simple verse, especially used to help remember information or teach something."
  ],
  "jingoistic": [
    "Characterized by extreme patriotism, nationalism, or chauvinism, often to the point of aggression or war-mongering.",
    "Displaying an exaggerated sense of pride and loyalty towards one's own country, sometimes at the expense of other nations.",
    "Marked by a belief in the superiority of one's nation and a willingness to use force or aggression to defend its interests."
  ],
  "jittery": [
    "Feeling or showing anxiety, nervousness, or excitement, often characterized by trembling or shaky movements.",
    "Relating to or characterized by jittery movements or sensations, such as shaking or quivering.",
    "(Informal) Nervous or anxious in behavior or mood; uneasy."
  ],
  "job": [
    "A specific piece of work that one is paid to do, often in a regular and ongoing capacity.",
    "A position, role or task within an organization or company requiring certain skills and responsibilities.",
    "An occupation, profession or line of work that a person is engaged in for income."
  ],
  "jocularity": [
    "The quality of being humorously playful or lighthearted in behavior or speech.",
    "Humor, wit, or jest displayed through words or actions, often used to bring laughter or amusement.",
    "A humorous or playful remark or expression."
  ],
  "jocund": [
    "Full of joy, mirth, or cheerfulness; merry, jolly, or lively.",
    "Pleasant or amusing in a lighthearted way; entertaining.",
    "Humorously funny or witty; comical."
  ],
  "jocundity": [
    "Cheerfulness, happiness, or merriment; a state of being joyful or lighthearted.",
    "The quality of being amusing, humorous, or entertaining; a sense of humor or wit."
  ],
  "joined": [
    "Came together or became connected with something else.",
    "Combined forces, efforts, or opinions to achieve a common goal.",
    "Became part of a group, organization, or society.",
    "Joined (something) by adding information or elements to make it complete or improve it."
  ],
  "jolt": [
    "A sudden, sharp shake or blow.",
    "An unexpected shock or disturbance.",
    "A quick, sharp push or thrust.",
    "To cause to move suddenly or violently.",
    "To surprise or startle someone."
  ],
  "jostle": [
    "Push or shove (someone) roughly or in a crowded place, often unintentionally.",
    "Compete closely with another for superiority, advantage, etc., typically in sports or business.",
    "To move something forcefully by pushing it from all sides."
  ],
  "journal": [
    "A book in which one records events, feelings, or experiences on a daily basis.",
    "A publication that contains articles on various subjects, usually written by different authors and covering a wide range of topics.",
    "A record kept by an organization to document transactions, financial activities, or other important information."
  ],
  "journalism": [
    "The occupation of collecting, writing, and presenting news stories in various formats such as print, broadcast, or online media.",
    "A report or account of recent events written by a journalist for publication in newspapers, magazines, or on websites.",
    "A field of study that focuses on the history, theory, and practice of journalism, including its legal and ethical aspects."
  ],
  "journey": [
    "A trip or passage from one place to another, especially when involving travel over a considerable distance.",
    "An experience of traveling through space, time, or a particular situation, often with the purpose of personal growth or enlightenment.",
    "A continuous process or development marked by gradual change over time, especially concerning an individual's self-discovery or character evolution."
  ],
  "jovial": [
    "Happy, cheerful, and good-humored."
  ],
  "joviality": [
    "The quality of being cheerful, lively, and convivial; mirthfulness or happiness in a group setting."
  ],
  "joy": [
    "A feeling of great pleasure and happiness.",
    "The state of being happy and content.",
    "Something that brings pleasure or delight.",
    "An expression of merriment, often displayed on one's face."
  ],
  "jubilance": [
    "A state of great happiness, joy, or triumph characterized by a sense of elation and celebration.",
    "The feeling of overwhelming pleasure, satisfaction, or merriment experienced after achieving something significant."
  ],
  "jubilant": [
    "Showing or expressing great happiness, joy, or triumph.",
    "Exuberantly celebrating or rejoicing.",
    "Filled with a sense of elation and celebration, especially after achieving something significant or overcoming an obstacle."
  ],
  "jubilantly": [
    "With great joy, happiness, or triumph; celebrating with happiness and exuberance.",
    "Expressing or marked by jubilation; characterized by a feeling of great joy or triumph."
  ],
  "jubilation": [
    "A state of great happiness, often expressed through loud cheering, singing, or dancing. It is typically experienced when a desired goal or outcome has been achieved, such as winning a game or completing a difficult task. Jubilation can also be felt during celebrations and festivals that commemorate joyous occasions, such as weddings, graduations, or holidays."
  ],
  "judgement": [
    "The ability to make considered decisions or conclusions.",
    "The process of forming an opinion or evaluating something based on evidence, knowledge, or experience.",
    "A decision or verdict reached after due consideration.",
    "An act of assessing the value, quality, or significance of something."
  ],
  "judicious": [
    "Careful and sensible in making decisions or choices; showing good judgment.",
    "Prudently discerning or discriminating; characterized by wise consideration or thought.",
    "Marked by careful thought and deliberation; intelligent and well-considered.",
    "Choosing or using only what is most appropriate or useful in a particular situation."
  ],
  "juggernaut": [
    "A large, powerful, and unstoppable force or entity that dominates a field or activity by overwhelming all competitors.",
    "An enormous wooden chariot in the ancient Hindu festival of Jagannath Ratha Yatra, representing Lord Jagannath, which is pulled through the streets by thousands of devotees."
  ],
  "jumble": [
    "A confused or disorderly mixture of things; a mess.",
    "To mix up or disarrange, causing confusion.",
    "A puzzle consisting of interwoven letters or words that must be unscrambled to form a phrase or message."
  ],
  "jump": [
    "To move off a surface by pushing oneself into the air, typically using one's legs.",
    "To cause something to suddenly change from one state or level to another.",
    "To make an abrupt shift in direction or movement.",
    "A leap or bound made by an athlete or animal.",
    "A sudden increase or rise in a particular area, such as stock prices.",
    "In computing, a sudden transition between two different states of a system or device.",
    "To enter or join something quickly and enthusiastically."
  ],
  "jumper": [
    "A piece of clothing, typically with sleeves and a hemline designed to fall below the waist, that is meant for wearing in cold weather and covering the body from neck to mid-thigh or knee.",
    "A person who quickly moves from one position, job, or situation to another.",
    "An article of clothing, such as a sweater or cardigan, designed to be worn over other garments and keep the upper body warm.",
    "A term used for someone who jumps or leaps, especially in sports like basketball or gymnastics."
  ],
  "jungle": [
    "A thick, dense, and tangled growth of trees and undergrowth, especially in a tropical region.",
    "An environment or situation where there is intense competition or struggle for survival among individuals or groups.",
    "An area filled with confusion or chaos due to numerous complex issues or elements."
  ],
  "junior": [
    "A term used to describe someone who is younger, less experienced, or in a lower position than another person of the same type or profession.",
    "A rank or title given to a student in a school or university who has completed their first year and is now in the second year, often indicated by the suffix \"-junior\" on academic degrees.",
    "A junior member of a company or organization, typically an employee with less experience or responsibility than others."
  ],
  "just": [
    "Recently; a short time ago: We arrived just five minutes ago.",
    "In a fair, proper, or reasonable manner: He was judged just in his decision.",
    "To the exact extent or degree: The cake was just sweet enough for my taste.",
    "By a small margin or difference: They won the game just by one point.",
    "Exclusively; only: I will have just coffee, please.",
    "Completely; entirely: He was just amazed at the sight before him."
  ],
  "justifiable": [
    "Capable of being justified, defended, or explained by reasonable grounds; reasonable or defensible under the circumstances.",
    "Able to be supported or maintained by evidence or valid reasoning.",
    "Permissible or acceptable based on certain conditions or standards."
  ],
  "justifiably": [
    "In a way that can be reasonably justified, explained, or defended; based on valid reasons or evidence.",
    "In a manner that is warranted by the circumstances, facts, or arguments.",
    "As a result of actions or decisions that are deemed appropriate and reasonable given the situation."
  ],
  "justification": [
    "A reasonable explanation or defense to support an action, belief, or decision; a valid reason.",
    "The act of making something seem right, reasonable, or acceptable by giving reasons or evidence for it.",
    "In computer programming, the process of optimizing code by breaking it into smaller units called basic blocks and rearranging them in an order that minimizes unnecessary instructions."
  ],
  "juvenile": [
    "Pertaining to, characteristic of, or being a young person especially between childhood and adulthood.",
    "A young person, especially a young animal or bird before reaching maturity.",
    "Something resembling or characteristic of a juvenile in behavior or attitude.",
    "An offense committed by a minor under the age of 18."
  ],
  "juxtaposition": [
    "The act of placing two things close together in order to illustrate a contrasting relationship between them.",
    "A close arrangement of two or more items for the purpose of comparison, often used figuratively.",
    "Positioning two objects side by side, especially for the purpose of emphasizing their differences."
  ]
}