{
  "kaleidoscope": [
    "A tube with mirrors inside, used to create colorful patterns by turning it while holding small pieces of colored glass or other objects inside.",
    "A device or software that can generate a variety of patterns or displays through the arrangement and rearrangement of multiple elements, often used in computer graphics and design."
  ],
  "kaleidoscopic": [
    "Characterized by a great variety of colors, patterns, or objects that constantly change when viewed from different angles.",
    "Involving an ever-changing variety of images and ideas; full of variety and rich in detail."
  ],
  "kangaroo": [
    "A large marsupial with powerful hind legs that is native to Australia and New Guinea, known for its ability to hop long distances.",
    "Any of various types of kangaroos, including the eastern gray, red, western gray, antlerless, and tree kangaroos."
  ],
  "keep": [
    "To maintain or preserve something in its current state, condition, or position.",
    "To store or hold objects, typically inside a container or enclosure.",
    "To continue doing something for a particular purpose or to achieve an outcome.",
    "To protect someone or something from harm or danger.",
    "In sports, to prevent the ball or puck from going out of bounds or being scored upon by the opposing team.",
    "To pay attention to, remember, or recall information.",
    "As part of a name for a building or establishment, such as a store, inn, or church, indicating that it is still in operation."
  ],
  "keeping": [
    "To maintain or preserve something in its current state or condition.",
    "To continue to do something over a period of time.",
    "To remain in a particular location, situation, or job.",
    "In sports, to hold on to the ball while moving.",
    "To have or provide an ongoing supply or stock of something."
  ],
  "kerfuffle": [
    "A noisy quarrel, dispute, or disturbance; a commotion or uproar."
  ],
  "kettle": [
    "A large pot with a handle and spout, used to boil water, soup, or other liquids.",
    "(slang) A person who is easily manipulated or influenced by others.",
    "(geology) A depression in the earth's surface filled with water, formed during glaciation when ice melts."
  ],
  "key": [
    "A small metal device, usually with a handle at one end and a bit at the other, that is inserted into and turned in a lock or keyhole to open or lock a door, cabinet, or other secured object.",
    "A piece of hardware used for starting and operating an internal combustion engine, such as a car ignition key or a motorcycle key.",
    "A code, password, or combination that allows access to a computer system, online account, or restricted area.",
    "In music, a symbol on a keyboard or on sheet music indicating the specific pitch or note to be played.",
    "A key or essential element in understanding a situation, solving a problem, or achieving a goal.",
    "A list of correlating values, often used for encrypting and decrypting messages in cryptography or coding."
  ],
  "keyboard": [
    "A set of keys on a computer, phone, or other electronic device that allows for inputting commands and text through a series of pressed buttons.",
    "An instrument with keys played by striking them with the hands, typically used to produce musical sounds or tones.",
    "The part of an electronic typewriter, cash register, or similar device where the operator presses keys to enter data or make selections.",
    "A component on a computer that is responsible for translating keystrokes into commands and output signals."
  ],
  "kick": [
    "To propel oneself forward by pushing off with a foot, as in kicking a ball.",
    "To strike or push (something) forcefully with one's foot.",
    "A sudden and sharp movement of the leg to remove an object that is touching it; for example, when you kick a stone away.",
    "An act of hitting someone or something with the foot, often as a form of self-defense or attack.",
    "To make a machine start by giving it a forceful push with your foot, like starting a motorcycle."
  ],
  "kid": [
    "A young goat, especially one that is less than a year old.",
    "An informal term for a child or young person, often used by parents or family members.",
    "To remove the scars, marks, or blemishes from something (such as leather) by applying heat and pressure."
  ],
  "kids": [
    "Young children, especially those under ten years of age.",
    "Informal term for children; offspring or youngsters.",
    "The plural form of the noun \"kid\" which refers to a young goat or to a kidskin (leather)."
  ],
  "killed": [
    "To cause someone's death, either intentionally or unintentionally.",
    "To put an end to something, such as a project or plan.",
    "In the context of video games or other interactive media, to defeat or eliminate an opponent or enemy character."
  ],
  "kilometer": [
    "A unit of length equal to one thousand meters or approximately 0.621371 miles."
  ],
  "kimono": [
    "A traditional Japanese garment, typically consisting of a long robe with wide sleeves that is worn by both men and women for special occasions or at home."
  ],
  "kind": [
    "A type, sort, or category of something; a particular variety or species. For example, \"dogs and cats are two different kinds of pets.\"",
    "Characterized by a particular quality or attribute; having a specific nature. For example, \"the park has a kind atmosphere.\"",
    "Showing concern or sympathy for others; benevolent or generous. For example, \"he was very kind to the new student.\"",
    "A friendly or polite way of addressing or referring to someone, especially as a form of respect. For example, \"please\" and \"thank you\" are words of kindness."
  ],
  "kinetic": [
    "Relating to motion or movement, especially of physical objects.",
    "Characterized by vigorous activity or movement.",
    "Of or relating to the field of kinetics, which studies the motion and interaction of bodies.",
    "In chemistry, describing a reaction that involves the movement of particles, such as collision or diffusion."
  ],
  "kingdom": [
    "A large natural area that includes many different species of plants and animals, especially one characterized by a dominant group of organisms (e.g., plants, mammals) that are closely related and adapted to the environment. For example, an animal kingdom.",
    "In ancient times, a large geographical area ruled by a powerful monarch or sovereign, usually consisting of numerous provinces, cities, and subjects. For example, the Kingdom of Egypt or the Holy Roman Empire."
  ],
  "kiss": [
    "A gentle touching of one person's lips to another person's lips, cheeks, or hands as a sign of affection, greeting, or love.",
    "The sound made by someone puckering their lips and blowing air out.",
    "To press one's lips against another person's lips, cheeks, or other body parts in an expression of affection or love."
  ],
  "kite": [
    "An airborne object, typically made of light material with a long tail, flown in the wind for recreation or sport.",
    "A curved bird, such as an eagle or hawk, known for its swiftness and agility in the sky.",
    "A piece of computer software that uses one program to secretly control another program's operations without the user's knowledge."
  ],
  "kitschy": [
    "Possessing a cheap, sentimental, and often gaudy appeal that is typically regarded as art or decoration."
  ],
  "knee": [
    "The joint connecting the thigh bone and the leg bone in the human body, allowing for bending and straightening of the leg and providing support to the body when sitting or kneeling.",
    "A bend or curve in a road, river, or other long, winding path."
  ],
  "knife": [
    "A handheld tool with a sharp edge, typically made of metal, used to cut or slice various materials such as food, paper, wood, or other objects.",
    "(Slang) An insulting term for a person who betrays or is untrustworthy; also known as \"backstabber\" or \"two-faced person.\"",
    "A sharp-edged weapon used in various combat sports or martial arts for defensive purposes, such as fencing or kendo."
  ],
  "knight": [
    "A person who has been given a special title by a king or queen as a sign of honor, and is often involved in battles or important events; also known as a \"noble.\"",
    "A chess piece that can move two squares in any direction, either horizontally or vertically, but only captures diagonally."
  ],
  "knit": [
    "To interlock loops of yarn, thread, or wire by looping and drawing them through other loops; used to create fabric, garments, or decorative items.",
    "To connect (computer files) using a network connection.",
    "To join or tighten together; interweave.",
    "To make something tight or taut."
  ],
  "knitted": [
    "Arranged in a regular pattern by interlocking loops of yarn, thread, or another flexible material; created with a series of interconnected loops formed through the use of needles, a loop, or a mechanical device."
  ],
  "knitting": [
    "The act of interlocking loops of yarn, thread, or another flexible material by hand to create fabric or decorative items, using needles or other tools.",
    "A craft or skill that involves creating textiles by looping and connecting fibers with knitting needles, hooks, or other instruments.",
    "The process of making clothes, accessories, or other materials by interlocking loops of yarn or thread, often for warmth or decoration."
  ],
  "knob": [
    "A rounded, usually protruding part of a surface or object that can be gripped or turned.",
    "A person who is considered unintelligent or unsophisticated.",
    "(Britain, slang) Money; cash."
  ],
  "knobby": [
    "Having prominent, rough, or irregular bumps, protuberances, or projections, like a knotted knee, a knobbly tree trunk, or knobby nails.",
    "Possessing an uneven or bumpy surface, such as in a knobby baseball.",
    "Relating to or having a rugged, irregular, or uneven appearance, such as a knobby landscape."
  ],
  "knock": [
    "To strike or tap something with a fist, hand, or object to get attention or open a door.",
    "To remove the outer skin or rind of fruits or vegetables by tapping or pounding them.",
    "To make a loud noise against something; as when two objects collide or when rain hits a surface.",
    "To imitate or reproduce the sound made by knocking.",
    "To attempt to solve a problem by trying different methods or approaches until one succeeds.",
    "Slang term for boasting, bragging, or claiming something that is not genuinely deserved.",
    "In music, to play chords in a quick succession or with emphasis on each note of the chord."
  ],
  "knot": [
    "A knot is a looped and tied piece of rope, string, or cord used to bind, fasten, hang, or secure objects.",
    "Knots can be classified into various types such as bowline, reef, square, half hitch, etc., each serving different purposes.",
    "A knot is also a unit of speed measurement for watercraft and airplanes; it equals nautical miles per hour (1 knot = 1.15 statute miles per hour or approximately 1.85 kilometers per hour)."
  ],
  "know": [
    "Have information or awareness about something or someone through learning, experience, or familiarity; be acquainted with.",
    "Possess understanding or comprehension of a subject, fact, or situation.",
    "Recognize, identify, or remember people, places, or things previously encountered or studied.",
    "Be aware of and act appropriately in response to certain situations or conditions."
  ],
  "knowledge": [
    "Familiarity, awareness, or understanding gained through experience or education with a particular subject.",
    "The fact or condition of knowing something with confidence because of information, learning, or experience.",
    "A body of information about a certain topic; general understanding or grasp of facts within that area.",
    "The ability to apply specific skills, expertise, or information in practical ways to solve problems or accomplish tasks."
  ],
  "knowledgeable": [
    "Familiar with or informed about a subject through experience, education, or reading."
  ],
  "known": [
    "Familiar to a person, based on previous experience or information; recognized or acknowledged.",
    "Recognized as factual or true; established by evidence or proof.",
    "Known individuals or things; recognized or identifiable.",
    "Acquainted with; having personal knowledge of.",
    "Familiar with the details or characteristics of; well-informed about."
  ],
  "koala": [
    "A small marsupial with a fluffy grey coat, round ears, and a round nose found in Australia, primarily living in eucalyptus trees.",
    "(Informal) An individual who enjoys relaxing or not doing much work, often described as \"sleeping all day like a koala.\""
  ],
  "kudos": [
    "Praise, approval, or credit given for someone's achievement or ability."
  ],
  "kumquat": [
    "A small, oval citrus fruit with a sweet, edible rind and tart flesh, typically used for desserts or marmalades."
  ]
}