{
  "Mediterranean": [
    "Relating to or living near the Mediterranean Sea, its people, or its culture.",
    "A style of architecture that takes inspiration from countries bordering the Mediterranean Sea.",
    "The Mediterranean diet is a way of eating with emphasis on fruits, vegetables, whole grains, and fish."
  ],
  "Mississippi": [
    "A long, narrow river in the southeastern United States that flows from north to south and serves as a natural border between several states.",
    "The name of one state in the U.S., located along the banks of this river. It is also the birthplace of many important figures in American history."
  ],
  "macabre": [
    "Relating to or portraying death, corpses, or the dead in a way that is intended to shock or horrify.",
    "Having a style or theme of dark, gloomy, or gruesome subjects and imagery.",
    "Depicting scenes of violence, gore, or suffering in a way that is meant to be disturbing or frightening."
  ],
  "machination": [
    "An elaborate plan, often involving complex or devious schemes.",
    "The act of plotting or conspiring to accomplish something, usually secretly or by deceitful means.",
    "A carefully planned and intricate scheme or design, typically one that is intended to deceive or manipulate others."
  ],
  "mad": [
    "Having a temporary state of extreme anger, often with loss of control over one's actions.",
    "Crazy or insane; mentally deranged.",
    "Foolish or irrational in an amusing way.",
    "Extremely busy or occupied, as in \"I was so mad with work today.\"",
    "A slang term for marijuana (though this usage is less common and may vary by region)."
  ],
  "made": [
    "Produced or manufactured something, often referring to a particular item or goods in general. For instance, \"They made a table\" or \"The factory makes cars.\"",
    "Prepared or arranged in a specific way or for a particular purpose, such as when planning an event or organizing materials. Example: \"We made plans for the party\" or \"I made notes on the presentation.\"",
    "Happened or occurred, typically used to refer to past events or experiences. For instance, \"He made a mistake\" or \"They made history by achieving this feat.\"",
    "Caused something to happen or lead to a particular result, often used for expressing responsibility or intention. Example: \"The new law was made to protect the environment\" or \"Misinformation made people believe false news.\""
  ],
  "madonna": [
    "A title given to the Virgin Mary in Christian art, representing the mother of Jesus Christ.",
    "A woman or girl considered as an object of affection or admiration, especially one who is seen as having a certain innocence or purity.",
    "A type of sculpture or painting depicting the Blessed Virgin Mary holding her child, Jesus."
  ],
  "magisterial": [
    "Characterized by an authoritative, impressive, or dignified manner.",
    "Belonging to or exhibiting the authority or power of a master or magistrate.",
    "Involving or demonstrating knowledge and competence in a particular field or subject matter."
  ],
  "magnanimity": [
    "The quality of being generous, forgiving, and noble-minded, especially towards one's rivals or opponents.",
    "An act of showing greatness of mind, such as forgiving an enemy or granting pardon to someone who has been defeated.",
    "A display of courage in the face of possible injury or defeat, often involving accepting a lesser victory for the sake of appearing noble or gracious."
  ],
  "magnanimous": [
    "Demonstrating or showing greatness of mind, noble traits, or generosity; displaying largeness of soul or spirit in forgiving an insult or injury; showing understanding and tolerant feelings towards others even when one has been wronged or offended.",
    "Exhibiting selflessness, benevolence, and a sense of nobility that allows for understanding and forgiveness of the mistakes or shortcomings of others.",
    "Showing or characterized by elevated virtue, generosity, tolerance, and forgivingness; being big-hearted, broad-minded, and unselfish."
  ],
  "magnet": [
    "A material, usually a metal, that attracts or is attracted to other materials due to their magnetic properties.",
    "A device made of this material, often in the shape of a bar or horseshoe, used for attracting and holding iron or steel objects.",
    "An instrument for attracting metals, consisting of a cylinder of soft iron, nickel, cobalt or other ferromagnetic material that is magnetized either permanently or temporarily by passage of an electric current or struck by a powerful permanent magnet.",
    "A natural body, as a piece of lodestone, having the power to attract metals.",
    "Something that strongly influences or attracts someone or something else."
  ],
  "magnetic": [
    "Possessing or caused by a force that attracts certain materials, such as iron, towards it.",
    "Relating to the science of magnetism or its properties and effects.",
    "Produced or resulting from the influence of magnetism.",
    "Able to produce an attraction or repulsion between objects when they are placed near one another."
  ],
  "magnetism": [
    "The force of attraction or repulsion between two magnetic materials or objects, caused by the alignment of their atomic magnets (unpaired electrons).",
    "A quality of certain substances that attracts and moves towards other objects with a similar property when they are in close proximity."
  ],
  "magnetize": [
    "To make an object become magnetic or attract iron objects by placing it close to a magnet, another magnetized object, or within a strong magnetic field.",
    "(In electronics) To cause a coil or wire to behave as a magnet, typically by passing an electric current through it in order to generate a magnetic field used in various devices such as speakers or transformers."
  ],
  "magnetized": [
    "Having been subjected to a magnetic field, causing it to possess magnetic properties such as attracting or repelling other magnetic materials.",
    "(for people) Becoming attracted or having an unusual fondness for something or someone.",
    "To make (a substance) capable of exerting magnetism by bringing it into the proximity of a magnet or subjecting it to a magnetic field."
  ],
  "magnificence": [
    "The quality of being magnificent, impressive, or very beautiful; grandeur.",
    "Something that demonstrates magnificence; a splendid display or action."
  ],
  "magnify": [
    "Increase the size of an image or object, making it appear larger than its actual size.",
    "Make something seem more important, impressive, or significant than it actually is.",
    "Enlarge the appearance or extent of something by using a lens, mirror, or other optical device to produce a magnified view."
  ],
  "magnifying": [
    "To make something appear larger, especially by using a magnifying glass or a microscope.",
    "To enlarge the size of something, such as an image or text, to make it easier to see or read.",
    "To increase the power or intensity of something, such as light or sound, so that it becomes more noticeable or effective.",
    "To intensify or emphasize a particular aspect or feature of something."
  ],
  "magnitude": [
    "The size, quantity, extent, or degree of something, especially when considered on a large scale.",
    "In mathematics and science, the numerical value that expresses the size or extent of a quantity, such as the size of an object, the brightness of a star, or the force of an earthquake."
  ],
  "magnolia": [
    "A type of large, showy flower that can be white, pink, or purple, often used in arrangements and bouquets.",
    "A genus of trees and shrubs, native to the eastern United States and China, characterized by their large, fragrant flowers and distinctive large leaves."
  ],
  "mail": [
    "A system of communication where letters, parcels, or packages are sent from one place to another through the postal service for delivery to the recipient.",
    "The items sent through this system, including letters and packages.",
    "Electronic messages that are sent over a computer network or the internet, which can be read by the recipients when they open them."
  ],
  "maintenance": [
    "The act of preserving something in its current condition by regular upkeep, repair, or replacement.",
    "An amount of money set aside for future expenses or needs.",
    "The practice of keeping a machine, vehicle, or equipment in good working order.",
    "The upkeep of buildings, land, and other physical property to ensure their long-term usefulness.",
    "The process of continuing something at a certain level or state by making ongoing efforts or providing support."
  ],
  "major": [
    "Of great importance, significance, or concern.",
    "Numerous; very many.",
    "A person who has completed a course of study in a particular field and is qualified to teach it.",
    "A person who has earned a degree from an accredited institution of higher education, typically after four years of full-time study.",
    "One of the principal subjects of study at a college or university; a major subject or area of concentration.",
    "A military unit consisting of several smaller units or groups.",
    "In sports, playing as an important player rather than being a reserve or backup.",
    "The leading or most influential person or thing in a particular field or activity.",
    "In mathematics, a positive number greater than one, which can be expressed as the product of prime numbers in a unique way."
  ],
  "majority": [
    "A number greater than half of the total number in a group, allowing decisions to be made or actions to be taken.",
    "The larger of two numbers when they are compared.",
    "A social or political group that holds more power, influence, or support than other groups."
  ],
  "make": [
    "Produce (something) by combining materials, elements, or parts.",
    "Create or cause to happen something that did not exist before.",
    "Arrange for a particular event or situation to occur; bring about.",
    "Amount to (a specific figure or total), especially in the context of an account.",
    "Cause someone to become aware of or notice something."
  ],
  "maladaptive": [
    "Not conducive to adaptation or adjustment; tending to impair a person's ability to cope with changes in their environment, behavior, or circumstances.",
    "Characterized by responses that are not helpful or constructive in dealing with new situations or challenges.",
    "In psychology and psychiatry, referring to behaviors, thoughts, or emotions that are dysfunctional or detrimental to an individual's well-being or social functioning."
  ],
  "malady": [
    "An illness or ailment, particularly one that has lasted for some time.",
    "A disease or disorder affecting someone's health.",
    "Any sickness, infirmity, or condition that causes distress or suffering."
  ],
  "malaise": [
    "A feeling of general discomfort, uneasiness, or vague illness, often with an unknown cause.",
    "A state of decline or deterioration in a society, organization, or system, often characterized by confusion, uncertainty, and instability.",
    "A sense of dissatisfaction, apathy, or ennui, often related to one's work, relationships, or life in general."
  ],
  "malediction": [
    "An act of cursing, invoking evil upon someone or something; a curse or imprecation.",
    "Something that is regarded as bringing bad luck or misfortune; an ill-omened thing.",
    "A phrase, statement, or action expressing strong disapproval or condemnation; a denunciation."
  ],
  "maledomestic": [
    "A term that is not found in a student dictionary, likely misspelled or misused.",
    "A blend of \"malicious\" and \"domestic,\" referring to acts of aggression or harm within the home."
  ],
  "malefaction": [
    "An act of wrongdoing or misconduct, particularly a serious offense or crime.",
    "Harmful or injurious action committed against someone or something.",
    "A deed that results in damage, destruction, or loss.",
    "An instance of mischief or evil-doing."
  ],
  "malefic": [
    "Possessing, causing, or intending harm or injury.",
    "Having or exhibiting a malevolent nature or intent.",
    "Relating to or characterized by evil or malignant influence."
  ],
  "maleficence": [
    "Malicious behavior or intention; wickedness or evil actions.",
    "Harmful or destructive acts, often with intent to cause harm.",
    "Evil or malignant influence believed to be exerted by supernatural entities, such as curses or spells."
  ],
  "maleficent": [
    "Wicked, evil, or causing harm; characterized by malevolence or having a sinister nature.",
    "(Of an influence or force) Causing harm or misfortune to others, often in a supernatural context.",
    "(Of a person or their actions) Characterized by or involving malice or evil intent."
  ],
  "malevolence": [
    "A spiteful or cruel intention or disposition, often resulting in harm to others.",
    "The quality of being wicked or malicious in nature."
  ],
  "malevolent": [
    "Having or showing a wish to harm someone or something; unfriendly, hostile, or cruel.",
    "Characterized by or having an intention to cause harm; wicked or malignant.",
    "Of, relating to, or characterized by malevolence; wickedly or maliciously inclined."
  ],
  "malicious": [
    "Intentionally causing harm, damage, or trouble to someone or something with hostile feelings or for no good reason; mischievous or vindictive actions.",
    "Designed or adapted for causing damage or injury; intended to harm or disrupt computer systems or networks."
  ],
  "malignancy": [
    "A condition characterized by the uncontrolled growth and spread of abnormal cells, often resulting in damage to healthy tissue or organs.",
    "A term used to describe a cancerous growth, indicating its potentially aggressive nature and ability to invade nearby tissues and spread to other parts of the body."
  ],
  "malignant": [
    "Characterized by a tendency to become progressively worse; malevolent or evil in nature.",
    "Relating to or caused by cancer cells that are actively growing, invading nearby tissues, and spreading to other parts of the body.",
    "Having or showing a markedly cruel or malicious intent; extremely hostile or vindictive.",
    "Of or denoting an infectious disease in plants or animals that spreads rapidly and causes severe damage or destruction."
  ],
  "malignantly": [
    "In a way that is characterized by evil intent, especially in relation to cancer cells that grow rapidly and spread to other parts of the body.",
    "(Medicine) Pertaining to cancer cells that aggressively invade surrounding tissues and organs.",
    "With an intention to harm or damage, often referring to someone's actions or behavior."
  ],
  "mall": [
    "A large enclosed public area containing many shops, restaurants, and entertainment venues.",
    "A long narrow strip of land, typically surrounded by water, used for walking or running.",
    "In computing, a data structure that allows access to an element identified by its key value."
  ],
  "malleability": [
    "The ability of a material to be shaped or changed by applying pressure, heat, or other forces. This definition is usually associated with metals that can be hammered, rolled, or forged into various shapes without breaking. It's often used as an important characteristic when selecting materials for various industrial applications.",
    "The quality of being easily influenced and changeable, especially concerning opinions, beliefs, or actions. In this sense, malleability often refers to the capacity of a person to adapt their views based on new information or experiences."
  ],
  "malleable": [
    "Able to be bent, shaped, or changed easily, especially by heat and hammering.",
    "Easily influenced, changed, or manipulated, like a material that can be worked into different shapes with heat and pressure.",
    "Open to suggestions, influence, or persuasion; receptive."
  ],
  "mammal": [
    "An animal that has fur or hair, feeds its young with milk from mammary glands, has a backbone, and typically gives birth to live young rather than laying eggs.",
    "A member of the class Mammalia in the phylum Chordata within the kingdom Animalia, characterized by having hair or fur, mammary glands that produce milk for their offspring, and a four-chambered heart among other features."
  ],
  "man": [
    "A human male person, as an adult male member of the species Homo sapiens.",
    "A male individual, often denoting a person without specifying age or status, e.g., \"Some men prefer tea while others prefer coffee.\"",
    "In some contexts, man can be used to refer to human beings in general, regardless of gender, as in \"Man has ventured into space.\"",
    "Man can also represent an adult human male in a collective sense, such as when referring to a group of men or the general population of males.",
    "In certain contexts, man may be used to describe a grown-up male person or individual, for example, \"The man at the door was looking for John.\""
  ],
  "manacled": [
    "Restrained, typically with handcuffs or chains, often as a means of control or punishment, especially in criminal justice systems or during conflict situations."
  ],
  "management": [
    "The act of controlling, directing, or supervising a group or department within an organization.",
    "The process of dealing with or regulating a specific task or situation, often in business or industry.",
    "The ability to organize and coordinate resources for achieving objectives or goals.",
    "The group of people responsible for overseeing and directing the operations of an organization or entity."
  ],
  "manager": [
    "A person responsible for coordinating the activities of a group of people to achieve certain goals or do specific work, often working in various fields such as business, sports, or events.",
    "A job title held by someone who oversees and controls an organization's operations or a specific department within it.",
    "A person who is in charge of a particular project or activity and makes decisions related to its progress and completion."
  ],
  "maneuver": [
    "Make a skillful or well-judged change of position, direction or force, typically in order to gain an advantage or avoid obstacles.",
    "Execute a military operation involving the movement and deployment of forces.",
    "Perform a sequence of steps or actions, especially as part of a sport, game, or other activity.",
    "Shift one's position or tactics in response to changing circumstances."
  ],
  "maneuvered": [
    "Directed or guided something to move into a desired position, typically in a skillful manner.",
    "Arranged or planned (an event, course of action, etc.) so as to achieve the best possible results.",
    "Moved or changed position carefully and skilfully in order to gain an advantage over opponents.",
    "Moved or shifted something into another position without damaging it or causing disruption."
  ],
  "maneuvering": [
    "Adjusting the position, direction, or speed of an object, such as a vehicle, aircraft, or vessel, to move it in a desired way, typically in response to changes in its surroundings."
  ],
  "mango": [
    "A juicy tropical fruit that has a sweet, succulent pulp encased in a rough, fibrous skin.",
    "The tree that bears the mango fruit.",
    "The name of this fruit is also used as an ingredient or flavoring for various dishes and desserts."
  ],
  "mania": [
    "A period of intense interest, enthusiasm, or activity in something, often short-lived.",
    "An episode or prolonged period of abnormally elevated mood, often accompanied by grandiosity, decreased sleep, and increased energy levels.",
    "A strong and sometimes irrational desire to do or achieve something, often associated with an obsession.",
    "An intense preoccupation with a particular activity or idea, usually to the exclusion of other interests."
  ],
  "manifesto": [
    "A public declaration of intentions, opinions, objectives, or policies, often by a political party, organization, or individual.",
    "A book or other literary work intended to serve as a manifestation or demonstration of the author's ideas or beliefs."
  ],
  "manipulate": [
    "Handle or control (something, especially in a skilled manner) with an intent to change its form, appearance, or function.",
    "Deceive or control someone in order to achieve one's own purpose.",
    "Modify or adapt something (such as data, text, or images) for a specific purpose, often in a dishonest way."
  ],
  "manipulative": [
    "Skilled at using one's hands, especially in handling delicate objects or making intricate changes to something.",
    "Cleverly devious; cunningly deceitful in dealing with people.",
    "Capable of being controlled or directed, especially by applying pressure or force."
  ],
  "mannequin": [
    "A lifelike figure, often used in fashion or retail to display clothing, made of materials such as wax, plastic, or resin.",
    "An artist's model who poses for drawings or paintings."
  ],
  "manner": [
    "The way in which something is done or happens; style or method.",
    "A particular behavior, attitude, or way of doing things, especially one that is characteristic or typical.",
    "A polite or courteous way of behaving or speaking, often used to show respect for others.",
    "A skillful and efficient manner of performing a task; expertise.",
    "In writing, the use of appropriate language, grammar, and punctuation to convey meaning effectively."
  ],
  "manor": [
    "A large estate, especially in rural areas, historically belonging to a noble family and managed by an overseeing official called a steward or managing agent.",
    "A self-contained residential community built around a central courtyard, often with shops, restaurants, and other amenities within the walls.",
    "A term used in heraldry for an ornamental shape resembling an irregular hexagon."
  ],
  "mansion": [
    "A large, luxurious house with many rooms, often used as a home by wealthy people.",
    "A building or property, especially a historic one, designed for the use and enjoyment of a privileged few.",
    "An estate or land that includes a large and impressive residence, often including gardens and other features."
  ],
  "manumission": [
    "The act of releasing someone from slavery, serfdom, or similar servile conditions; the freeing of a person from unjust or involuntary servitude.",
    "The legal process by which a person is freed from bondage or slavery, often through the payment of a sum of money to their owner as compensation for the loss of property."
  ],
  "many": [
    "A large but indefinite number of people or things.",
    "In a great number or amount; numerous.",
    "Used to emphasize that something occurs frequently or happens repeatedly.",
    "(In statistics) representing a large proportion of the population being studied."
  ],
  "map": [
    "A representation of a particular area, such as a country, city, or region, on a flat surface showing physical features, political boundaries, and other significant details using lines, colors, symbols, etc.",
    "A diagram or chart representing the relationships between different elements, for example, the genetic makeup of an organism can be represented in a map form known as a pedigree chart.",
    "The act or process of making something clearer to understand by arranging it or presenting it visually in an organized manner, often using lines, colors, symbols, etc. This is also called mapping."
  ],
  "maps": [
    "A detailed illustration of an area, often showing geographical features such as mountains, rivers, cities, and roads. It helps people to locate or navigate places easily."
  ],
  "marathon": [
    "A long-distance race with a distance of 26.2 miles (42.195 kilometers) that originated from the Battle of Marathon in ancient Greece.",
    "A challenging or endurance task or event, often used metaphorically to describe something very difficult or requiring great effort."
  ],
  "maraud": [
    "To plunder, pillage, or raid a place or area in a violent manner; often used to describe actions by an armed force or thieves.",
    "To move or travel through a particular area in a disorderly and destructive way.",
    "To engage in something in a rough or reckless manner, often causing harm to others or the environment.",
    "(Archaeology) To excavate or explore an archaeological site without proper permission or methods, resulting in damage or loss of artifacts.",
    "(Literature) In J.K. Rowling's Harry Potter series, a group of rogue wizards who went on to form the original Death Eaters."
  ],
  "marbled": [
    "Characterized by a pattern of darker patches or veins running through lighter background, resembling the appearance of marble.",
    "Having a speckled or variegated color pattern, as in a type of stone or some animals such as marbled trout.",
    "In cooking, describing food that has been prepared with streaks or swirls of different colors, such as a marbled cake or bread."
  ],
  "marbles": [
    "A small, round glass or plastic object used as a game piece in various games, often played by children.",
    "A state of confusion or uncertainty, sometimes referring to the mind being clouded or unable to think clearly.",
    "(In the context of computer graphics) A method of rendering curved surfaces by approximating them with many small flat polygons."
  ],
  "marigold": [
    "A bright yellow-orange color, often found in flower petals, fabrics, or other objects.",
    "A type of flowering plant known for its large, vibrant orange or yellow flowers, commonly used in gardens and as decorative elements."
  ],
  "mariner": [
    "A person who works on a ship, especially as a sailor or navigator.",
    "One who engages in sea voyages for trade, exploration, or other purposes.",
    "A professional seaman skilled in navigation, handling of ships, and related activities.",
    "An individual involved in the maritime industry, including those working on ports, docks, or shipping companies."
  ],
  "mark": [
    "A distinguishing symbol, such as a cross used by the ancient Romans to indicate that a person had been condemned to die.",
    "A sign or character, typically written or drawn on a surface, serving to identify, document, or provide information about something.",
    "An impression made by pressure, heat, or chemical action, such as a burn or stain left on fabric, skin, or another material.",
    "A point, place, or area designated for a particular purpose, like a meeting spot or a stop on a journey.",
    "The act of leaving an imprint or making a record of something.",
    "A space between two points that can be occupied or crossed over, as in \"make your mark\" to mean achieving success.",
    "To make a note or score in a game, competition, or test, representing progress or achievement.",
    "To leave an impression, such as by leaving evidence of one's presence or influence at a location.",
    "A measure of value or quality, like the marking of grades or ratings in evaluations."
  ],
  "marker": [
    "A symbol, sign, or indication used to mark something important, such as a location, a specific point in time, or to highlight an idea in writing.",
    "A small object, typically made of plastic or ink, that can be placed on paper to guide or record something, often used for drawing, mapping, or testing purposes.",
    "In computing, a specific place where the compiler or interpreter stops in order to retrieve information or perform an action."
  ],
  "marriage": [
    "The legal union of two people as husband and wife, recognized by law, involving various social, religious, and legal aspects.",
    "A long-term committed relationship between two individuals who have chosen to live together as a couple and may or may not be legally married.",
    "An arrangement where a man and woman are united in lawful wedlock for the purpose of establishing a family, with its associated rights and obligations."
  ],
  "marrow": [
    "The soft, spongy tissue found in the center of bones such as femur or humerus. It is crucial for blood cell production in animals including humans.",
    "A term used to refer to a person or thing that is at the core or essence of something, especially in terms of understanding or identity.",
    "An informal term for cocaine, derived from the term's association with the drug's appearance and color."
  ],
  "marry": [
    "To enter into a legal, religious, or formal union as partners for life, typically by exchanging vows in a ceremony.",
    "To unite two things closely or intimately together, as in a metaphorical sense.",
    "In some contexts, to join or combine two elements or groups, often using the word 'marriage' as an example."
  ],
  "marsh": [
    "A flat, wet area where water collects and many plants grow, such as reeds and cattails. These areas often have soft, muddy ground that supports a variety of wildlife including birds, insects, and amphibians. They can be found in areas with mild climates or where rivers flow into the sea.",
    "An area of land that is permanently or periodically covered by water. This type of environment is often home to unique species of plants and animals.",
    "A place characterized by swampy or marshy conditions, typically covered in water and vegetation. Such areas are usually formed near the mouths of rivers or at the borders between land and sea, where saltwater mixes with freshwater."
  ],
  "marsupial": [
    "An animal that carries its young in a pouch, found primarily in Australia and South America."
  ],
  "martial": [
    "Related to military activities, soldiers, or warfare.",
    "Of, relating to, or having the strength or courage of a soldier.",
    "Characterized by a strong feeling of nationalism, militarism, or martial spirit.",
    "Belonging to or characteristic of the martial arts."
  ],
  "martinet": [
    "A person who is very strict, demanding, or inflexible in enforcing rules or procedures.",
    "A rod used to straighten or flatten cloth or metal by repeated passing through rollers or between parallel plates.",
    "(Military) A wooden or metal rod with a flat or rounded end, used for striking soldiers who have committed minor offenses or as a drill in attention and discipline.",
    "(Metaphorically) An authority figure who enforces rules and discipline harshly."
  ],
  "martini": [
    "A classic cocktail made with gin or vodka, dry vermouth, and olives or lemon peel as a garnish, typically served chilled in a stemmed glass."
  ],
  "martyr": [
    "A person who willingly suffers death or great hardship as a result of their strong beliefs or principles, often in a religious context.",
    "A person who sacrifices something important to them, especially for the sake of others or their beliefs."
  ],
  "mascot": [
    "A living being, typically an animal, chosen as a symbol to bring good luck to a sports team, military unit, or organization.",
    "A character or symbol representing a school, company, or group, often used in promotional materials and events."
  ],
  "mask": [
    "A covering worn over the face, typically to protect against dust, gases, vapors, or infectious agents, or to provide privacy by hiding one's identity.",
    "In computer graphics, an image or text that is placed over a digital image to hide, reveal, or modify parts of it."
  ],
  "massacre": [
    "A violent act in which a large number of people are killed, usually by armed forces or during warfare.",
    "The act of killing numerous individuals as a result of a crime, often involving multiple victims.",
    "The destruction or annihilation of a whole or a major part of something, such as an organization or system."
  ],
  "masticate": [
    "To chew food with the teeth, breaking it down into smaller pieces for easier digestion."
  ],
  "masticated": [
    "Chewed and mixed thoroughly with saliva in order to break down food into smaller pieces, making it easier to swallow and digest. This process also helps in the release of enzymes that begin breaking down the nutrients in the food."
  ],
  "mat": [
    "A portable, flat, often rectangular floor covering made of various materials, used to protect floors, provide comfort or warmth, or serve as a surface for performing rituals or exercises.",
    "A frame or base with a woven surface on which objects can be placed in order to protect them from dust, moisture, or other contaminants.",
    "In mathematics, an identity matrix is a square matrix with all elements zero except the main diagonal, which consists of ones. It is used as a neutral element for matrix multiplication and has many important properties."
  ],
  "match": [
    "A pair of sticks, typically made of wood or plastic, used in a game where players attempt to strike the end of one stick against the other, trying to knock down pins arranged on a playing surface.",
    "To light one fire source with another, such as using a lighter to ignite a candle's wick.",
    "Two things that have similar characteristics or qualities, for example \"His personality matches her interests.\"",
    "A card game where players are dealt a predetermined number of cards and must form the highest combination using only those cards.",
    "An item available in different colors, sizes, or materials to suit individual preferences, such as shoes that come in various colors.",
    "In sports betting, placing a wager on two or more selections with related outcomes, for example \"I'm going to place a match bet on the soccer game and the tennis match.\"",
    "To find an equivalent or pairing, such as when looking for similar items in different languages: \"Matching French words with their English translations.\""
  ],
  "material": [
    "Relating to or consisting of substances that can be used in building, making things, or creating works of art.",
    "Regarding or involving something important enough to deal with it or consider it.",
    "Having a significant or meaningful influence on someone or something.",
    "Consisting of or pertaining to the elements of which something is composed; not abstract.",
    "Relating to or constituting the subject matter of a work, speech, or discussion."
  ],
  "maternal": [
    "Relating to a mother or one's mother, such as maternal instincts, maternal love, or a maternal figure.",
    "Inherited from the mother's side of the family, such as in the phrase \"she has her maternal grandfather's eyes\".",
    "Relating to or connected with the act of being a mother or parenting."
  ],
  "mathematizing": [
    "Applying mathematical concepts, methods, or techniques to a problem, situation, or subject matter."
  ],
  "matinee": [
    "A performance, such as a play, concert, or film screening, held during the day, typically before late afternoon, especially for the benefit of those who cannot attend evening events.",
    "(Informal) An occasion on which an individual takes part in a matinee event or participates in social activities related to it."
  ],
  "matriculate": [
    "To enroll as a student in a college, university, or other educational institution; to officially register.",
    "(In higher education) To admit someone into membership of a university or other academic institution; to grant a degree or diploma.",
    "(Sometimes figuratively) To admit or accept someone into an organization, group, or society."
  ],
  "matter": [
    "A substance that occupies space, has mass, and consists of atoms or molecules; something that can be perceived by touch, taste, smell, sight, or hearing.",
    "A topic under discussion or consideration, especially one of importance or public interest.",
    "Importance or significance; a serious issue to be dealt with or resolved.",
    "To regard something as of considerable importance or significance; give attention or weight to."
  ],
  "maudlin": [
    "Sentimental to the point of being melodramatic, often involving tears or excessive emotional displays.",
    "Overly sentimental or tearful, especially when under the influence of alcohol."
  ],
  "maul": [
    "A heavy hammer-like instrument used for breaking up ice on roads, ships, or airplane runways.",
    "To beat or strike with a maul.",
    "To damage or destroy by hitting with a maul."
  ],
  "mauled": [
    "Suffered severe injuries, typically from biting or scratching by an animal such as a dog or bear.",
    "Damaged or destroyed roughly or carelessly.",
    "Informal, treated roughly or harshly.",
    "Past participle of the verb 'maul', which means to attack and bite violently, especially in order to kill or injure."
  ],
  "maxim": [
    "A short, general truth or principle, often used as a guiding rule in life or behavior.",
    "A statement that expresses a basic truth or law of nature.",
    "The highest point of something, such as a hill, mountain, or building.",
    "In mathematics, an inequality that is always true; a general statement that can be applied to a broad range of situations."
  ],
  "may": [
    "May (noun): A beverage traditionally made from tea leaves, often flavored with lemon and sweetened with sugar or honey.",
    "May (month): The fifth month of the year in the Gregorian calendar, between April and June.",
    "May (verb): To grant permission or express a wish for something to occur; synonym: allow, let, wish."
  ],
  "maybe": [
    "Possibly; it could be that or something else, uncertain.",
    "A song by the American rock band, The Mamas and The Papas.",
    "A 2004 South Korean animated film directed by Lee Seung-joon.",
    "An informal way of saying 'perhaps' or 'possibly'."
  ],
  "mayor": [
    "The person who holds a position of leadership in a city, town, or other municipality, usually elected by its citizens, responsible for overseeing local government operations, and representing the community in various matters."
  ],
  "maze": [
    "A complex network of paths or passages, typically forming a complicated pattern designed to confuse or challenge those who enter it.",
    "A confusing or difficult situation or process from which it is hard to find a way out or make progress."
  ],
  "mean": [
    "Have a particular intention or purpose; intend, design, or plan.",
    "Denote an arithmetic operation used to find the average of a set of numbers.",
    "Be of a certain size, extent, amount, or degree.",
    "Express in clear and explicit terms."
  ],
  "meander": [
    "To move slowly in a winding course, often referring to rivers or streams that follow an S-shaped path as they flow.",
    "To wander aimlessly or without a clear purpose; to stroll leisurely.",
    "In literature and writing, to use a circuitous or roundabout way of expressing oneself, often for the sake of style or emphasis."
  ],
  "meandering": [
    "Wandering aimlessly, typically in a winding or circuitous path.",
    "Moving or flowing in a winding or curving course, like a river that changes its course over time.",
    "Engaging in idle talk or thinking without a clear purpose or direction.",
    "Describing a text that lacks clear organization or focus and seems to wander from one idea to another."
  ],
  "meanest": [
    "Denoting the person, animal, or thing that is most harsh, unkind, or cruel in a group; the cruellest one.",
    "Of an action, character, or nature, being as unkind or cruel as possible; extremely unkind or cruel."
  ],
  "means": [
    "A way, method, or medium by which something is achieved, accomplished, or expressed.",
    "The financial resources, property, or income available for use in a particular situation or plan.",
    "A device or instrument used to accomplish a task or perform a function.",
    "A connection or relationship between two points or places, often facilitated by transportation."
  ],
  "meant": [
    "Had as a purpose or intention; intended (used to describe past intentions)",
    "Implied or indicated, especially when words do not explicitly express something",
    "Signify or denote; indicate",
    "Used to refer to something that is unclear, uncertain, or open to interpretation",
    "Planned or intended for a particular person or purpose",
    "(In music) To have or give a certain character or quality",
    "In astronomy, the angle formed by two celestial bodies or celestial body and the observer's visual line of sight",
    "(Obsolete) Used to indicate that something would occur at a specified time in the future"
  ],
  "measles": [
    "A highly contagious viral illness characterized by fever, cough, runny nose, red eyes, and a rash of small, flat, red spots that often form a pattern resembling a net or lattice on the skin; also known as rubella or rubeola."
  ],
  "measure": [
    "Take the size, quantity, degree, or extent of something using a standard unit or method: \"I measured the length of the room with a tape measure.\"",
    "Determine or establish the size, amount, or degree of (something) by calculation or estimation: \"Scientists will need to take more measures to reduce global warming.\"",
    "A means of assessment or evaluation; an instrument used for this purpose: \"The doctor took my blood pressure using a measuring device.\"",
    "An action taken in response to a situation or problem: \"Governments must take immediate measures to address the crisis.\"",
    "A standard or basis for comparison; a point of reference: \"The new product is a measure ahead of its competitors.\"",
    "A unit or scale used to express something, such as time, distance, or temperature: \"We use the metric system of measures in our country.\""
  ],
  "meat": [
    "The edible portion of an animal, typically excluding bones and skin, often used as food for humans and other animals.",
    "Any part of an animal's body, such as its flesh or muscle tissue, that can be eaten by humans or other animals as a source of nutrition.",
    "In sports, especially boxing, the term \"meat\" is used to refer to the area between the waist and shoulders, considered the most vulnerable part of the body for a hit."
  ],
  "mechanic": [
    "A person who repairs, maintains, or installs machinery, engines, or vehicles.",
    "The branch of physics dealing with motion, forces, and energy.",
    "A person who works skillfully with their hands to create, repair, or improve things.",
    "An expert in a particular field or subject."
  ],
  "mechanical": [
    "Involving the use of machines, tools, or equipment, especially in performing tasks that would otherwise be done by hand.",
    "Relating to or having to do with the science and study of machinery, including how it functions and interacts.",
    "Describing movements or actions carried out in a regular, predictable way, like those performed by a machine.",
    "Pertaining to the branch of engineering that deals with the design, construction, and operation of machines and mechanical devices.",
    "Characterized by an absence of living organisms or biological processes, as in a mechanical heart or a robotic arm."
  ],
  "meddle": [
    "Interfere in or influence a situation or event, especially where it is not desired.",
    "To mix together various ingredients, especially when cooking or baking."
  ],
  "media": [
    "A plural noun referring to various sources of information and entertainment, such as newspapers, magazines, television, radio, and the internet.",
    "A singular form representing a single source or channel of communication, like a newspaper, television station, or website.",
    "In the context of advertising and marketing, the means through which a company promotes its products or services, often including multiple channels such as TV commercials, print ads, and social media."
  ],
  "medicine": [
    "A substance used to treat or prevent diseases and illnesses in humans or animals, often taken by mouth or applied topically.",
    "The profession concerned with the diagnosis and treatment of human illness using drugs, surgery, or other methods.",
    "The scientific study of the properties, actions, and uses of substances used to maintain or restore health, especially drugs."
  ],
  "mediocre": [
    "Not very good; average in quality, ability, or performance.",
    "Lacking notable distinction, interest, or excellence.",
    "Unremarkable or ordinary in a way that is not especially impressive or worthy of attention.",
    "(Of a student's work) showing no particular skill or effort and thus failing to achieve a higher grade.",
    "(Of a person) lacking talent or ability, so not able to do something well."
  ],
  "medley": [
    "A mixture or assortment of different things, often elements from various sources or categories.",
    "A musical composition made up of different songs or parts of songs, usually in a varied order."
  ],
  "melancholic": [
    "Characterized by a gloomy, depressed, or despondent mood or temperament.",
    "Relating to, caused by, or expressive of melancholy or sorrow.",
    "Expressing deep sadness or pessimism, often with a focus on loss and despair.",
    "Depicting or suggesting a feeling of sadness or gloominess in art, literature, music, etc."
  ],
  "melancholy": [
    "A state of deep sadness, gloom, or desolation.",
    "Depression, dejection, or sorrow.",
    "A long-lasting and constant state of sadness or unhappiness.",
    "The emotion or mood associated with mourning or lamentation."
  ],
  "melange": [
    "A mixture of various things or elements, often in a random or chaotic manner.",
    "A mixture or blend of different colors or patterns.",
    "An assortment of diverse elements, such as ideas, opinions, or cultures.",
    "A mixture or blend of different flavors, ingredients, or styles.",
    "A confused or jumbled collection of things or information."
  ],
  "melangeur": [
    "A person who has a wide range of skills, knowledge or abilities that can be combined in many different ways. They are versatile and adaptable in their work or personal life.",
    "A mix of various elements or styles, usually seen in literature, art, music, or food. It is created by combining different ingredients or influences to create a new and unique result."
  ],
  "mellifluously": [
    "In a smooth, flowing, and pleasing manner, like a sweet and gentle stream of honey; characterized by fluidity and melodiousness."
  ],
  "melodious": [
    "Characterized by a pleasing, harmonious, or musical quality in sound.",
    "Having a sweet and pleasant voice or tone.",
    "Expressing or suggesting a soothing or enjoyable melody."
  ],
  "melody": [
    "A succession of musical notes that form a pleasant and meaningful whole when heard or sung.",
    "The tune or pattern of sounds in music, especially as opposed to rhythm or harmony.",
    "Something resembling the pleasing arrangement of musical notes, as in literature or language."
  ],
  "melt": [
    "To change from a solid to a liquid state due to an increase in temperature, such as when ice becomes water or chocolate turns into a smooth mixture.",
    "To dissolve something by gradually combining it with another substance, like melting butter into a pan to cook.",
    "To lose courage or determination, as in \"he melted under the pressure of the interview.\"",
    "To blend or combine substances gently so that they mix smoothly and evenly, like melting crayons together for an art project."
  ],
  "member": [
    "An individual who is part of a group, organization, or society; a participant.",
    "A segment of something larger, such as a piece of a chain or an organ in the body.",
    "In a legislative assembly, one who has been elected to represent a district and have voting rights.",
    "A supporting part of a structure, like a column or pillar.",
    "An official representative or delegate sent by a larger group to attend or participate in something on their behalf.",
    "In music, the degree of a tone which is produced by the vibration of a certain number and kind of vibrating strings, i.e., the third member of a triad consists of three tones.",
    "The branching, leaf-bearing part of a plant, such as a tree or shrub."
  ],
  "membrane": [
    "A thin, flexible layer that covers or lines various parts of the body or encloses certain organs; it may be made up of cells, fibers, or both and serves as a protective barrier against injury, infection, and other environmental factors.",
    "A structure in a cell that separates organelles and compartments, controlling substances which can pass through it and regulating the flow of materials between different areas of the cell."
  ],
  "memento": [
    "A thing that helps someone remember something important, such as an object associated with a particular memory or event",
    "In video games, an item collected by the player that provides information or reveals hidden aspects of the game world",
    "(Latin origin) Memorial, especially referring to an inscription on a tombstone or monument",
    "A token of remembrance given at a funeral or other formal event as a keepsake for attendees"
  ],
  "memory": [
    "The mental process of acquiring knowledge and retaining information through the use of encoding, consolidation, storage, and retrieval processes. This type of memory can be further divided into sensory memory, short-term memory, and long-term memory.",
    "A collection of data stored in a computer or electronic device for future reference or usage. It is an integral component of computers and serves to save information permanently or temporarily.",
    "An object, like a photograph, that helps people remember something important.",
    "A person's capacity to remember things accurately. This can vary depending on factors such as age, health, and mental state.",
    "The act of recalling past events, experiences, or information.",
    "In psychology, the ability to retain and recall information over time can also refer to one's cognitive process, including the storage and retrieval of information.",
    "In computing, a device or medium used for storing data, such as a hard drive or USB flash drive."
  ],
  "menacing": [
    "Threatening or suggestive of hostile intent; ominous or intimidating in manner or appearance.",
    "(Of a situation, event, etc.) creating a feeling of fear or apprehension; alarming.",
    "(Of the weather, etc.) portending evil, as by a dark cloud, stormy sky, etc.",
    "(Of a time, period, etc.) foreboding or threatening; ominous.",
    "(Of facial expressions, gestures, etc.) expressive of anger, threat, or a menacing attitude."
  ],
  "mend": [
    "Repair or restore something that is broken, damaged, or in poor condition by fixing, connecting, or replacing parts. For example, \"I need to mend this hole in my shoe.\"",
    "Make amends for a wrong or offense committed; apologize or compensate for. For example, \"He tried to mend things with his friend after the argument.\"",
    "Bring together again; reconcile or restore friendly relations. For example, \"After the disagreement, they were able to mend their relationship.\""
  ],
  "mendacious": [
    "Characterized by an inclination or tendency to lie or misrepresent facts.",
    "False, dishonest, or untrustworthy.",
    "Lying or misleading in speech or writing; deceitful.",
    "Containing or characterized by lies or falsehoods."
  ],
  "mendacity": [
    "The quality of being dishonest or untruthful in speech or writing.",
    "A statement that is false, deceitful, or misleading.",
    "The act of lying or telling falsehoods deliberately.",
    "The state or practice of being deceitful or untrustworthy."
  ],
  "mended": [
    "Repaired something that was broken, torn, or damaged by using appropriate materials and techniques to restore it to its original condition or make it functional again.",
    "Restored something to its original state by putting the parts back together.",
    "Corrected an error, mistake or flaw in something (e.g., a sentence, a piece of writing) so that it is accurate and no longer faulty."
  ],
  "mendicant": [
    "A person who begs for food, money, or other necessities.",
    "Refers to a member of an order of medieval religious friars, known for their itinerant lifestyle and begging for alms as part of their religious practice."
  ],
  "menial": [
    "Relating to tasks that are considered low-status, unskilled, or manual in nature; often associated with domestic work or other forms of labor that require minimal skills or education.",
    "Characterized by a lack of importance or significance; insignificant or trivial."
  ],
  "mental": [
    "Related to one's thoughts, emotions, or intellect rather than physical abilities or objects.",
    "Concerning mental health or well-being, including the study of mental processes and behavior.",
    "Involving or requiring thought, reasoning, or cognitive effort.",
    "Of, relating to, or existing in the mind rather than in reality.",
    "Pertaining to or characterized by a strong emotional response or psychological aspect."
  ],
  "mention": [
    "To state or refer to someone or something, especially in a conversation, text, or writing.",
    "To include a person, place, thing, or idea within a list, document, or discussion.",
    "To give credit to a person for their work, actions, or accomplishments.",
    "To bring up or call attention to a topic or issue in order to address it or make others aware of it."
  ],
  "mentor": [
    "An experienced person who guides, supports, and advises a less experienced individual in their personal or professional development."
  ],
  "menu": [
    "A list of dishes or items that one can choose from in a restaurant, often divided into sections according to category (e.g., appetizers, main courses).",
    "In computing, a list of options or selections displayed on a screen for the user to choose from."
  ],
  "mercantile": [
    "Relating to trade, commerce, or merchants.",
    "A building used for commercial purposes, such as a store or office space.",
    "A type of business organization involved in the exchange of goods and services for money.",
    "A person who is engaged in trade or commerce, especially an international trader."
  ],
  "mercantilise": [
    "To adopt economic policies that prioritize trade, aiming to increase a country's wealth by accumulating foreign currency reserves and reducing dependence on other nations for resources."
  ],
  "mercenary": [
    "A person who is employed to serve in an army primarily for payment, without any particular attachment to the cause or country they are fighting for.",
    "Someone who works in a field or profession because of the money or other advantages it provides, and not out of genuine interest or commitment to the work."
  ],
  "merchandise": [
    "Goods, especially commercial products, that are bought and sold in large quantities for resale by retailers or wholesalers.",
    "A range of items offered for sale, usually within a particular store or category such as clothing, electronics, or groceries.",
    "Any item or product that is produced to be sold and traded, including physical goods, digital products, or services."
  ],
  "merchant": [
    "A person or business that buys and sells goods, especially by selling them in shops.",
    "A person who trades or deals in a particular thing.",
    "A banker who engages in financial transactions such as foreign exchange or derivatives."
  ],
  "mercurial": [
    "Unpredictable and changeable in behavior, moods, or opinions; fickle."
  ],
  "mercury": [
    "A chemical element represented by the symbol Hg in the periodic table, a heavy silvery metal known for its ability to form amalgams with other metals and used in thermometers, barometers, dental fillings, and various industrial processes.",
    "The innermost planet of the solar system, also called a small planet, named after the Roman god Mercury. It is close to the Sun and has an extreme range of temperatures due to its proximity to the star."
  ],
  "merriment": [
    "A state of happiness, joy, or amusement experienced by people during festive activities or social gatherings.",
    "A lively and jovial atmosphere where people engage in fun and laughter.",
    "Entertaining activities that provide enjoyment, amusement, and pleasure to individuals."
  ],
  "mesmerize": [
    "Captivate someone's attention, usually through a fascinating performance or display.",
    "Overwhelm someone with beauty, charm, or ability to such an extent that they are speechless.",
    "Entrance someone by hypnotic means, causing them to be under one's spell."
  ],
  "messaging": [
    "The act of exchanging messages, typically via texting, email, social media, or instant messaging platforms.",
    "A method of organizing and categorizing information, such as sorting documents into folders.",
    "A style of communication that relies on short, concise sentences and phrases."
  ],
  "metamorphosed": [
    "Undergone a transformation, change, or conversion from one form to another, especially in reference to biological processes such as insects changing from larvae to adults.",
    "Experienced significant alteration or adaptation, often used to describe a major shift in behavior, beliefs, or character.",
    "Undergone a physical or chemical change resulting in the formation of new minerals or rocks, as in geology and earth sciences."
  ],
  "metamorphosis": [
    "A remarkable transformation or change in something, often involving a complete change of form or appearance.",
    "The process by which an insect goes through three stages (egg, larva, pupa, adult) with distinct physical changes at each stage.",
    "In literature and art, the transformation of a character or symbol into another form to express new ideas or concepts."
  ],
  "metaphorical": [
    "Denoting or expressing something in terms of a figure of speech in which a word or phrase is applied to an object or action to which it is not literally applicable, as in \"He was a lion on the field\" or \"The road was a river of tears.\"",
    "Of or relating to metaphors or the use of metaphorical language, as in \"Her speech was filled with metaphorical expressions.\""
  ],
  "meteor": [
    "A luminous streak of light seen in the sky caused by a small celestial object, such as an asteroid or comet, entering Earth's atmosphere and burning up.",
    "Any one of various small stones or particles of stone that fall from the sky.",
    "A brief, bright phenomenon occurring in the upper atmosphere due to the high-speed impact of a solid cosmic object."
  ],
  "meteorology": [
    "The scientific study of the atmosphere, weather, and climate, encompassing aspects such as temperature, precipitation, wind patterns, and air pressure.",
    "The branch of science that deals with predicting and analyzing atmospheric conditions, including weather forecasts and long-term climate trends."
  ],
  "meter": [
    "A device used to measure the distance, speed, or amount of something (e.g., a speedometer measures speed).",
    "A unit of measurement for length, as in \"he walked one meter,\" or a base unit of measurement in the metric system for volume and other quantities.",
    "In poetry, a line that has a specific number of syllables, often used to create rhythmic patterns."
  ],
  "methuselah": [
    "A very old person, typically one who has lived significantly longer than the average lifespan.",
    "A large container for wine or other beverages, often holding around twenty-six gallons and named after Methuselah, a character in the Bible who is said to have lived to be over 900 years old."
  ],
  "meticulous": [
    "Thorough and painstaking in regard to details.",
    "Marked by great care and precision.",
    "Scrupulously attentive to detail."
  ],
  "metropolitan": [
    "Relating to or living in a large city, especially its central area.",
    "Characteristic of a metropolis, such as being sophisticated, bustling, or cosmopolitan.",
    "Serving as the center of government, commerce, or culture for an area or nation.",
    "Belonging to or involving a group of cities that have close economic and cultural ties."
  ],
  "mezzanine": [
    "A tier of balcony seats in a theater, located between the main floor and the upper level.",
    "An intermediate floor or level between two main floors in a building, often used as additional space for offices or storage.",
    "(In music) The middle register of a musical instrument, located between the treble and bass registers."
  ],
  "miasma": [
    "A mixture of bad smells, often resulting from decaying organic matter or pollution.",
    "A vague idea, perception, or feeling that is difficult to define or describe precisely.",
    "In ancient Greek belief, a poisonous exhalation thought to cause diseases and other unpleasant conditions."
  ],
  "microchip": [
    "A small electronic device, often no larger than a grain of rice, that can store data or carry out certain functions when powered by an external source.",
    "(Definitions may vary depending on the context it is used in.)"
  ],
  "midget": [
    "A term used in the past to refer to a person of short stature, now considered outdated and insensitive.",
    "In the context of miniature or small objects, an object that is smaller than usual but still functional.",
    "In the field of mechanics, a small tool or part designed for use in tight or confined spaces."
  ],
  "might": [
    "Had the power, ability, or strength to do something in the past; used to express possibility or potential. For example, \"He might have been telling the truth.\"",
    "Used to form the subjunctive mood to express hypothetical or unlikely situations. For example, \"If I had a million dollars, I might quit my job.\"",
    "Indicates that an action was possible but not certain or probable; used for past possibility. For example, \"I left early because I thought it might rain later.\""
  ],
  "migraine": [
    "A severe, often recurring headache that causes throbbing pain on one side of the head, sensitivity to light and sound, nausea or vomiting, and sometimes an aura (visual disturbances) before the headache begins.",
    "A neurological disorder characterized by moderate to severe headaches that can cause disabling pain and interfere with daily activities."
  ],
  "migration": [
    "The movement of people, animals, or birds from one region or country to another, usually for better living conditions or opportunities.",
    "The process by which data is moved between storage devices or systems.",
    "In computer networks, the transfer of data between servers or computers through a communication protocol such as FTP or HTTP."
  ],
  "mileage": [
    "The distance in miles traveled, especially by a vehicle.",
    "The space available for passengers in a vehicle.",
    "The amount of experience or knowledge gained through observation, practice, or travel."
  ],
  "milieu": [
    "The environment or surroundings in which something occurs or develops, including people, things, and conditions that influence it.",
    "A particular social or cultural group that someone is a part of or interacts with.",
    "In psychology, the external situation or environment in which an individual lives or operates."
  ],
  "milk": [
    "A white fluid produced by mammals for the nourishment of their young, used as a source of nutrition, in cooking, or for making dairy products such as cheese and yogurt.",
    "To draw liquid from a substance or an object.",
    "To obtain or produce something in large quantities."
  ],
  "millennium": [
    "A period of one thousand years, often used to describe significant milestones in history, such as \"the second millennium\" or \"the Christian millennium.\"",
    "In the context of computing, it refers to a large amount of data stored or transmitted in one unit of time, often associated with Y2K (Year 2000) issues."
  ],
  "millinery": [
    "The art of designing, creating, and selling hats and other headwear."
  ],
  "mimicry": [
    "The act of imitating someone or something in appearance, behavior, or speech.",
    "In biology, a phenomenon where an organism resembles another organism to gain advantages such as protection from predators or access to resources.",
    "A theatrical art form where performers portray characters and situations through impersonation, pantomime, and other techniques."
  ],
  "mind": [
    "The part of a person that allows them to think, reason, remember, decide, and feel emotions. It is responsible for controlling behavior, making decisions, and shaping personality.",
    "To be aware of or concerned about something; to consider or take care of something.",
    "To look after someone or something; to be responsible for someone or something.",
    "To pay attention to something, often because it is important or interesting.",
    "A mental state that can change depending on moods and feelings.",
    "The ability to understand what others are thinking or feeling, and to react accordingly."
  ],
  "mine": [
    "Possessing, belonging to, or being a part of oneself; \"my house is large\"",
    "An excavation in the ground made for obtaining minerals, coal, etc.; \"the mine was deep and dangerous\"",
    "The act or process of mining; \"miners worked in the silver mine\"",
    "A place where something can be obtained or found; \"they had to go out into the mine to search for the valuable minerals\""
  ],
  "mingle": [
    "To move about, interacting with various individuals in a social setting in order to form connections or make new acquaintances.",
    "To combine two or more substances or elements so that they are thoroughly mixed together.",
    "To merge or join things together by intertwining them or making them intermingle."
  ],
  "miniature": [
    "A small representation of something, often smaller than a real-life version.",
    "An artwork or painting created on a small scale.",
    "A miniaturized device or object that is much smaller than the original size.",
    "A short version or condensed form of something larger or longer."
  ],
  "minimize": [
    "To reduce something to a minimum, as in size, amount, or extent; make as small as possible.",
    "To lessen or reduce the effects, seriousness, or frequency of (a problem or situation).",
    "To limit or restrict (something) to its smallest or least degree, level, or instance."
  ],
  "minimum": [
    "The least amount, level or extent of something; the smallest value in a range or scale. For example, \"the minimum wage is set at $7.25 per hour\" or \"the temperature dropped to its minimum at night.\"",
    "The smallest quantity required for a specific task or condition; an essential or fundamental necessity. For instance, \"to pass this course, you need to attend the minimum number of classes\" or \"this project requires a minimum amount of materials.\"",
    "In mathematics, the lowest value of a function or equation within a given range. For example, when solving for x in the equation y = 2x + 1, finding the minimum value of y involves determining the smallest x value that still produces a valid result."
  ],
  "minus": [
    "A symbol used to indicate subtraction, such as in a mathematical expression like 5 - 2 = 3.",
    "The act of taking something away from a total or amount, for example, subtracting 10 from a score reduces it by 10 points.",
    "Used to show the difference between two quantities, as in \"There are five apples minus three oranges, leaving us with two fruit left.\""
  ],
  "minuscule": [
    "Extremely small in size, amount, or significance",
    "A very small letter used in ancient Roman writing",
    "Something that is too small to be noticed or considered important"
  ],
  "minute": [
    "A unit of time equal to sixty seconds, one-sixtieth part of an hour or one-60th of a minute.",
    "Very small; tiny; not large in size or amount.",
    "Marked by careful attention and thoroughness.",
    "Of short duration or limited scope.",
    "Carefully measured and recorded details, as in a diary or journal."
  ],
  "mire": [
    "A soft, wet, muddy ground that can easily trap and entangle someone or something.",
    "To sink or become trapped in such a place.",
    "To involve someone in a difficult or unpleasant situation from which it is hard to escape.",
    "The state of being stuck or bogged down by a troublesome situation."
  ],
  "mirror": [
    "A smooth, reflective surface that reflects light and images without distortion.",
    "A sheet of polished metal or glass used to see one's reflection.",
    "Something that serves as a model or example for others to follow or copy.",
    "To cause something to be repeated or reproduced exactly, like looking at oneself in a mirror.",
    "In computing, a command that displays the contents of a file or memory location."
  ],
  "mirth": [
    "A state of being filled with laughter, amusement, or joy; an expression of happiness through laughter or merriment.",
    "An event or occasion characterized by cheerful and lively behavior.",
    "The quality of being lighthearted or jovial, typically in response to humor or wit."
  ],
  "mirthful": [
    "Associated with a joyful, lively, and jovial mood; expressing or accompanied by laughter and amusement.",
    "Characterized by the feeling of happiness and lightheartedness, often leading to bursts of laughter and a cheerful atmosphere."
  ],
  "misanthrope": [
    "An individual who dislikes, distrusts, or is generally prejudiced against humankind.",
    "A person who avoids social interactions due to a deep-seated cynicism or pessimism about human nature."
  ],
  "misanthropic": [
    "A person who dislikes, distrusts, or is generally prejudiced against the human race or its members.",
    "Tending to avoid other people due to a pessimistic view of human nature or a general unwillingness to engage with others."
  ],
  "misbehaved": [
    "Acted in a manner that was not appropriate, proper, or socially acceptable.",
    "Conducted oneself in an unruly, disruptive, or disorderly fashion.",
    "Displayed behavior that went against rules, expectations, or norms."
  ],
  "miscalculate": [
    "To make a mistake in calculations, resulting in an incorrect answer or result."
  ],
  "miscellaneous": [
    "A collection of various things, often not organized into categories; a hodgepodge.",
    "Used to describe something that is not easily classified or understood as belonging to a specific category or type.",
    "Serving to illustrate a variety of different things in contrast to the uniformity found in other examples."
  ],
  "mischief": [
    "Trouble, difficulty, or harm caused by someone's actions or behavior.",
    "A trick or prank played by someone to cause amusement, usually at the expense of others.",
    "Disruptive or destructive behavior, especially when done for fun."
  ],
  "mischievous": [
    "Characterized by a playful, tricky, or disobedient behavior often meant to cause amusement for oneself or others, especially in children.",
    "Causing or showing a desire to cause harmless trouble or disorder; naughty or impish."
  ],
  "mischievously": [
    "In a playful, naughty, or tricky manner, often with the intent to cause harmless fun or amusement."
  ],
  "misconception": [
    "A mistaken belief, notion, or idea about something that is generally accepted as true.",
    "An incorrect understanding or interpretation of a fact, concept, or situation.",
    "A false impression or erroneous belief held by an individual or group, despite evidence to the contrary.",
    "A widespread but inaccurate belief or notion, often rooted in tradition, culture, or popular opinion."
  ],
  "misconstrued": [
    "Interpreted incorrectly or in a way that distorts the intended meaning.",
    "Perceived or understood inaccurately or in a manner different from what was intended."
  ],
  "misdemeanor": [
    "A minor crime or infraction, less serious than a felony, punishable by fine or imprisonment for not more than one year."
  ],
  "mishandled": [
    "Handled improperly, poorly, or carelessly.",
    "Treated with neglect or disregard; not given proper care or attention.",
    "Mismanaged or misused; not handled according to correct procedures.",
    "Not dealt with effectively or appropriately; inadequately addressed."
  ],
  "mishmash": [
    "A confused, disordered mixture or combination of different elements or features.",
    "An indiscriminate assortment or jumble of various things; a hodgepodge.",
    "A chaotic and unorganized mix; a medley."
  ],
  "misinterpret": [
    "To understand incorrectly or to assign a wrong meaning to something, especially due to a lack of understanding or knowledge.",
    "To attribute an incorrect or distorted significance to a statement, text, or situation.",
    "To mistakenly give a different sense or interpretation to words or actions than was intended by the speaker or writer."
  ],
  "misplaced": [
    "Out of its proper place or position; incorrectly placed.",
    "Given to a person, group, or cause that does not deserve it or where it is unwanted; ill-suited.",
    "Not well-received or appropriate for the situation or context."
  ],
  "mistaken": [
    "Incorrect or not accurate in fact or judgment: a mistake, error, or misunderstanding.",
    "Not matching or corresponding with something else: inconsistent or contradictory.",
    "Accidentally or unintentionally doing something wrong or choosing the wrong option: by mistake or misfortune.",
    "Believing or thinking something that is not true: an erroneous belief or assumption.",
    "Misinterpreting or misunderstanding someone's words, actions, or intentions."
  ],
  "misunderstand": [
    "To not fully understand or to have an incorrect understanding of something, often due to a misinterpretation or lack of clarity in communication."
  ],
  "mitigate": [
    "Reduce the severity, pain, or intensity of something.",
    "Lessen the harshness or impact of a punishment, law, or situation.",
    "Diminish or reduce the strength, effectiveness, or influence of something undesirable.",
    "Make an unpleasant or unwelcome situation seem less severe or unpleasant."
  ],
  "mitigation": [
    "The act of making something less severe, serious, or painful.",
    "A reduction in the severity, seriousness, or pain caused by an event or action.",
    "A measure taken to reduce the impact or effects of a disaster, environmental harm, or criminal activity.",
    "Lessening the negative consequences of something undesirable."
  ],
  "mitochondria": [
    "Small, membrane-bound organelles found in the cells of most living things that convert energy from food into a form that can be used by the cell, often referred to as the \"powerhouses\" of the cell."
  ],
  "mitten": [
    "A glove with separate compartments for each finger, leaving only the thumb exposed."
  ],
  "mixture": [
    "A combination of two or more substances that are combined to form a new substance with distinct properties.",
    "A blend or assortment of different things, such as colors, flavors, or ideas.",
    "In chemistry, the act or process of mixing substances to produce a homogeneous substance.",
    "In music, a combination of notes, chords, or rhythms that create a particular sound or style."
  ],
  "mnemonic": [
    "A method, device, or system that aids memory by associating what one wishes to remember with an image, word, or phrase.",
    "A word, phrase, or pattern of letters, sound, or movement that helps people remember something else (such as a sequence of numbers, words, or other information)."
  ],
  "mnemonics": [
    "A technique used to improve memory by associating a piece of information with an easily remembered image, word or phrase.",
    "A system for organizing data in order to make it easier to remember."
  ],
  "moan": [
    "Express pain, grief, or exhaustion with a long, mournful sound.",
    "Complain repeatedly about a situation or problem in a whining manner.",
    "A deep, resonant note produced by certain musical instruments, such as organs or saxophones."
  ],
  "mob": [
    "A large crowd of people, typically one that is disorderly or threatening.",
    "A group of birds, especially rooks or crows.",
    "A gang or group of criminals.",
    "A swarm or multitude of something, as in a \"mob of bees.\""
  ],
  "mobilization": [
    "The process of organizing, deploying, or assembling resources, such as troops, equipment, or personnel, in response to a crisis, conflict, or need.",
    "The act of bringing people together, often for a political cause or protest, by coordinating their efforts and resources.",
    "The movement of people or objects from one place or situation to another, usually in order to fulfill a particular purpose or goal."
  ],
  "modern": [
    "Characteristic of, relating to, or being the present or recent times; contemporary.",
    "Dating from or typical of the present time; current, up-to-date, or fashionable.",
    "Of or pertaining to the current or latest style in art, architecture, literature, etc.; contemporary in form or expression.",
    "Involving or using modern techniques, methods, or equipment; technologically advanced or updated."
  ],
  "modulate": [
    "Adjust or control (something, such as a signal or sound) by changing one or more of its characteristics, such as frequency or amplitude.",
    "Express or present (an idea or opinion) in a way that makes it easier for others to understand or accept.",
    "Change the tone or style of (a piece of music), typically by altering the key or tempo."
  ],
  "mold": [
    "A three-dimensional shape used to create a specific form in materials such as metal, chocolate, or concrete.",
    "A fungus that grows on food, plants, and other organic materials, producing spores for reproduction.",
    "The process of shaping a substance by applying pressure to it while it is in a fluid state."
  ],
  "molecular": [
    "Relating to particles called molecules, which are made up of two or more atoms bonded together",
    "Involving or describing chemical reactions that involve molecules and their interactions",
    "Depicting the study of structures, properties, and behavior of molecules in a specific area of science (e.g., molecular biology)"
  ],
  "molecule": [
    "A group of atoms bonded together, forming the basic unit of a chemical compound.",
    "(Chemistry) The smallest particle of an element or compound that can take part in a chemical reaction and retain its identity.",
    "(Physics) An elementary particle consisting of two or three quarks.",
    "A small unit or part that makes up something more complex or larger."
  ],
  "molecules": [
    "A small group of atoms bonded together, which form the basic building blocks of matter and make up all substances, materials, and compounds."
  ],
  "moleskine": [
    "A type of notebook with a hard, protective cover made from a synthetic material resembling leather, traditionally used by artists, writers, and thinkers for creative and personal expression."
  ],
  "mollify": [
    "To calm or soothe someone who is upset, worried, or angry.",
    "To make something less harsh, severe, or extreme.",
    "To reduce tension or disagreement between people by making them feel more at ease or satisfied."
  ],
  "molluscs": [
    "A large group of invertebrate animals, including snails, clams, and octopuses, typically having a soft body enclosed by a protective shell or hardened skin.",
    "The class of the phylum Mollusca, which contains over 85,000 known species."
  ],
  "mollusk": [
    "An invertebrate animal with a soft body, often covered by a hard shell, that lives mostly in water or damp places. Examples include snails, clams, and octopuses.",
    "A type of seafood derived from such animals, commonly consumed as food."
  ],
  "molt": [
    "The process of shedding an outer covering, such as a snake's skin or an insect's exoskeleton, in order to grow.",
    "In the case of birds and reptiles, the periodic replacement of feathers or scales by new ones."
  ],
  "mom": [
    "A female parent who has given birth to and raised a child, referring to one's own mother or another woman in a similar role.",
    "In informal speech, an expression of affection or endearment for one's own mother or other women who are like a mother figure."
  ],
  "moment": [
    "A brief period of time, often measured in seconds, minutes, hours, etc.",
    "A particular point or phase in a process or activity.",
    "A crucial time when decisions or actions may have significant consequences.",
    "A small break or pause, especially between movements or activities.",
    "The mathematical concept representing the measure of force that produces acceleration in an object, calculated by multiplying mass and velocity."
  ],
  "momentum": [
    "The quantity of motion of an object, calculated as its mass multiplied by its velocity, often used in physics to describe the movement or force of an object or system.",
    "A trend or pattern of growth or development that increases the power or influence of something over time, often used in politics, economics, or social issues.",
    "In sports or competition, the ability to keep performing at a high level by carrying forward successes from previous performances or events."
  ],
  "monitor": [
    "A device used to observe, measure, or control something, such as a machine, process, or environment.",
    "A person or group of people responsible for supervising and overseeing a task, activity, or group.",
    "An electronic display screen that shows information from a computer, server, or other device.",
    "A type of lizard with a long, muscular tail that is commonly found in tropical areas."
  ],
  "monogamist": [
    "An individual who is involved in, or believes in, a romantic relationship with only one partner at a time.",
    "A person whose culture or religious beliefs practice monogamy as the preferred form of marriage or partnership.",
    "A person who adheres to the social norms and expectations associated with monogamy, such as faithfulness and commitment to their partner."
  ],
  "monograph": [
    "A written or printed work on a single subject, usually dealing with a specialized topic and presenting original research.",
    "In bibliography, a book written by one author on a single subject, particularly in the field of science or scholarship.",
    "In music, a solo composition for an instrument, typically as opposed to a piece played with others.",
    "An individual document in a published set or series of documents, each dealing with a different topic."
  ],
  "monolithic": [
    "Consisting of or constituted by a single mass or structure, especially in reference to language, politics, or society.",
    "Characterized by uniformity and lack of variety or differentiation.",
    "Regarding something that is massive, monumental, or impressive in its scale or scope."
  ],
  "monologue": [
    "A lengthy, single-voiced speech or conversation delivered by one person without an interlocutor or audience participation. It can be used to express thoughts, feelings, or ideas.",
    "In literature and theater, a dramatic scene where a character speaks without any response from others, often revealing their inner thoughts or emotions."
  ],
  "mononucleosis": [
    "A contagious infectious disease typically caused by the Epstein-Barr virus, characterized by symptoms such as fever, fatigue, sore throat, and swollen lymph nodes."
  ],
  "mononucleotic": [
    "Relating to or characterized by a single nucleus in a cell.",
    "Pertaining to or denoting a type of disease caused by a single-stranded RNA virus."
  ],
  "monopoly": [
    "Control of a market or industry by one company, preventing competition and allowing the company to set prices and determine supply.",
    "An organization that has control over the production, distribution, and sale of a specific product or service, resulting in limited choice for consumers.",
    "The exclusive possession or control of the supply or trade in a commodity or service."
  ],
  "monotone": [
    "Denoting or relating to a voice, sound, or musical composition that lacks variety in pitch or tonal quality.",
    "Possessing or characterized by a single or uniform character, quality, or aspect; one-dimensional.",
    "Of, relating to, or denoting a sequence of similar items with no change in value, as in mathematics or programming."
  ],
  "monotonous": [
    "Lacking variety or change; repetitive in a dull or boring way.",
    "Uniform and unchanging, lacking distinction or interest.",
    "(Of sound or speech) Having a constant pitch, without variation in tone.",
    "(Of an area or environment) Devoid of life, color, or other distinguishing features."
  ],
  "monotonously": [
    "In a monotonous manner; lacking variety, interest, or excitement.",
    "Characterized by a lack of changes in tone, pitch, or level of loudness."
  ],
  "monotony": [
    "A lack of variety or change in an experience, activity, or environment; tedious repetition.",
    "The state or quality of being monotonous; lacking interest or excitement."
  ],
  "monsoons": [
    "A seasonal wind that reverses direction every year, bringing heavy rain to certain regions, especially in Asia and Africa.",
    "The heavy rains associated with these winds, often causing flooding and landslides.",
    "The period of time during which the monsoon occurs, usually lasting several months."
  ],
  "monster": [
    "An extremely large, usually frightening or dangerous creature.",
    "A person or thing that is much larger, more powerful, or more successful than others of its kind.",
    "In mythology and folklore, a giant or grotesque being with supernatural strength and abilities.",
    "On a computer, an erroneous or misdirected piece of data or code that causes problems in the operation of a program or system."
  ],
  "monstrous": [
    "Of extraordinary size, as in great dimensions; huge.",
    "Inhumanly cruel or wicked; monstrously evil.",
    "Very unusual or unexpected; extraordinary.",
    "Relating to or resembling a monster; fantastical or grotesque."
  ],
  "monstrously": [
    "In an extremely large, ugly, or frightening manner; gigantic, grotesque, or horrifying.",
    "Exceptionally or extremely; very much so; to a great extent.",
    "Of or relating to a monstrous creature or entity."
  ],
  "monument": [
    "A structure, usually made of stone, metal or concrete, erected to commemorate a person or event.",
    "A significant event or achievement that serves as a reminder of the past or important historical facts.",
    "Any object, such as a natural landmark or geographical feature, that is considered worthy of preservation for future generations."
  ],
  "monumental": [
    "Of great importance, significance, or magnitude; having far-reaching or lasting effects.",
    "Very large or impressive in size, scale, or design; awe-inspiring.",
    "Relating to or signifying something that serves as a memorial or commemoration, such as a statue or building."
  ],
  "moon": [
    "The natural satellite of Earth, appearing in the night sky as a round, luminous object. It is visibly one of several moons that orbit planets in our solar system.",
    "A term used to represent any celestial body that orbits around a planet, such as Jupiter's moon Ganymede or Mars' moon Phobos.",
    "Used figuratively, \"once in a blue moon\" refers to a rare event or occurrence, usually meaning something that happens very infrequently, once every few years."
  ],
  "mop": [
    "A cleaning tool with a handle and a absorbent head, often made of cotton or other fibrous material, used for wiping up liquids or dirt from surfaces."
  ],
  "mope": [
    "To express sadness, gloom, or despondency through one's actions, gestures, or expressions.",
    "To act in a morose, melancholic, or dejected manner, often with little to no apparent reason.",
    "To engage in aimless or purposeless activity due to feelings of sadness or boredom."
  ],
  "mopping": [
    "The act of cleaning a floor using a mop, which is a tool made of absorbent material attached to a handle, by wiping or spreading water mixed with soap or detergent on the floor and then drying it off. This process helps in removing dirt, dust, stains, etc., from the surface."
  ],
  "morale": [
    "The confidence, enthusiasm, and discipline of an individual or group in accomplishing a task or achieving a goal, often influencing their attitude and performance.",
    "A measure of the emotional health and stability of a person or organization.",
    "The overall spirit and sense of belonging within a group, affecting its cohesiveness, productivity, and determination."
  ],
  "morbid": [
    "Relating to or characterized by an unhealthy interest in death, disease, suffering, etc.",
    "Of a nature that causes mental uneasiness or depression.",
    "Having a physical condition marked by sickness or disease.",
    "Concerned with the study of death, mortality, and dying.",
    "Of or relating to a person who is abnormally concerned with their own physical symptoms or those of others."
  ],
  "mordant": [
    "A substance that enables dyes or pigments to penetrate a material, making it hold color more effectively.",
    "An agent that reacts with other substances, particularly in chemical analysis.",
    "Bitter; harsh; severe.",
    "(Obsolete) A kind of fishhook."
  ],
  "more": [
    "To a greater degree, quantity, number, or extent; additional or further (used in comparisons).",
    "In greater amount, measure, or degree; exceeding the given limit or standard.",
    "At or to a greater time, distance, or degree.",
    "Greater in number, amount, size, or value.",
    "An increased or additional quantity of something.",
    "A larger or higher proportion of something.",
    "On or at a place further away from the starting point."
  ],
  "moribund": [
    "Showing little sign of life, vitality or activity; dying, declining, or in a state of decay.",
    "(In biology) Almost dead but not yet entirely so, like a dying organism.",
    "An organization, system or society that is in a state of decline and likely to fail."
  ],
  "morose": [
    "Characterized by a brooding, gloomy, or sulky mood.",
    "Depressed, discontented, or moody in temperament.",
    "Expression of one's melancholy or unhappiness through a frowning, somber demeanor."
  ],
  "mortal": [
    "A human being or any living organism that is subject to death, especially a person regarded in terms of their earthly existence rather than their spirit or soul.",
    "Used to describe something likely to cause or result in death; fatal.",
    "In mythology and folklore, a god or supernatural being who can die, unlike an immortal."
  ],
  "mortality": [
    "The state of being susceptible to death, applying to living organisms, such as humans, animals or plants. It includes natural causes, accidents, and disease.",
    "The number of deaths in a given population during a specific time period, usually expressed as a rate per thousand people. This can be used to compare different populations or the same population over time.",
    "The concept of dying or death in general. Mortality is often used in discussions about end-of-life care, hospice services, and palliative care."
  ],
  "mortar": [
    "A hollow vessel with a wide mouth, used to grind, crush, or pulverize substances by rotating a pestle or similar instrument within it.",
    "A heavy artillery piece designed for firing large, explosive shells at high trajectories and distances, typically mounted on a wheeled carriage.",
    "A construction tool consisting of a bowl-shaped container that holds cement or other materials, with a revolving drum at the bottom to mix the contents."
  ],
  "mortgage": [
    "An agreement between a borrower and a lender in which the borrower pledges their property as collateral to secure a loan, usually for the purpose of purchasing a home or real estate, with the understanding that the property can be foreclosed upon if the loan is not repaid according to the terms specified."
  ],
  "mortified": [
    "Deeply embarrassed, ashamed, or humiliated due to one's own actions or someone else's remark.",
    "Physically destroyed or killed. (This definition is not commonly associated with the word 'mortified' in a student dictionary.)",
    "Relating to or being the cause of death (as in medicine and pathology). (This definition is not commonly associated with the word 'mortified' in a student dictionary.)"
  ],
  "mortify": [
    "To cause someone to feel deep shame, embarrassment, or humiliation.",
    "To destroy or put an end to something, especially by a natural process.",
    "To humble oneself in order to show reverence, respect, or submission to God.",
    "To suppress or overcome the desires of the body, especially in religious contexts."
  ],
  "mosaic": [
    "A decorative design made by arranging small pieces of colored glass, stone, or other materials in patterns on a surface.",
    "A pattern formed by the arrangement of various colors, shapes, or components to create a unified whole.",
    "In genetics, the complete set of genes or genetic material of an organism, resulting from the combination of two parents' genetic material."
  ],
  "moss": [
    "A plant that grows in damp places, has tiny leaves and doesn't have flowers or seeds; it can grow on trees, rocks, soil, and other surfaces.",
    "A soft green material made from wool, used to cover furniture, floors, etc., especially in the 1970s."
  ],
  "most": [
    "Used to refer to more than half of a group or amount; majority.",
    "In greater degree, extent, or quantity; to a higher degree or extent.",
    "To the greatest possible extent or degree; completely.",
    "(Of two or more things) one after another or in turn; each in succession.",
    "At or to the highest point or level; at the utmost or extreme limit."
  ],
  "mote": [
    "A small piece of matter, such as dust or a grain, that floats in the air or is suspended in a liquid.",
    "A very small particle or fragment.",
    "In optics, an imperfection or defect in a lens or other optical element.",
    "The small main central room of a church or cathedral.",
    "A small division of a larger society, organization, or group, often with its own identity and function within the whole."
  ],
  "moths": [
    "Insects belonging to the order Lepidoptera, characterized by their nocturnal habits and wings covered with tiny scales; they are often found around lights and can damage fabrics and clothing.",
    "(Informal) Someone who is slow or sluggish in mental or physical agility, often used in reference to elderly people."
  ],
  "motion": [
    "The act of moving, going, or proceeding from one place to another",
    "A proposal made to a committee or assembly for their consideration and decision",
    "An organized group of people working together to promote or achieve a particular aim",
    "A series of movements or actions in a particular direction, especially by an object such as the hands or limbs",
    "The idea or feeling of being moved emotionally",
    "A formal written request submitted to an organization or court for a specific action to be taken",
    "An uninterrupted procession or flow of something, like water or traffic"
  ],
  "mottled": [
    "Having a speckled, blotchy, or irregular pattern of color or texture.",
    "Covered with patches of different colors or tones that are not uniformly distributed.",
    "Marked by variations in color or tone, often creating a patchwork effect.",
    "Characterized by an uneven distribution of color or texture on the surface."
  ],
  "mound": [
    "A heap or a raised mass of earth, sand, stones, or other material; often created naturally by erosion or humanly made for various purposes like burial sites, protection, etc.",
    "A small hill or elevated area formed by natural accumulation or human construction.",
    "In sports, particularly baseball and golf, a raised portion of ground on which the ball is pitched or teed off, respectively."
  ],
  "mountain": [
    "A large natural elevation of the earth's surface, usually having a peak or summit, that rises sharply above its surroundings and is higher than a hill.",
    "(In geology) A landform created by tectonic processes, such as the collision of two tectonic plates, resulting in a raised area of the earth's crust.",
    "(In cartography) A symbol or feature on a map indicating an elevated topographical region.",
    "(In mountaineering) A high rocky formation that can be climbed, typically one that is part of a larger mountain range."
  ],
  "mournful": [
    "Expressing, characterized by, or causing deep sadness: a mournful tone in her voice.",
    "Marked by sorrow or grief; tragic: mournful events in the news.",
    "Sad and melancholy in appearance or manner: a mournful dog waiting for its owner."
  ],
  "movable": [
    "Able to be moved, either by oneself or by a machine; not fixed in place. For example, furniture can be described as movable if it is on wheels or can easily be lifted and carried to a new location.",
    "Capable of being changed or adjusted, especially regarding one's thoughts, opinions, or beliefs. This definition emphasizes the idea that someone can change their stance on an issue or adapt to new situations."
  ],
  "move": [
    "Change position or location of something, either by physically moving it or causing it to move itself.",
    "Propose or introduce a motion for consideration or debate in a legislative assembly or other formal body.",
    "Make a decision and act accordingly; proceed.",
    "Induce someone to take an action by giving them a reason or motive, usually with the aim of achieving something.",
    "Transfer (goods) from one place to another for sale or distribution.",
    "Perform a sequence of movements in a game or sports activity.",
    "Change direction or course (of a conversation or event)."
  ],
  "movement": [
    "A series of actions taken to achieve a particular goal, especially one related to social change or political activism.",
    "The act of changing location or position by using physical force, such as walking, running, or driving.",
    "A shift or trend in public opinion or fashion that influences people's beliefs or choices.",
    "In mathematics and physics, a measure of how much an object has changed its position over time, typically expressed as distance divided by time (speed).",
    "In art, the apparent motion of visual elements within a static image, created through techniques such as perspective or parallax.",
    "A collection of related words in a language that share common grammatical properties, such as verb conjugations or noun declensions."
  ],
  "mow": [
    "Cut (grass, hay, etc.) with a mower to make it shorter.",
    "Cut (grass, hay, etc.) using shears or similar cutting tool by hand."
  ],
  "muddle": [
    "Mix or confuse (something) thoroughly, making it difficult to distinguish or understand.",
    "Perform poorly or in a confused manner due to disorganization or confusion.",
    "Move clumsily or in a muddled way.",
    "Cause to become mixed up or confused.",
    "A state of confusion or disorder."
  ],
  "muddled": [
    "Blurred, confused, or mixed together in a way that makes it hard to see or understand clearly.",
    "Having a confused or muddled state of mind, making it difficult to think or make decisions clearly.",
    "A mixture of different liquids or substances that are not easily distinguished from one another.",
    "In the context of cocktails or drinks, the dilution or lack of clarity due to ice melting or other factors."
  ],
  "muddy": [
    "Having a clouded, unclear, or indistinct appearance due to dirt, dust, or other particles suspended in the air or water.",
    "Covered with or containing mud; having a mixture of earth and water on one's clothes, skin, or surroundings.",
    "Involving or characterized by confusion, uncertainty, or ambiguity, often in a discussion or situation.",
    "Relating to or describing a type of art style that combines various elements and techniques without a clear focus or theme."
  ],
  "muffin": [
    "A small, round, sweet or savory cake typically baked in a muffin tin with a cup-shaped compartment."
  ],
  "muffle": [
    "To reduce or lessen a sound, such as by covering or dampening something that produces noise.",
    "To cover or protect (a metal surface) from oxidation by applying a protective coating.",
    "In heraldry, to cover or veil (an object or person)."
  ],
  "muffler": [
    "A device used to reduce noise, especially in vehicles, by silencing engine exhaust sounds.",
    "A piece of clothing worn around the neck to keep the throat warm, similar to a scarf."
  ],
  "mug": [
    "A person's face, typically human, as in referring to someone's facial features",
    "An open-top container for holding a drink, often made of ceramic or glass",
    "To rob or steal from someone by force, especially with violence or intimidation",
    "A heavy, usually large cup used in various games or sports for holding liquid",
    "In slang, a person's face seen on a video call or online chat."
  ],
  "mugginess": [
    "A state of being damp, humid, and oppressive, usually associated with warm weather conditions.",
    "An unpleasant feeling caused by high humidity levels in the atmosphere.",
    "The sensation experienced when the air is heavy with moisture, making it uncomfortable to breathe or move around."
  ],
  "mull": [
    "To carefully think about something, typically in order to make a decision or solve a problem.",
    "To mix or blend ingredients together by repeatedly stirring or folding.",
    "In the context of wine-making, to leave crushed grapes and juice to ferment and develop flavor over an extended period of time.",
    "In card games, to redraw or replace cards in one's hand without immediately playing them."
  ],
  "multifarious": [
    "Consisting of or containing many different elements, aspects, or forms; diverse; varied; numerous.",
    "Having a wide variety of elements or aspects that are not easily classified into one category or type; complex."
  ],
  "multiple": [
    "More than one; many, numerous.",
    "A number formed by multiplying two numbers together.",
    "A product of a mathematical operation involving multiplication.",
    "Something having several parts or aspects.",
    "A group or set of things that have the same characteristics.",
    "In art and music, an image or sound repeated at regular intervals to create a pattern or effect.",
    "(In mathematics) An integer n greater than 1 such that n2 is equal to m for some integer m greater than 1; a prime number if it has exactly two divisors, itself and 1; and a composite number if it has more than two divisors."
  ],
  "multiplicity": [
    "The quality of being many or numerous; a large number of something. For example, \"The store had a multiplicity of colors in their paint section.\"",
    "A state or condition where there are multiple possibilities or alternatives. For example, \"He faced a multiplicity of choices for his future career.\"",
    "The state of being numerous, diverse, or varied; an abundance. For example, \"The city had a multiplicity of cultural backgrounds represented in its population.\""
  ],
  "multiply": [
    "To increase the number of items in a collection by adding more elements to it. For example, \"We need to multiply our vocabulary to become better communicators.\"",
    "To calculate the result of a mathematical operation that involves adding a certain number to itself a specific number of times. For instance, \"If we multiply 5 by 3, we get 15 (5 + 5 + 5).\""
  ],
  "multitudinous": [
    "Characterized by a large number of people, things, or occurrences; numerous, abundant, or plentiful."
  ],
  "mumble": [
    "To speak in a low, indistinct, or unclear manner, often making it difficult for others to understand what is being said.",
    "To mumble can also refer to an action of muttering or whispering words, often done out of embarrassment, shyness, or when trying to avoid being overheard by others.",
    "In the context of computer programming or technical language, a mumble can refer to a glitch or error in speech recognition software that causes it to misinterpret what is being said and respond incorrectly."
  ],
  "munch": [
    "To chew food with one's mouth in a noisy manner, often referring to the sound made while eating something crunchy.",
    "To eat something, especially snacks or chips, in a casual and informal manner.",
    "(Computing) To execute a file or program by running it on a computer system."
  ],
  "mundane": [
    "Ordinary, routine, or commonplace; not interesting or exciting.",
    "Relating to everyday affairs or things.",
    "Not belonging to the spiritual or intellectual realm; material or physical.",
    "Lacking creativity or imagination."
  ],
  "munificence": [
    "Generosity in giving or showing kindness; displaying large-hearted or openhanded bounty or benevolence, often through donations of money, time, or resources.",
    "A quality of being very kind and generous, especially towards others.",
    "An act or instance of giving or bestowing something valuable, such as money, property, or help; a gift given with generosity.",
    "The quality or characteristic of something that is large or generous, often in amount, scale, or extent."
  ],
  "munificent": [
    "Generously giving of one's time, resources, or money; displaying great generosity or bounty.",
    "A person who is known for their generous and magnanimous acts or donations.",
    "Characterized by large-heartedness, especially in the giving of gifts or assistance."
  ],
  "murmur": [
    "A soft, low sound like that made by a flowing stream or rustling leaves.",
    "A whispering or gentle sound heard in speaking, especially one that is hard to understand because of its quietness.",
    "A faint or unclear sound made by the heart or blood vessels.",
    "An expression of sympathy or commiseration; also, a murmuring or rustling sound.",
    "(Medical) A soft, continuous sound heard with a stethoscope over a body organ or tissue, caused by turbulent blood flow."
  ],
  "muscle": [
    "A soft tissue in animals, including humans, that has the ability to contract and produce force and movement.",
    "The primary function of muscles is to support movement by transforming chemical energy into mechanical energy.",
    "Muscles are composed of long, slender cells called muscle fibers, which are organized into bundles called fascicles.",
    "Muscles are classified into three main types based on their structure and function: skeletal (voluntary) muscles, cardiac muscles, and smooth muscles.",
    "Skeletal muscles are attached to bones by tendons and are responsible for body movements such as walking, running, and lifting objects."
  ],
  "muse": [
    "A person or agency that is a source of inspiration for an artist, writer, or thinker.",
    "The act of thinking deeply or seriously about something; contemplation.",
    "In Greek mythology, a daughter of Mnemosyne and Zeus who served as the goddess of inspiration in literature, science, and the arts."
  ],
  "museum": [
    "A building that houses collections of items of historical, artistic, or scientific interest open to the public for viewing and study.",
    "A place where objects of historical, artistic, or cultural significance are kept on display for public view."
  ],
  "musician": [
    "A person who plays musical instruments skillfully, especially as a profession or hobby.",
    "An individual engaged in composing, performing, and creating music."
  ],
  "must": [
    "Used to express necessity, obligation, or requirement in a polite way. For example, \"You must wear a mask in public places.\"",
    "Used to describe something that is necessary or inevitable in a particular situation. For instance, \"The car must be driven carefully on slippery roads.\"",
    "(In logic and mathematics) A word used to indicate that a statement is necessarily true under certain conditions. For example, \"If it rains today, we must postpone the picnic.\""
  ],
  "mutation": [
    "A change in DNA sequence, resulting in variations within a gene or between chromosomes.",
    "A variation in genetic makeup that may be inherited by offspring and become part of the species' gene pool.",
    "A sudden transformation in an organism that gives it unique abilities or characteristics not previously seen in its kind."
  ],
  "mute": [
    "A person who is unable to speak, typically due to a physical condition or injury.",
    "An animal or bird that has been rendered incapable of making noise or sound.",
    "In music, a device used to silence or reduce the volume of specific instruments in an ensemble.",
    "In theater or film, a character who remains silent throughout the performance or narrative.",
    "A switch on audio equipment, such as a recording device or loudspeaker, that reduces or cuts off sound completely."
  ],
  "muzzle": [
    "The front part of an animal's face, including the nose and mouth.",
    "A device used to cover an animal's mouth, often used to prevent biting or barking.",
    "A gun's barrel or the opening at the end of a weapon from which projectiles are expelled."
  ],
  "my": [
    "Possessive determiner: Indicates ownership, association, or possession (e.g., \"My car is in the driveway.\")",
    "Possessive pronoun: Replaces a noun to indicate that it belongs to the speaker (e.g., \"That book is mine,\" means \"that book is owned by me.\")."
  ],
  "myriad": [
    "A very large number or quantity, typically innumerable or countless.",
    "A great many; numerous.",
    "(In classical antiquity) a Greek term for ten thousand.",
    "A multitude of various things; a vast array.",
    "(In literature and rhetoric) an exaggerated or emphatic way of expressing an indefinite large number."
  ],
  "mysterious": [
    "Difficult to understand or explain; enigmatic.",
    "Involving or capable of involving strange or supernatural influences; occult.",
    "Of, relating to, or suggestive of mystery or secrecy; mysterious.",
    "Causing wonder or admiration by being unfamiliar or unexpected; fascinating.",
    "Characterized by a lack of clarity or definition; obscure."
  ],
  "mystery": [
    "A situation or event that is difficult to understand, explain, or solve due to being complex, obscure, or unclear; a puzzle or enigma.",
    "A person, thing, or situation whose true nature, meaning, or motives are unknown or not easily explained.",
    "Something that is kept secret and not revealed to others.",
    "A story in which the ending or solution is kept hidden until it is revealed at the end."
  ],
  "mystify": [
    "To make something difficult to understand, confusing, or puzzling.",
    "To baffle or perplex someone with a problem or question that cannot be easily solved or answered.",
    "To create an atmosphere of mystery or uncertainty around something."
  ],
  "mystifying": [
    "Causing great confusion, bewilderment, or uncertainty; hard to understand.",
    "Involving or suggesting a mystery or enigma; puzzling or intriguing."
  ],
  "myth": [
    "An widely held but false belief or idea.",
    "A person's or group's interpretation of an event or situation that may not necessarily reflect the objective truth."
  ]
}