{
  "nail": [
    "A small, thin piece of metal with a pointed end, hammered into wood to hold something in place, or driven through a soft material such as leather.",
    "To strike hard and accurately; to hit exactly or on target.",
    "To secure or fasten something tightly, especially by striking with force.",
    "A person or thing that is very important or successful.",
    "A slender piece of metal or other material used in various constructions and crafts."
  ],
  "naivete": [
    "Simplicity or lack of experience in dealing with people or situations, often resulting from an innocent lack of awareness or understanding.",
    "The quality of being free from worldly wisdom, cynicism, or sophistication; guilelessness."
  ],
  "name": [
    "A word or set of words by which a person, place, or thing is known, addressed, or referred to.",
    "To give a name to something or someone.",
    "To call someone by their name as a greeting or acknowledgement.",
    "A list of people or items."
  ],
  "nap": [
    "A brief period of sleep, typically during the daytime or in a quiet, private place.",
    "A short rest or respite from activity, often involving closing one's eyes and relaxing.",
    "In fabrics, the raised fibers on the surface that give it texture and appearance; also known as \"nap\" of a fabric."
  ],
  "nape": [
    "The back of a person's neck, between the shoulder blades and the base of the skull.",
    "A part of an animal's body that corresponds to the human nape, such as the back of a dog's neck.",
    "In botany, the junction where the stem joins the roots in a plant."
  ],
  "narcissistic": [
    "Characterized by an excessive interest in or admiration of oneself; self-centered, self-absorbed, or vain."
  ],
  "narcotic": [
    "A substance that is used to relieve pain, typically by inducing unconsciousness or causing a stupor.",
    "A drug that acts on the central nervous system and produces sleepiness, reduced physical activity, or reduced sensitivity to pain.",
    "A medicine or drug that causes deep sleep and is often used in surgery.",
    "A substance that is addictive and can cause dependence when abused or overused."
  ],
  "narrow": [
    "Narrow refers to something that is not wide, such as a thin path between two tall buildings.",
    "It can also describe a small gap or opening, like the space between two closely spaced objects.",
    "In addition, it can denote a limited or confined area, as in a narrow street.",
    "The term 'narrow' is sometimes used to characterize a specific time range or scope, as when speaking of a narrow time frame for completing a task.",
    "It can also refer to something that is difficult or challenging, as in a narrowly missed opportunity.",
    "In mathematics, 'narrow' is used to describe a set with limited data points."
  ],
  "narrowed": [
    "Narrowed: reduced in scope, focus or range.",
    "Narrowed: constricted or lessened in width, space or extent.",
    "Narrowed: limited or restricted in a specific area or subject matter.",
    "Narrowed: made more specific, precise, or defined in nature."
  ],
  "nationalities": [
    "The characteristics of a particular nation or country, such as its language, culture, customs, and traditions.",
    "The citizens of a specific country, often used to refer to a group of people who share these characteristics.",
    "A term used to describe the different groups of people from different countries or regions, based on their cultural or ethnic backgrounds."
  ],
  "nationality": [
    "The state, nation, or country to which a person owes allegiance or by which they are governed; the citizenship of an individual.",
    "A group of people with common ancestry, culture, and history who share the same national identity and allegiance to a particular country.",
    "An attribute that distinguishes the inhabitants of a nation from those of other nations."
  ],
  "naturalist": [
    "A person who studies nature, especially plants and animals, in their natural environments.",
    "One who is deeply interested in or closely observes the details of nature.",
    "An expert in a particular area of biology or ecology, often focusing on fieldwork to gain insight into various phenomena."
  ],
  "naughty": [
    "Adjective describing a child who behaves in a disobedient, mischievous or misbehaved manner.",
    "Adjective used to describe someone who acts improperly, impolitely or in a way that breaks social norms."
  ],
  "nausea": [
    "A feeling of sickness or queasiness in your stomach that may make you want to vomit.",
    "A dislike or aversion for something, often due to its unpleasant nature.",
    "In medicine, nausea can also refer to an uncomfortable sensation of the stomach caused by various factors such as motion sickness, overeating, pregnancy, or illnesses."
  ],
  "nauseating": [
    "Causing a feeling of disgust, sickness, or distaste; repulsive.",
    "Producing an urge to vomit; causing nausea.",
    "So unpleasant as to cause disgust or discomfort; repellent.",
    "(Informal) Extremely annoying or tiresome; intolerable."
  ],
  "nauseatingly": [
    "In a manner that causes disgust or sickens, to such an extent that it is overwhelming and unpleasant; causing nausea or revulsion."
  ],
  "nauseous": [
    "Causing feelings of nausea, sickness, or disgust.",
    "Able to cause feelings of nausea, sickness, or disgust.",
    "Of the nature of causing feelings of nausea, sickness, or disgust.",
    "Characterized by something that causes feelings of nausea, sickness, or disgust."
  ],
  "nautical": [
    "Pertaining to ships, sailing, or maritime activities.",
    "Involving or related to sea navigation or marine transportation.",
    "Characteristic of, or found in, a seafaring environment.",
    "Measured or calculated using units specific to nautical contexts (e.g., knots for speed)."
  ],
  "near": [
    "Close in distance, location, or time: \"I live near the store.\"",
    "In a close relationship or association: \"She is near and dear to my heart.\"",
    "Almost but not completely: \"It's near impossible to achieve.\"",
    "In proximity or vicinity: \"The incident occurred near the construction site.\""
  ],
  "nebulize": [
    "To create a fine mist or spray, typically by using a device called a nebulizer. This is often used to administer medication in a form that can be easily absorbed into the lungs."
  ],
  "nebulosity": [
    "A property of an object being cloudy, vague, or indistinct in appearance.",
    "The state or quality of something being obscure or unclear in its meaning or purpose.",
    "The characteristic of having a blurred or hazy appearance, often resulting from moisture or poor lighting conditions."
  ],
  "nebulous": [
    "Unclear, vague, or not precisely defined; difficult to understand or grasp.",
    "Indistinct, hazy, or blurred in appearance or outline, like a nebula in space.",
    "Having no definite form or shape; ill-defined or indeterminate."
  ],
  "nebulousity": [
    "The state of being unclear, ambiguous, or vague; a lack of definite meaning or focus."
  ],
  "nebulously": [
    "In a way that is vague, unclear, or difficult to understand; hazy or indistinct.",
    "Resembling a nebula, a diffuse cloud of gas and dust in space.",
    "(In astronomy) relating to, or denoting, any type of stellar object whose boundary is not clearly defined.",
    "(In meteorology) referring to a type of cloud that has a formless, indistinct appearance."
  ],
  "nebulousness": [
    "Vagueness, indistinctness, or lack of clarity in an idea, concept, or situation.",
    "Diffuseness or obscurity in terms of meaning or expression.",
    "In astronomy, a nebulous appearance or characteristic, referring to the cloud-like appearance of celestial objects."
  ],
  "necessities": [
    "Essential items required for survival such as food, water, shelter, and clothing.",
    "Basic needs or requirements that must be met to maintain a healthy and comfortable life.",
    "Necessary items needed for daily living, including household supplies and personal care products."
  ],
  "necessity": [
    "An object, thing, or situation that is needed for something to happen, be done, or exist.",
    "A condition that makes it necessary for someone to do something or for something to happen; a need.",
    "Something required by law, rules, or regulations; a compulsory measure."
  ],
  "needle": [
    "A slender, pointed piece made of metal, bamboo, or another material, used for sewing by passing through fabric and holding thread or yarn in place as it is stitched.",
    "A thin, sharp instrument used to inject medicines, vaccines, or other fluids into the body, especially in medical procedures.",
    "An instrument used for drawing blood from a vein or capillary, typically with a small tube and an attached vial for collecting the sample.",
    "In geology, a thin, sharp piece of rock that forms the central part of a conical hill or mountain called a volcanic cone, such as those found in areas of active volcanism.",
    "A component of certain measuring devices, like thermometers and compasses, which points to indicate readings on a graduated scale."
  ],
  "nefarious": [
    "Malicious, wicked, or having criminal intentions.",
    "Characterized by dishonest or unlawful actions.",
    "Involved in or indicative of evil or wrongdoing.",
    "Sinister and villainous in nature or intent."
  ],
  "negative": [
    "Characterized by a pessimistic or unfavorable view or attitude; showing or expressing disapproval, criticism, or discouragement.",
    "Denoting or relating to an amount or value that is less than zero; below the level of zero.",
    "In photography, a film or print in which the image appears reversed and darker areas appear lighter.",
    "Of or relating to a test result that indicates the absence or lack of something being tested for.",
    "A person who declines to support an idea or proposal, or who argues against it."
  ],
  "negligence": [
    "Failing to take proper care or attention in doing something, resulting in harm or damage to oneself or others.",
    "The act of not giving sufficient thought or effort to a task or responsibility, leading to a mistake or oversight.",
    "In law, the failure to exercise the standard of care that a reasonable person would do under similar circumstances, which results in damages or injury to another person."
  ],
  "negotiate": [
    "To engage in discussions or negotiations in order to reach a mutually beneficial agreement, usually involving two or more parties.",
    "To pass safely through a difficult or complicated situation by using skill and care.",
    "To arrange the terms of a deal or contract by discussing and reaching a compromise between the involved parties."
  ],
  "neophyte": [
    "A person who is inexperienced, new, or has recently joined a particular group, religion, field, etc., often still learning the basics.",
    "In botany, a young plant, especially a new shoot or leaf."
  ],
  "nepotism": [
    "The practice of appointing relatives to positions of power, authority, or influence, especially in a way that is unfair or improperly favors those individuals."
  ],
  "nepotistic": [
    "Involving favoritism towards relatives in appointments, promotions, or other advantages within an organization, often leading to unfair treatment of others who are more qualified."
  ],
  "nerve": [
    "A slender threadlike structure that conducts nerve impulses between the brain, spinal cord, and muscles, glands, or organs in the body; a component of the nervous system.",
    "An emotional sensitivity or tension caused by a particular situation, event, or person.",
    "A feeling of unease or apprehension often related to social situations or public speaking.",
    "To unsettle or disturb someone's composure or confidence.",
    "(In computing) A pathway through which data travels between components of a computer system."
  ],
  "nerves": [
    "A group of slender threads that transmit signals from the brain and spinal cord to other parts of the body, or vice versa. These are part of the nervous system, allowing for communication between the body and the brain.",
    "A feeling of anxiety or tension, often caused by a stressful situation or event. This can be due to the activation of the body's fight-or-flight response, which is regulated by the nervous system."
  ],
  "nervous": [
    "Characterized by feelings of anxiety, worry, or unease.",
    "Of or relating to the nervous system or its functions.",
    "Easily distracted or upset; sensitive and easily agitated.",
    "Marked by restlessness or apprehension; anxious."
  ],
  "nervously": [
    "In a way that shows you are anxious, worried, or uneasy about something; displaying signs of nervousness such as fidgeting, shaking, sweating, or biting nails.",
    "Characterized by being easily startled or disturbed, often due to one's emotions or temperament."
  ],
  "nest": [
    "A place where birds or other animals lay their eggs and raise their young, typically made of sticks, leaves, or other materials gathered by the parents.",
    "A cosy, comfortable, or sheltered place; a snug retreat.",
    "A group of closely related computer programs or files that work together as a single entity."
  ],
  "neurosurgery": [
    "The branch of medicine that involves performing surgery on the brain, spinal cord, and other parts of the nervous system."
  ],
  "neutral": [
    "In a state of balance or equality; neither good nor bad, positive nor negative.",
    "A color that is a combination of equal parts of two other colors, usually resulting in a grayish hue.",
    "An object or substance that does not interact chemically with other substances, acting as neither an acid nor a base.",
    "In politics, a position that avoids taking sides or expressing support for any particular ideology.",
    "In the context of electrical systems, a conductor that has no voltage and is not connected to either power supply or ground."
  ],
  "new": [
    "Not existing before; recently brought into existence or experience, or coming into use for the first time.",
    "Different from anything known or experienced before; novel or unusual.",
    "Having been refurbished, repaired, or renovated, so as to appear fresh, different, or improved.",
    "Freshly printed, bound, or published; as a new edition of a book.",
    "Recently made or produced; having undergone a transformation into something more modern or advanced."
  ],
  "newlyweds": [
    "People who have recently gotten married, often just celebrating their wedding day or honeymoon.",
    "A term used to describe a couple in the early stages of their marriage, as they navigate their new life together and build a foundation for their future."
  ],
  "newsstand": [
    "A place where newspapers, magazines, and other periodicals are sold to the public.",
    "A location where a variety of reading materials can be purchased, often found in public areas or transportation hubs.",
    "An establishment that offers current news publications for sale, typically in printed form."
  ],
  "newtonian": [
    "Pertaining to a physical law or phenomenon described by Sir Isaac Newton, who was an influential scientist in physics and mathematics during the late 17th century.",
    "Characteristic of objects or systems that follow Newton's laws of motion, which describe the relationship between an object's mass, speed, and acceleration due to applied forces."
  ],
  "nibble": [
    "To take small bites, particularly when eating something delicious or when someone is too shy to eat directly.",
    "To interact with a computer file by reading or modifying it in small amounts, typically in reference to computer networks and data transfer protocols.",
    "To engage in the activity of hacking, especially to gain unauthorized access to a computer system.",
    "(Slang) To exchange information, messages, or files with someone through electronic communication, often implying that it is secretive or not authorized."
  ],
  "niche": [
    "A specialized position, role, or activity in a particular area or field, which appeals to a small but specific section of the market or audience.",
    "An recessed space in a wall, especially one designed to hold a statue or other decorative object.",
    "In biology, a specific ecological niche refers to the place an organism occupies in its environment with regard to feeding habits, habitat, and other species it interacts with."
  ],
  "nickname": [
    "A familiar or humorous name used by a person's friends, family, or associates instead of their given or formal name.",
    "A shortened form of a person's given name or a name based on the person's appearance, character, or occupation."
  ],
  "night": [
    "The period of darkness between sunset and sunrise, during which the stars, moon, and planets are visible in the sky.",
    "A time of night or a particular hour of darkness.",
    "The hours from evening to morning, traditionally reckoned as beginning at dusk and ending with dawn.",
    "The dark portion of the day-night cycle; the absence of sunlight."
  ],
  "nimble": [
    "Quick and light in movement or action; agile, lively, or spry.",
    "Easily managed or dealt with; manageable or manageable.",
    "Capable of quick changes or reversals; flexible or adaptable.",
    "Clever or ingenious, especially in a way that involves deception or trickery."
  ],
  "nine": [
    "The cardinal number that is the sum of eight and one, or a numeral indicating this number.",
    "A symbol for this number in various scripts such as Arabic (٩), Devanagari (नو), or Roman Numerals (IX).",
    "One less than ten or two more than seven.",
    "In games or competitions, coming in ninth place or ranking."
  ],
  "nip": [
    "A sharp bite or sting, as from cold weather or a sharp object.",
    "To pinch or grasp briefly between the fingers or teeth, as to correct behavior.",
    "To cut off or remove something by cutting.",
    "An act of biting off or cutting off a small piece."
  ],
  "nirvana": [
    "A state of ultimate peace, happiness, and freedom from suffering, often associated with Buddhist philosophy and spiritual goals.",
    "In Hinduism and Buddhism, the ultimate liberation from the cycle of birth, death, and rebirth (samsara), attained by achieving enlightenment or moksha.",
    "A state of extreme relaxation or contentment, used metaphorically in everyday language."
  ],
  "no": [
    "A single-syllable English word that expresses negation, denial, refusal, or disapproval. It is commonly used to indicate the absence of something, reject an offer, or disagree with a statement. For example, \"Do you want more ice cream?\" \"No, I'm full.\""
  ],
  "noctambulist": [
    "A person who is active or most productive during nighttime hours, especially one who habitually works or engages in activities during the night."
  ],
  "nocturnal": [
    "Active or occurring during the night, especially at nighttime.",
    "Living or adapted to life in darkness or at night.",
    "Happening or existing during the night.",
    "Belonging to or characteristic of the night.",
    "Used for, relating to, or indicating nocturnal activities or creatures."
  ],
  "noise": [
    "Unwanted sound, often loud and chaotic, that interferes with hearing important sounds or speech.",
    "Random fluctuation of electrical signals in communication systems, that may degrade the quality of information transmission.",
    "In mathematics, a random variable whose probability distribution does not depend on previous outcomes or values."
  ],
  "noisy": [
    "Loud and disturbing sound.",
    "Overcrowded; packed with people or things.",
    "Unruly or disorderly behavior.",
    "Full of activity or commotion."
  ],
  "nomad": [
    "A person who travels from one place to another, usually because they need to find food and water for themselves or their animals, often moving in a specific pattern across the same region or area over time.",
    "A group of people, animals, or machines that move from one location to another without having a fixed home base or permanent residence."
  ],
  "nomenclature": [
    "A system of classification, identification, or labeling through the use of specific names or terms for objects, concepts, or categories.",
    "The list or grouping of names given to something, such as a set of rules or conventions that define how to name things in a particular field, subject, or profession."
  ],
  "nonchalance": [
    "Casual indifference, especially when trying to impress or persuade others.",
    "A calm, unconcerned attitude, even in the face of danger or important matters.",
    "An appearance of not caring about something or someone, often as a way to appear cool or detached."
  ],
  "nonchalant": [
    "Showing little concern, anxiety or excitement about something.",
    "Displaying a casual unconcern in response to an important matter.",
    "Being calm and untroubled in the face of danger or difficulties.",
    "Having a lack of interest in or enthusiasm for something."
  ],
  "nonchalantly": [
    "With a casual, carefree, and unconcerned manner; without showing any excitement or interest, as if something is not important or significant."
  ],
  "nonconformity": [
    "Refusal to conform, follow, or agree with established norms, rules, or standards.",
    "Act of deviating from a standard, pattern, or expectation.",
    "A state or quality of being unlike others in beliefs, behavior, or appearance.",
    "Behavior or action that is different from what is considered normal or expected within a group or society."
  ],
  "nonpareil": [
    "Unmatched or unsurpassed in quality, excellence, or desirability.",
    "A type of cherry tree known for its profuse blooming and attractive flowers.",
    "An adjective derived from the French word \"incomparable,\" meaning not to be compared or equaled with others."
  ],
  "nor": [
    "Not; used to form negatives in certain constructions (e.g., \"I didn't go\" or \"She isn't home\").",
    "(in logic) not both (of the two propositions joined by nor)."
  ],
  "normal": [
    "Representing a typical instance or example of something, as opposed to being unusual or extraordinary; average, usual, or standard.",
    "Conforming to the common type, standard, or level; regular, customary, or expected.",
    "Consistent with the typical characteristics of a person, society, or group; not deviant, abnormal, or atypical; normal, mainstream, or conventional.",
    "Not affected by a particular condition, disease, or disability; healthy, sound, or well-functioning; normal, unaffected, or unimpaired."
  ],
  "north": [
    "The direction that lies opposite to south, where the sun is located at noon during the summer solstice in the Northern Hemisphere.",
    "A cardinal point of a compass representing this direction.",
    "An area or region situated in or toward the north, such as \"the North Pole.\"",
    "A term used to refer to someone or something coming from or living in the northern part of a country or region, like \"a northerner\" or \"Northern culture.\""
  ],
  "nose": [
    "The front part of a person's face, which is used to smell and contains the nostrils for breathing.",
    "A protruding or pointed part on an animal's face that is used to smell.",
    "A point or projection on an object or surface.",
    "In sports, the line that separates one team's half of the field from the other team's half.",
    "In finance and commerce, a term referring to the difference between the buy price and sell price of a security or commodity."
  ],
  "nostalgia": [
    "A sentimental longing or wistful affection for a period or place with happy personal associations, typically one from the more remote past.",
    "An inexplicable sense of homesickness, especially when regarded as resulting from being uprooted as a child."
  ],
  "nostalgic": [
    "Experiencing a sentimental longing or wistful affection for a period in the past, often accompanied by a sense of loss.",
    "Associated with a bittersweet yearning for a time or place that is no longer present or unattainable.",
    "Characterized by memories or thoughts focused on events, people, or places from one's past, often resulting in feelings of happiness mixed with sadness."
  ],
  "not": [
    "Not serving to nourish; inapplicable or unsuitable for sustenance.",
    "Having no effect, influence, bearing, or relevance; not influencing, affecting, bearing, or relating.",
    "Not adhering; not sticking; not fastened."
  ],
  "notable": [
    "Worthy of attention or notice, significant, or conspicuous; notable for a particular quality or achievement.",
    "Well-known or famous in a specific field or area.",
    "A person or event that stands out and is worthy of mention or recognition."
  ],
  "notch": [
    "A shallow V-shaped cut, indentation, or groove made in a surface, often to create a specific shape or function.",
    "A small opening or gap between two objects or parts, such as the space between the teeth of a saw.",
    "In music, the difference in pitch between two adjacent notes or tones.",
    "In computer programming, a function that temporarily stores data for later use or comparison."
  ],
  "note": [
    "A brief written or spoken statement about something important, especially one that is part of an official record.",
    "A symbol or sign used in music to indicate the pitch and duration of a sound.",
    "An amount of money owed or due, often on a short-term basis.",
    "To take notice of or pay attention to something; observe.",
    "In art, to copy an image closely, especially for study purposes."
  ],
  "noteworthy": [
    "Deserving of attention or recognition; notable or significant.",
    "Worthy of mention, note, or remark; remarkable or outstanding.",
    "Important enough to be noted or remembered; memorable.",
    "Of such quality or interest that it warrants special notice or attention; exceptional."
  ],
  "nothing": [
    "An absence of substance, matter, or significance; nothingness.",
    "A state or condition in which there is no existence or activity; vacuity.",
    "Something that has no value, importance, or effect; an insignificant item.",
    "To make something unimportant, worthless, or non-existent by removing its meaning, significance, or value.",
    "To treat someone or something with disdain, indifference, or contempt, as if they were nothing.",
    "No matter how much one may try, there is still an inability to achieve a goal or accomplish a task; futility."
  ],
  "notice": [
    "To become aware of something; to notice or perceive.",
    "A written statement or announcement, often posted in a public place, informing people about something important or giving them information.",
    "To take careful note or pay attention to something, such as reading carefully through the terms and conditions on an agreement before signing it.",
    "A mental awareness of something; being consciously aware.",
    "In law, a formal written document served on one party by another, which may initiate legal proceedings or notify of a change in circumstances."
  ],
  "noticeable": [
    "Observable; perceptible by the senses, especially when distinct from the usual or expected conditions.",
    "Visible or noticeable to the eye; conspicuous.",
    "Easily heard or perceived with the ear; audible.",
    "Evident or discernible in some way, such as by taste, smell, or touch."
  ],
  "notoriety": [
    "Known and talked about very much, especially because of something bad or disgraceful that has been done or is associated with someone.",
    "Widespread fame or recognition, often for a notorious or infamous act or behavior.",
    "The state of being widely known, typically for a negative or disreputable reason."
  ],
  "notorious": [
    "Well-known, especially for something bad or criminal; infamous.",
    "Known and talked about throughout a particular field or area of expertise because of some noteworthy characteristic; notable.",
    "Widely known for being very bad or dishonest; disreputable."
  ],
  "nourish": [
    "Provide with the food, nutrients, and other substances necessary for growth, health, and well-being.",
    "Encourage or help to develop a particular quality or skill.",
    "Foster the growth or development of something, such as a plant or an idea."
  ],
  "novel": [
    "A long, fictional story that is written in book form.",
    "Something new, unusual, or different; an innovative idea or approach.",
    "In genetics, a section of DNA that codes for a protein and includes the exons and introns."
  ],
  "now": [
    "At the present time or moment; currently.",
    "In a specific period of time; within this hour, day, etc.",
    "Without delay; immediately.",
    "At the same time; simultaneously.",
    "Used to indicate the present time or situation.",
    "Denoting the current point in time."
  ],
  "noxious": [
    "Harmful, poisonous, or destructive to health, property, or the environment; causing injury, illness, or damage.",
    "Offensive, disagreeable, or objectionable in nature; causing irritation, distress, or discomfort.",
    "Malicious, mischievous, or disruptive; intended to cause harm or disturbance."
  ],
  "nuance": [
    "A slight difference in a particular quality, such as shade of color, tone of voice, or shade of meaning.",
    "A subtle distinction, typically in language or attitude, that may be difficult to express or notice.",
    "A hint or suggestion of something, often not directly stated.",
    "Sensitivity to the different tones and implications of language or behavior, especially as a skill or quality."
  ],
  "nucleus": [
    "The central part of an atom, containing protons and neutrons and around which electrons orbit.",
    "The central or main part of something, acting as a source of energy or influence.",
    "A small group within an organization that forms the core of its activities, often with members having specific skills or knowledge."
  ],
  "nudge": [
    "Gently push or tap something in a particular direction with one's hand, elbow, or shoulder.",
    "To encourage someone to do something by providing subtle suggestions or incentives.",
    "A small change made to an interface or system that encourages users to make a certain decision without being overly coercive or obvious."
  ],
  "nudging": [
    "Gently pushing or guiding someone to make a particular decision or take a specific action.",
    "Making small changes to an environment, system, or behavior to encourage certain actions without restricting choices or imposing significant pressures.",
    "Subtly influencing people's decisions, behaviors, or opinions in a desired direction."
  ],
  "nuisance": [
    "A person, animal, object, or situation that is annoying, troublesome, or difficult to deal with.",
    "A problematic or obstacle that creates a disturbance, interferes with normal activities, or causes annoyance or discomfort.",
    "An unpleasant or unwanted thing that causes bother or inconvenience."
  ],
  "nullification": [
    "The act of declaring that a law, agreement, or decision is invalid or without force or effect.",
    "The doctrine that asserts that states have the right to nullify federal laws within their borders by refusing to enforce them."
  ],
  "number": [
    "A whole or part of a sequence of values in a particular order.",
    "The quantity of something that has been counted, stated, or considered.",
    "A symbol (such as Arabic numerals or Roman numerals) used to represent an integer.",
    "A specific amount or degree, such as in telephone numbers, social security numbers, or account numbers.",
    "A particular role or position within a group or sequence."
  ],
  "numeration": [
    "The act of counting, enumerating, or expressing a quantity in numbers.",
    "A system used to represent numbers in writing or symbols (e.g., Arabic numerals, Roman numerals).",
    "The process of converting words or phrases into numerical codes for data processing and computing purposes.",
    "The arrangement or classification of items according to their number or quantity."
  ],
  "numerator": [
    "In a fraction, the number above the division line, which represents the number of equal parts being considered in the division, and is divided into by the denominator to determine the resulting quotient."
  ],
  "nurse": [
    "A person trained and licensed to care for sick, injured, or disabled individuals, providing medical attention, emotional support, and assistance with daily tasks.",
    "(Outdated) A female attendant or companion, typically associated with women who cared for the sick in earlier times.",
    "An animal trained to provide assistance and support to a person with a disability or health condition, often a dog or a monkey."
  ],
  "nurture": [
    "To care for, encourage, and help someone or something grow and develop, especially during their early stages of life.",
    "To provide a favorable environment or conditions to promote growth or development in an organism or system."
  ],
  "nut": [
    "A hard-shelled, edible seed of certain plants, such as peanuts or almonds, used as food.",
    "A small, rounded inedible seed covering of certain trees, such as hazel or walnut, containing a seed that can be eaten after being removed from its shell.",
    "A piece of machinery, especially an adjustable one, consisting of a solid cylindrical part that can be rotated to change the position of other parts.",
    "A person who is not easily excited or influenced by others, especially someone regarded as hard-headed or obstinate."
  ],
  "nutrients": [
    "Essential substances that organisms need to grow, develop, reproduce, and maintain their health, which include carbohydrates, proteins, fats, vitamins, and minerals."
  ],
  "nutritionally": [
    "In terms of nutrition: concerning the substances that organisms take in to maintain life and growth, especially through the consumption of food.",
    "With respect to nourishment: relating to the process of providing or obtaining necessary nutrients for the body.",
    "From a dietary perspective: concerned with the way an individual consumes food for health purposes or to meet their nutritional needs."
  ],
  "nutritiously": [
    "In a manner that provides nourishment; relating to nutrients or food providing essential elements for growth, maintenance, and overall health.",
    "Concerning the process of obtaining nutritional benefits from food sources; regarding the selection, consumption, and balance of foods in a diet."
  ],
  "nylon": [
    "A synthetic fiber made from a material called polyamide, used in manufacturing fabrics, ropes, and other materials.",
    "A lightweight, strong, and flexible plastic material used to create various items like containers, seat belts, and clothing."
  ]
}