{
  "tab": [
    "A cardboard, plastic, or metal device inserted into a slot to allow access to an ATM or other machine.",
    "A flap of material, such as leather or vinyl, that folds over the edge of a piece of furniture, like a chair or sofa, protecting it from wear and tear.",
    "A small square or rectangular section in a table design, typically used to separate columns or groups of data.",
    "In computing, a key on a keyboard, usually represented by the symbol '^', used to indicate an exponential expression, such as 2^3 meaning 2 raised to the power of 3."
  ],
  "table": [
    "A piece of furniture with a flat, level surface supported by one or more legs or by a vertical structure, used for various purposes such as eating, writing, or displaying objects.",
    "A list or arrangement of items in rows and columns, often presented on a computer screen or printed document for comparison, organization, or analysis."
  ],
  "tableau": [
    "A static arrangement of objects, people, or animals set up to represent a particular scene, idea, or event; often used in theater, dance, or art as a visual representation.",
    "A picture or design made with many small pictures or details that show a larger scene or subject.",
    "A summary or snapshot of data or information presented in an organized and visually appealing manner, typically in the form of a chart or graph."
  ],
  "taboo": [
    "Forbidden, prohibited, or restricted by custom, tradition, or religious observance.",
    "Something that is considered off-limits, unmentionable, or socially unacceptable due to cultural or social norms.",
    "A subject or practice that is avoided because it is deemed unpleasant or uncomfortable."
  ],
  "taciturn": [
    "Refers to a person who speaks little, is quiet, or prefers not to communicate much with others.",
    "Describes someone who has a reserved personality and does not easily share their thoughts or feelings.",
    "Implies that the person's silence or lack of communication conveys a sense of mystery, strength, or contemplation."
  ],
  "taciturnity": [
    "The quality of being quiet, reserved, or uncommunicative; silence or reticence in speech.",
    "A state of being generally unwilling to speak or communicate freely with others.",
    "The trait of not expressing oneself readily or frequently in conversation."
  ],
  "take": [
    "To receive or accept something that is given, offered, or provided.",
    "To seize, capture, or obtain by force or authority.",
    "To carry out an action or make a decision, for example, \"I'll take the blue one.\"",
    "To move to a specific place or position, such as taking a seat or taking a step forward.",
    "To achieve a particular score in a game, for instance, \"They took the lead with 10 points.\"",
    "To use an amount of time or space, such as spending an hour at the gym.",
    "To create a photographic image by exposing film or a digital sensor to light."
  ],
  "taken": [
    "Accepted, understood, or recognized as true or valid: \"The results were taken as final.\"",
    "Acquired, obtained, or received: \"They took a liking to each other.\"",
    "Seized or captured: \"The police took the suspect into custody.\"",
    "Carried out or done: \"It's time to take action.\"",
    "Consumed or eaten: \"I can't believe I've taken three slices of cake already!\"",
    "Taken by death: \"She passed away peacefully in her sleep.\"",
    "In the context of photography, capturing an image with a camera: \"He took several photos during the trip.\""
  ],
  "talk": [
    "A conversation between two or more people, in which they exchange ideas, opinions, and information by speaking.",
    "A speech or talk given to an audience, typically about a specific topic, to inform, educate or entertain.",
    "The act of expressing oneself through the use of spoken words.",
    "To discuss something with someone or make arrangements or decisions through discussion.",
    "To engage in an argument or disagreement using words, rather than physical force."
  ],
  "talkative": [
    "Given to talking in an excessive or voluble manner; verbose",
    "Having a tendency to engage others in conversation; sociable",
    "Easily approached and willing to discuss matters; open",
    "Informal, gregarious; friendly and outgoing"
  ],
  "taller": [
    "A place where people make things, usually involving metal or wood, using various tools and techniques.",
    "A large building or structure used for storing or displaying a collection of items, often with multiple floors and specialized areas for different types of items.",
    "A group of buildings designed to house many animals in a controlled environment, typically providing separate living spaces for each animal and access to food and water.",
    "An area dedicated to the cultivation of specific plants or crops, often using advanced techniques and technologies to maximize production.",
    "A type of aircraft hangar designed specifically for larger airplanes, with specialized equipment and features to accommodate them."
  ],
  "tallest": [
    "The one who stands or sits at the highest level, compared to others in a specific group or setting; having surpassed all others in height.",
    "(In botany) A plant that is taller than others of its kind, often reaching a greater height than other members of the same species.",
    "(In architecture or construction) The structure or element that is at the highest point or level, such as the tallest building in a city or the tallest part of a bridge."
  ],
  "tally": [
    "A count of something, especially after adding up a series of numbers or tallying votes.",
    "A mark made as a record, such as on a tally stick or tally sheet.",
    "To keep a score or count of something by making marks or using other symbols.",
    "To be evenly balanced or equal in number, amount, or quality; to correspond exactly."
  ],
  "tame": [
    "To make (an animal, especially a wild one) less aggressive and dangerous, typically by training it to respond to human control.",
    "To reduce the intensity of (an emotion or response).",
    "To calm down or pacify (someone).",
    "To bring under control, domesticate or civilize.",
    "To make (something) less extreme or intense; restrain.",
    "To make (a wild plant) grow in a garden and become more manageable."
  ],
  "tan": [
    "A natural color of the skin, produced by exposure to sunlight or a tanning booth, typically made darker than the original color.",
    "A process for preserving animal hides in which they are soaked in a solution that changes their color and makes them resistant to decay."
  ],
  "tanager": [
    "A type of bird known for its brightly colored plumage, typically found in Central and South America.",
    "(Additional definition) A pale yellowish-brown color that can be used to describe skin tones or pigments in art.",
    "(Further definition) In some instances, the term 'tanager' may refer to a person who is skilled at working with leather or other materials such as animal hides.",
    "(Lastly, another definition) The word can also be used to describe someone who tans or preserves hides."
  ],
  "tangible": [
    "Something that can be touched or felt, as opposed to being intangible or abstract."
  ],
  "tangle": [
    "A complicated knot or tangle of something, such as hair, rope, or wires.",
    "A complex or confused situation that is difficult to untangle or resolve.",
    "A mass of intertwined objects or elements.",
    "(In botany) An intricate, tangled growth of plants or branches.",
    "(In music) A piece or section with a complicated and involved musical structure."
  ],
  "tantalize": [
    "To tempt or entice someone with something appealing, often in a playful or teasing manner."
  ],
  "tantalizing": [
    "Provoking curiosity, interest, or desire by being just beyond reach; enticing.",
    "Causing someone to want something strongly but not allowing them to have it; tempting in a frustrating way.",
    "Engaging or exciting; intriguing."
  ],
  "tantalum": [
    "A chemical element with the symbol Ta and atomic number 73, known for its hardness and high melting point. It is a member of the transition metals and is commonly used in capacitors, electronics, and other industries due to its ability to conduct electricity and resist corrosion."
  ],
  "tape": [
    "A thin, flexible strip of material, typically made of plastic or paper, that can be used to hold things together, such as packaging materials or documents.",
    "A long, narrow piece of magnetic material, typically coiled on a reel or spool, used for recording sound or images, or for data storage in computers.",
    "A thin, flexible ribbon used in various crafts and art projects to create patterns or designs by applying adhesive to one side.",
    "In sports, such as gymnastics or martial arts, a thin line on the floor that competitors must cross during their routine."
  ],
  "taper": [
    "To gradually decrease in size, width, or intensity, such as a candle burning down to its base.",
    "A conical or cylindrical piece of material, typically made of wood, wax, or metal, used for holding a flame or providing light.",
    "(of a beam or column) To narrow gradually towards the top.",
    "To make something thinner or narrower at one end, such as an arrow shaft or pencil lead."
  ],
  "target": [
    "A point, area, or object aimed at in shooting or other precision activities.",
    "The center of an optical device like a telescope or microscope where the image is focused.",
    "A place, person, or thing that is targeted for a particular action or purpose.",
    "A group of people who are considered to be typical users or recipients of something."
  ],
  "tariff": [
    "A tax levied on imports or exports of goods by a government, used to regulate trade and generate revenue.",
    "A schedule of duties and taxes assessed on imported goods, determining the amount payable per unit or value.",
    "A set of rules governing international trade between countries, including customs duties, import quotas, and other restrictions."
  ],
  "tarn": [
    "A small mountain lake formed by glacial action, typically found in alpine regions."
  ],
  "tarnish": [
    "Cause (a surface, such as metal) to become discolored or dull through exposure to air or other elements.",
    "Damage (an object's) appearance by scratching or otherwise marring its surface.",
    "Weaken (a reputation or credibility) by discrediting information or actions."
  ],
  "task": [
    "A piece of work assigned to someone to accomplish a particular aim.",
    "A job or duty to be performed; an assignment.",
    "A specific objective or mission to be carried out.",
    "An activity requiring sustained effort and skill.",
    "A project or set of projects to be completed, especially by a team."
  ],
  "tassel": [
    "A decorative hanging ornament consisting of a bunch of threads or cords, often found at the end of a cord on a hat or as an ornamental feature on clothing."
  ],
  "tattoo": [
    "A permanent marking made on the skin by injecting ink into the dermis layer using a needle or other instrument, often used to express personal style, cultural identity, or commemorate significant events."
  ],
  "taught": [
    "Instructed or educated, especially in a school setting: \"I was taught how to read by my teacher.\"",
    "To give instructions or impart knowledge to someone: \"The professor taught the class about the human body.\"",
    "To cause someone to understand or believe something by providing evidence or reasons: \"My friend taught me the importance of recycling.\""
  ],
  "taut": [
    "Pulled tight, stretched, or tense; taut implies a lack of slack or looseness. The rope was so taut that it couldn't be pulled any tighter.",
    "Concise and direct; lacking any superfluous words or expressions. The speaker gave a taut presentation with no room for confusion or ambiguity.",
    "(Of an argument) logically valid but weak in force, especially because of the implausibility of its premises. The opponent's argument was taut, but it relied on unrealistic assumptions that were easy to refute."
  ],
  "tautology": [
    "A statement or proposition that asserts the same thing in two different ways, making it redundant and offering no new information.",
    "A word or phrase that is unnecessary because its meaning is already expressed by another word or phrase in the same sentence.",
    "In logic, a proposition that is always true due to the structure of the language used to express it, regardless of whether the statements within it are actually true or false.",
    "In mathematics, an equation that is always true because its two sides are identical."
  ],
  "tax": [
    "A compulsory financial charge imposed by a government on individuals or businesses, often used to fund public services or government projects.",
    "(Legal) The legal obligation to pay money to the government for the purpose of raising revenue, maintaining public order and providing certain services.",
    "(Finance) An amount deducted from an individual's or business's income or transaction to be used by the government to raise funds.",
    "(Economics) A type of indirect tax levied on goods and services which is usually collected by the retailer, who then remits it to the government.",
    "(Business) A financial charge imposed on a company's profits or gross revenue by the government.",
    "(Political Science) A method used by governments to redistribute wealth or enforce policies, typically by collecting money from citizens or organizations and using it for public benefit."
  ],
  "tea": [
    "A popular beverage prepared by steeping dried tea leaves in hot water, which can be enjoyed plain or with added sugar, milk, or other flavourings.",
    "Informal term for a gathering of friends or colleagues to chat over a cup of tea, typically held at a tea room, tearoom, or home."
  ],
  "teak": [
    "A type of hardwood tree native to Southeast Asia, known for its durability and resistance to decay, commonly used in boat building and furniture making."
  ],
  "team": [
    "A group of people working together on a common project or task, each member having their own specific role to play in achieving a shared goal.",
    "In sports, a group of athletes who compete as a unit representing their school, club or country, playing according to specific rules and participating in different events.",
    "A set of draught animals working together to pull a load, such as a wagon, carriage or plow.",
    "A group of individuals with shared interests, goals, or purposes, that unite to achieve them, such as a political team, a research team, or a creative team."
  ],
  "tease": [
    "To amuse oneself by making light, often playful taunts or jokes at someone else's expense.",
    "To pull apart or separate (threads, fibers, or the like) with a comb, brush, or similar instrument.",
    "To torment or provoke (someone) in a playful or flirtatious way, especially by making sexual advances or by mocking their vanity or vulnerability.",
    "To draw out and separate the fibers of (yarn, thread, etc.) so as to prepare it for use or to clean it."
  ],
  "technically": [
    "In a technical or precise sense, considering only the details and specifics of something; taking into account the exact nature or characteristics of a subject.",
    "According to the rules, laws, or principles of a particular field or discipline; adhering strictly to proper procedures or methods.",
    "By virtue of the actual facts or details, rather than by common opinion or perception; objectively and precisely.",
    "In a sense that is accurate from a professional or expert point of view, even if it may not be apparent to others."
  ],
  "technician": [
    "A person who has specialized knowledge in a particular field, typically involving practical applications and hands-on skills, and uses that knowledge to perform tasks or solve problems within that field."
  ],
  "technique": [
    "A method, or a way of doing something, usually with special skills that have been learned and practiced.",
    "A skill or ability achieved through practice or learning.",
    "A particular way or manner in which an art, craft, or activity is done.",
    "A specific method used to achieve a desired result in any field, including science, sports, or the arts.",
    "In art or crafts, a particular style or approach used by an artist in their work."
  ],
  "technocracy": [
    "A form of government where people with technical expertise rule, making decisions based on knowledge and analysis rather than through democratic elections."
  ],
  "technocrat": [
    "A person who holds a high position in government, industry, or another field due to their expertise in a specific technical or professional area.",
    "A member of the ruling class in a country governed by a system that emphasizes expert knowledge and competence.",
    "An individual who strongly believes in using technical skills and scientific analysis for making decisions and solving problems."
  ],
  "technography": [
    "The recording, description, or classification of technological processes, systems, or devices.",
    "A written account or documentation of a specific technology, its history, applications, and impact on society.",
    "The study of how technologies evolve, interact, and influence cultural and social change over time."
  ],
  "technology": [
    "The knowledge, techniques, skills, and methods used in crafts, arts, and sciences to create practical and functional products or to solve problems.",
    "The devices, tools, machines, and systems that people use to help them do things more easily, quickly, or efficiently.",
    "A particular type of product, device, tool, machine, or system designed for a specific purpose.",
    "The study, design, development, production, and distribution of new products, devices, tools, machines, or systems, especially in fields like computing, engineering, or medicine."
  ],
  "tectonic": [
    "Pertaining to the earth's crust and its movement, such as in tectonic plates.",
    "Of or relating to the branch of geology that studies the structure, composition, and processes of the Earth's lithosphere.",
    "(Science-Fiction) Describing an advanced technology or weapon system with a large scale or impact, often in comparison to geological tectonic forces."
  ],
  "tedious": [
    "Lasting a long time; taking a great deal of time to complete.",
    "Involving labor or effort that seems never-ending.",
    "Dull, monotonous, and boring; lacking variety or interest."
  ],
  "tediously": [
    "In a way that is boringly slow, repetitive, or monotonous; characterized by an absence of variation or interest.",
    "Causing boredom due to being lengthy, dull, or repetitive; marked by tediousness.",
    "Requiring long, laborious effort or time to complete; tiresome and difficult in nature."
  ],
  "tedium": [
    "A state of boredom or weariness caused by something that is uninteresting, repetitive, or monotonous.",
    "A feeling of dullness or tediousness associated with a task, activity, or situation.",
    "The quality or state of being boring, repetitive, or monotonous; tediousness.",
    "A long period of time marked by dull, uninteresting experiences or events."
  ],
  "telekinetic": [
    "Possessing or involving the ability to move, control, or manipulate objects with one's mind, without any physical contact.",
    "Refers to a hypothetical psychic power allowing an individual to influence the motion of physical objects using mental forces or concentration."
  ],
  "telepathy": [
    "The ability to communicate with another person's thoughts without using words, such as through mental images, feelings or ideas."
  ],
  "telescope": [
    "A tube-like instrument that uses lenses or curved mirrors to gather and focus light from distant objects, allowing us to see them more clearly from a far distance.",
    "An optical device used by astronomers to observe celestial bodies and phenomena.",
    "A scientific tool that allows scientists to study objects at great distances and magnify the image of these objects for easier observation."
  ],
  "tell": [
    "To give information, share a story, or reveal a secret. For example, \"I can tell you the answer to your question.\"",
    "To instruct or direct someone, often with specific details. For instance, \"Tell me how to get to the museum.\"",
    "To indicate the time, especially by using numbers or words. Example, \"It's four o'clock; tell me what time it is.\"",
    "To describe an object or scene accurately, such as in a drawing or painting. For example, \"Your sketch really tells the story of that beautiful landscape.\""
  ],
  "temerarious": [
    "Showing a reckless lack of concern for risks or dangers; impulsive and daring, often to an extent that is foolish or dangerous.",
    "(Not applicable)"
  ],
  "temperament": [
    "The general mental and emotional nature of a person, influenced by factors like personality, mood, and behavior.",
    "A state of balance or harmony, especially in the four bodily humors according to ancient Greek medicine.",
    "In music, the blend of tones produced by an instrument or voice, particularly regarding intonation and pitch."
  ],
  "temple": [
    "A building or place dedicated to religious worship, often containing a sanctuary or altar where rituals are performed.",
    "The part of the human body between the eyes and ears, above the nose, considered in some cultures as the center of spiritual senses or consciousness.",
    "A part of an ancient building that was especially richly decorated or important, such as a column or pediment.",
    "A structure or area designed for meditation, reflection, or spiritual practice."
  ],
  "temporary": [
    "Pertaining to something that is of short duration, not permanent, or will end at a later time.",
    "Referring to a place or position filled in until a regular person or thing can take its place.",
    "A term used to describe an action or situation with limited or uncertain duration."
  ],
  "temporize": [
    "To act in a delaying or evasive manner, often to avoid making a decision or taking action.",
    "To adapt oneself or one's actions to circumstances, especially for the purpose of gaining time or evading a difficult situation.",
    "To make temporary arrangements or compromises in order to gain more favorable conditions at a later time."
  ],
  "ten": [
    "A number that comes after nine and before eleven in a counting system; the number represented by the Arabic numeral 10.",
    "One of the ten cards in a deck of playing cards representing a complete suit.",
    "An amount or quantity of something specified, such as ten dollars or ten kilograms.",
    "A rank or level, often used to denote proficiency, like a tenth-grade student.",
    "Ten-speed, referring to a bicycle with ten gears for adjusting the resistance while riding.",
    "In sports, the score of ten is a good performance or effort.",
    "In music, a time signature indicating that there are ten beats per measure."
  ],
  "tenacious": [
    "Persistent and determined in maintaining a position, opinion, or course of action.",
    "Holding or gripping firmly; not easily loosened or released.",
    "Not easily pulled apart or torn; having great strength and durability.",
    "Capable of surviving in difficult conditions due to its toughness and endurance."
  ],
  "tenacity": [
    "Persistence in achieving a goal or task, showing determination and refusal to give up despite challenges or obstacles.",
    "The quality of being firm and unyielding in beliefs, opinions, or convictions; strong willpower.",
    "Strong or stiff fiber found in plant stems that allows them to stand upright and resist bending."
  ],
  "tendencies": [
    "A natural inclination or disposition towards certain actions, behaviors, or beliefs.",
    "A direction or trend in a specific area or subject, often based on patterns or observations.",
    "A likelihood or probability of something occurring based on past experiences or evidence."
  ],
  "tendency": [
    "A lean or inclination towards something. This could be a preference, belief, or a predisposition towards a certain action or behavior. For instance, someone might have a tendency to prefer sweet over salty foods.",
    "A statistical propensity for something to occur. In this context, it refers to the likelihood of something happening based on past data. This can be applied in areas such as economics, politics, science, etc., where patterns are analyzed to make predictions or draw conclusions."
  ],
  "tenebrous": [
    "Dark, gloomy, or obscure",
    "Having a deep or mysterious character",
    "Involving or suggesting secret activities or plans"
  ],
  "tennis": [
    "A popular sport played individually or in teams, involving striking a small ball with rackets and hitting it over a net into an opponent's court.",
    "The equipment used to play the sport, including rackets, balls, and protective gear like shoes and clothing designed for the game.",
    "A place where tennis is played, such as an indoor or outdoor facility equipped with courts, nets, and other necessary apparatus."
  ],
  "tentative": [
    "Not yet established or decided; still being worked out or considered.",
    "Subject to change or cancellation; not definitely planned or arranged.",
    "Not confident or certain in one's actions or decisions, likely to change."
  ],
  "tenth": [
    "A cardinal number that stands for one of ten equal parts into which a whole has been divided, or any number that follows the ninth in sequence.",
    "The ordinal number used to express position as being one more than ninth and less than eleventh.",
    "A 10th place or rank in a competition or series."
  ],
  "tenuous": [
    "Thin or weak, as in a tenuous connection or relationship.",
    "Involving or suggesting something that is difficult to see, touch, or prove, as in a tenuous link between two ideas or events.",
    "Not strong or secure, as in a tenuous grip on power."
  ],
  "terminology": [
    "The special vocabulary used in a particular subject, profession, or field of study.",
    "A system of communication used by a certain group or society."
  ],
  "terminus": [
    "The end point, either of a journey or a line (such as a railway).",
    "In botany, the point at which a leaf or structure is attached to a stem or other part of the plant.",
    "In entomology, the segment or part where an appendage is attached to an insect's body."
  ],
  "terrible": [
    "Extremely bad, awful, or unfavorable in some way, as in \"the terrible weather ruined our picnic.\"",
    "Very powerful, intense, or alarming, as in \"a terrible storm swept through the region.\"",
    "Extremely severe or harsh, as in \"the terrible consequences of their actions.\"",
    "Causing great fear or dread, as in \"a terrible monster lurked in the darkness.\"",
    "Characterized by a lack of good qualities or merit; abominable, as in \"a terrible piece of writing.\""
  ],
  "terror": [
    "Extreme fear, anxiety, or dread.",
    "A person or thing that inspires dread or fear.",
    "Violent acts intended to create widespread fear and submission.",
    "An organized group of people who engage in terrorism or terroristic activities.",
    "The state of being terrified or filled with extreme fear.",
    "A situation characterized by widespread panic, confusion, or anxiety."
  ],
  "tesseract": [
    "A four-dimensional analog of a cube, which is often depicted as a regular eight-faced polytope in three-dimensional space. It can be imagined as a cube that has been visually rotated along each of its four spatial dimensions, resulting in an object that appears to be composed of smaller cubes arranged in a specific pattern. This higher-dimensional shape is a fundamental concept in the study of geometry and higher-dimensional mathematics."
  ],
  "test": [
    "An examination designed to evaluate knowledge, skill, or ability in a specific subject or area.",
    "A trial or experiment to determine the effectiveness, quality, or reliability of something.",
    "A series of questions, problems, or tasks used to assess understanding or proficiency.",
    "A sample or example taken from a larger group or population for analysis or study.",
    "An event that tests one's endurance, patience, or determination under challenging circumstances."
  ],
  "tether": [
    "To secure or fasten something, especially an animal, to a fixed point by means of a rope, chain, or cord.",
    "A rope, chain, or cord used for securing or tying down something.",
    "To limit or restrict someone or something's freedom or movement; to keep under control.",
    "(In computing) To attach or link one computer system or network to another with a different level of security or access."
  ],
  "tetrachromat": [
    "An individual who possesses the genetic ability to see more than one million distinct colors, which is beyond the average human color vision range of about one million colors. This ability is caused by having four types of cone cells in the eyes instead of the standard three.",
    "A term used to describe a person or animal that can perceive a wider range of colors due to possessing an extra photoreceptor type, resulting in additional color perception beyond what normal trichromats (individuals with three types of cone cells) are capable of seeing."
  ],
  "thanked": [
    "Express gratitude or appreciation towards someone for a favor, act of kindness, or gift.",
    "Show acknowledgment or recognition in words or actions to someone who has done something beneficial.",
    "Be in a state of being thankful or grateful, such as after receiving help from others."
  ],
  "that": [
    "As a demonstrative pronoun, adjective, or determiner: referring to or identifying persons or things already mentioned or well-known to the listener. For example, \"I have two cats; this one is black, and that one is white.\"",
    "(conjunction) introducing subordinate clauses in a sentence, providing additional information or clarification. For instance, \"She knew the answer, but that didn't guarantee her success.\""
  ],
  "their": [
    "Pertaining to, owned by, or associated with a group of people or animals; possessive pronoun used to indicate ownership or association. For example: \"They went for a walk in the park and left their umbrella behind.\""
  ],
  "them": [
    "Them refers to a group of people or things previously mentioned, indicated, or implied. It is used as an object pronoun in the objective case. For example, \"I saw John and them walking down the street.\"",
    "In some cases, 'them' can also be used as a subject pronoun when the subject and object are the same group of people or things. For instance, \"They walked down the street, and them was impressed by the view.\"",
    "'Them' is often used in informal language to refer to a plural noun or a group of people, especially when it's difficult to mention everyone by name. Example: \"I told them (my friends) about my new job, and they were all excited for me.\""
  ],
  "theme": [
    "A subject, topic, or idea that is emphasized in a piece of writing, artwork, music, or other creative work; the central message or focus of a composition.",
    "A unifying concept or underlying message that connects various elements of an event, project, or group activity, such as a party theme, school theme week, or corporate theme.",
    "A common subject or idea that is explored in many works of literature, art, or music from the same time period or cultural background; a recurring motif or shared characteristic within a particular genre or style.",
    "A general topic or overarching idea that is central to a discussion, debate, or presentation; the main point being argued or discussed."
  ],
  "then": [
    "At that time or point; afterward.",
    "In that case, therefore; as a consequence.",
    "Used to introduce a statement following a condition or concession.",
    "(In dating systems) At the point indicated by a particular date or time."
  ],
  "therapeutic": [
    "Pertaining to, characterized by, or employed in treatment or relief of disease or pain; medicinal or healing.",
    "Involving the use of substances, methods, or techniques intended to promote health and well-being.",
    "Having a positive effect on mental or emotional state, especially when used for therapeutic purposes."
  ],
  "there": [
    "In a place or position indicated by the words that precede or follow it: \"Look over there!\"",
    "At or to a specified place: \"Bring me the book there on the shelf.\"",
    "At a particular time, situation, or condition: \"We will be happy there when we achieve our goals.\"",
    "In existence; actually occurring within an area or population: \"There is evidence of pollution in the river.\""
  ],
  "thereafter": [
    "After a specific time, event, or point in time, referring to what comes after it.",
    "In legal contexts, denoting the period of time beginning with an event or decision and continuing thereonward."
  ],
  "thermodynamic": [
    "Pertaining to the branch of physics that deals with heat, energy, and their relations to work, properties of matter, and radiation.",
    "Relating to the principles of thermodynamics as applied to a particular process or system."
  ],
  "these": [
    "These: referring to a specific group of things mentioned earlier, currently being discussed, or nearby. For example: \"I saw these shoes on sale at the mall today.\" Here, \"these\" refers to the shoes that were seen and are currently being talked about.",
    "These: denoting more than one, but less than all members of a group. For example: \"Several people attended the event, and these decided to volunteer for the organizing committee.\" In this case, \"these\" refers to an unspecified number of people from the general group that chose to volunteer."
  ],
  "they": [
    "Pronoun used to refer to a person or people previously mentioned, or to a group of people or animals, but not the speaker or someone being addressed directly. For example: \"John went home, and they arrived late.\"",
    "In modern English, \"they\" can also be used as a singular pronoun for a person whose gender identity is non-binary or who prefers to use \"they/them\" as their personal pronoun. For example: \"Meet Jane, they are an activist and writer.\""
  ],
  "thick": [
    "Having a relatively large amount of substance or material in a specific area; densely packed or crowded (as in \"the forest was thick with trees\").",
    "Resistant to heat, cold, or other environmental factors; tough or hardy (as in \"this wool sweater is very thick and warm\").",
    "Having a rich or deep tone; not thin or weak (as in \"the musician played the notes with a thick sound\").",
    "Not easily influenced by others or changed by events; firm in one's beliefs or decisions (as in \"he remained thick-headed about the new policy change\")."
  ],
  "thieves": [
    "A person who steals, especially habitually or by professional skill.",
    "(Informal) Used to refer to a group of people who work together to steal or commit fraudulent acts.",
    "(Juvenile slang) Used to refer to someone who is perceived as taking advantage of others or being selfish."
  ],
  "thin": [
    "Having little substance, width, or depth; not thick or wide.",
    "Not densely populated or crowded.",
    "(Of a person) not overweight and having little body fat.",
    "(Of a voice or sound) high-pitched and weak in volume.",
    "(Of liquid or a solution) diluted, weakened, or watered down.",
    "Not intense or extreme; mild or moderate.",
    "(Of an object) easily broken or damaged due to being fragile or delicate."
  ],
  "thing": [
    "An object or article, tangible or intangible, that can be perceived by the senses or the mind.",
    "A person, event, or occurrence of significance or interest.",
    "Something considered from a specific point of view, often informal or colloquial.",
    "A matter, issue, or subject being discussed or dealt with.",
    "An assembly or gathering of people for a particular purpose."
  ],
  "things": [
    "Various objects, events, or ideas that exist or happen; individual items or elements within a group.",
    "Material possessions or belongings of an individual, especially when considered collectively.",
    "Matters or issues to be dealt with or considered; topics under discussion or consideration.",
    "Particulars, details, or aspects of a situation, subject, or problem; specific elements that make up something larger or more complex.",
    "Stuff or assorted items in general; an unspecified collection of objects or matters."
  ],
  "third": [
    "The third person singular pronoun in English, used to refer to a person or thing not previously mentioned or known or assumed to be not involved in the situation being discussed.",
    "A number or position that is three from the starting point.",
    "One of the three divisions or parts into which something can be divided or separated.",
    "The third member of a group, team, or sequence.",
    "(Sports) In a game where players take turns, the third shot in a series of three by each player."
  ],
  "thirst": [
    "A strong desire for something, typically water, that one lacks or needs.",
    "The feeling of dryness in the mouth and throat caused by a need for water.",
    "A strong desire or wish, especially one that cannot be satisfied.",
    "An intense longing or craving for something."
  ],
  "thirty": [
    "The cardinal number that is the sum of twenty-nine and one, or that which is a numeral representing this number.",
    "A symbol (<sup>o</sup>C) for the Celsius temperature scale that represents the freezing point of water.",
    "A unit of the International System of Units (SI) for planar angle equal to one hundredth of a right angle or one sixtieth of a full turn."
  ],
  "this": [
    "This (pronoun): used to refer to something already mentioned or easily identified, often pointing out the thing being talked about in the present moment or situation.",
    "This (determiner): preceding a noun to indicate the specific item or group of items close at hand or immediately under consideration."
  ],
  "those": [
    "Those refer to a group of people, things, or items previously mentioned or easily identifiable by context. For example, \"I have apples and bananas on the table; those are the fruits I like best.\"",
    "Those can also indicate a specific set of individuals or objects in a particular category or situation. Example: \"Those who graduate from this program will be well-prepared for their future careers.\"",
    "In literature, those may be used to refer to characters, settings, or events within a story that are previously introduced or easily recognizable by the reader."
  ],
  "thought": [
    "A mental impression or image formed by considering something carefully, often in relation to one's ideas, opinions, or judgments.",
    "An idea or opinion held by someone; a belief.",
    "To consider or reflect upon something deeply or thoughtfully.",
    "To express one's thoughts, feelings, or ideas through speech or writing.",
    "To contemplate or ponder over an issue or problem in order to reach a conclusion or decision."
  ],
  "thousands": [
    "A large number of items or objects, typically between one hundred and nine hundred ninety-nine hundred ninety-nine, but not necessarily exactly that amount. For example, \"There were thousands of people at the concert.\" or \"I have thousands of books in my library.\"",
    "In mathematics, a large number often represented by the numeral 1,000 (one thousand). This is equal to one hundred times one hundred.",
    "A group of people, animals, or things considered as a unit because they share common characteristics, beliefs, or interests. For example, \"Thousands of birds migrate across the continent each year.\"",
    "A term used in computing to describe a large quantity of data, memory, or other resources, typically measured in multiples of 1024. In this context, thousands refer to the second definition of the word but is used as a prefix to indicate the scale of the measurement. For example, \"This computer has a 4 gigabyte RAM, which is equal to 4,096 (four thousand ninety-six) megabytes.\""
  ],
  "thread": [
    "A long, slender strand of material, such as cotton or silk, used in sewing or weaving.",
    "An arrangement of interconnected computer files or data that create a continuous pathway for communication and information exchange.",
    "A continuous, thin, flexible strand of metal, plastic, or other material that can be wound onto a reel, used in various industrial processes.",
    "In computing, a single sequence of related tasks or instructions, often executed by a processor.",
    "A long, slender strand-like projection from an organism, such as a fungal hypha or plant tendril."
  ],
  "threadbare": [
    "Worn out; having no life left.",
    "Exhausted of novelty, freshness or interest due to overuse, excessive repetition or misuse; hackneyed.",
    "Diluted by continuous usage or exploitation, lacking potency or value.",
    "(Of a storyline, idea, or theme) so frequently used or repeated that it no longer provokes surprise or interest.",
    "(Of a person's arguments or claims) not convincing because they are overused or unoriginal."
  ],
  "three": [
    "A cardinal number that follows two and precedes four, representing a quantity of three items.",
    "In baseball, a three-run homer is when a batter hits the ball out of the park and advances all runners on base by three bases.",
    "The third item in a series or sequence, such as the third place winner in a competition.",
    "A number used to indicate three times or multiples of three, for instance 3:00 pm or thirty degrees."
  ],
  "threnody": [
    "A mournful or lamenting song, poem, or piece of music, often used to express grief or sorrow at a funeral or memorial service."
  ],
  "threshing": [
    "The act of separating grain from its stalks, husks, or other plant parts by beating them with sticks, flails, or machines; this is typically done in agriculture to harvest grains like wheat, rice, barley, etc.",
    "(of computers) A data processing method that sorts through vast amounts of information quickly, particularly used for searching and organizing large databases."
  ],
  "thrive": [
    "Flourish, grow or develop well in a specific situation or place; do extremely well.",
    "Prosper; enjoy success and achieve one's goals.",
    "Grow vigorously; increase rapidly in number or amount.",
    "Develop and progress successfully; reach full potential."
  ],
  "thrived": [
    "Flourished, grew successfully, and prospered in a particular situation or environment."
  ],
  "thriving": [
    "Flourishing, growing, or prospering in a healthy or robust condition.",
    "Growing rapidly or successfully, especially economically.",
    "Experiencing good health and vitality; being in peak condition.",
    "Living or developing well, particularly in terms of personal growth and fulfillment."
  ],
  "through": [
    "In a continuous, unbroken path or direction, from one side to the other; extending from end to end of something.",
    "By passing completely through an area or object.",
    "As a means of passage between two points or areas; serving as a connection.",
    "Used for emphasizing the extent or completeness of an action or situation; indicating the entirety of something.",
    "(In writing) Denoting past action or state, as if completed."
  ],
  "throw": [
    "To propel an object through the air by the force of the hand, wrist, or arm.",
    "To cast off or shed something, such as leaves in autumn or hair during a haircut.",
    "To pitch, as in baseball.",
    "To cause to be thrown or cast away, such as garbage into a trash can.",
    "To bring about an influence or effect; to attribute.",
    "In sports, to make a sudden, forceful movement to change direction.",
    "To throw a switch or lever to turn on or off."
  ],
  "thud": [
    "A dull, heavy sound made by something falling or hitting a surface.",
    "The feeling or impact of something striking or colliding with an object.",
    "(In the context of warfare) the sound made by an explosion or bombardment.",
    "(In sports such as baseball or cricket) the sound made when a ball hits the ground after being hit."
  ],
  "thump": [
    "A loud, heavy sound made by a sudden blow or strike, as of a fist, foot, or object hitting something.",
    "To strike or beat something with force, producing a thudding noise.",
    "To hit or strike an object to make a specific sound, usually for emphasis or attention-grabbing."
  ],
  "thunder": [
    "A loud, explosive noise made by a sudden clap of lightning in a storm; the sound that accompanies a lightning bolt.",
    "The sound of thunder is due to the rapid expansion and heating of air by lightning, which creates a shock wave in the atmosphere.",
    "Thunder may be heard over long distances, especially during thunderstorms when there are many lightning strikes.",
    "The loud noise of thunder can cause fear or anxiety in some people.",
    "Thunder is sometimes associated with other natural phenomena such as volcanic eruptions or sonic booms from supersonic aircraft."
  ],
  "tickle": [
    "To cause a light, tingling sensation on the skin by touching it gently, often leading to laughter or giggling. This can be due to stimulation of nerve endings in the skin.",
    "A feeling or an instance of being amused or entertained, especially by something that is mildly humorous or unexpected.",
    "To make fun of someone playfully or tease them gently, usually with humor.",
    "(Computing) In programming, to cause a variable or expression to change its value due to an event or condition.",
    "(Finance) To trade in a market quickly and often, especially to take advantage of small differences in prices between similar assets or securities."
  ],
  "tie": [
    "A narrow piece of fabric worn around the neck and knotted at the front, fastening a shirt or blouse at the collar.",
    "A cord, rope, or ribbon used to bind, secure, or decorate something.",
    "To fasten or secure with a tie or similar fastener.",
    "To be equal or level with another, especially in a contest or competition; draw.",
    "To balance or counteract the effects of something, as in a discussion or argument."
  ],
  "tied": [
    "Secured or fastened in place with a knot, cord, rope, or other binding material, preventing movement or loosening.",
    "Tightly bound together, as in a bundle or package, so that they cannot be separated without being undone.",
    "Even or equal in score or standing, as in sports competitions or tests.",
    "Intricately connected or interwoven, as in the complex relationships between different aspects of an issue."
  ],
  "tiger": [
    "A large, powerful feline with orange fur and black stripes native to Asia and some parts of Russia, known for its strength and aggression.",
    "Any of various other big cats that are not lions or leopards but have similar striped coats, such as the Siberian tiger or the white tiger.",
    "A slang term for a person who is aggressive or tough."
  ],
  "tight": [
    "Restricted, not loose or free-moving; snug or close-fitting: a tight shirt.",
    "Difficult to do or achieve: the problem presented a tight challenge.",
    "Limited in supply or resources; scarce: there was a tight budget for the project.",
    "Strict or inflexible; unyielding: the boss had a tight policy on absences.",
    "Sealed or fastened securely; locked: they left the door tight.",
    "Closely related by blood; kin: we are tight relatives."
  ],
  "timber": [
    "The wood of trees, especially when cut and prepared for use as building material or fuel.",
    "The wood of various trees in their natural state growing in the forests.",
    "A piece of lumber that has been cut and processed to be used for construction, furniture, or other purposes.",
    "To fell or cut down trees in a forest for timber.",
    "The act of transporting or handling logs, lumber, or wood products.",
    "The business of buying and selling timber, including cutting down trees, processing the wood, and selling the finished products."
  ],
  "time": [
    "A non-spatial continuum in which events occur in sequence, extending from the past through the present to the future.",
    "An instance of this continuum; a point, interval or duration marked by a sequence of events.",
    "The period during which something exists or operates, or during which an action, process, or condition is possible.",
    "A fixed schedule for the repetition of an event or process.",
    "A specific moment, instant, or period in history.",
    "A standard by which rates of speed are measured, typically measured in seconds, minutes, hours, days, and years.",
    "A point reached or elapsed during a certain activity; an opportunity to perform an action."
  ],
  "tinkertoy": [
    "A type of toy consisting of colorful, interlocking wooden rods and disks that can be used to create various structures and shapes. These toys allow children to develop their creativity and spatial reasoning skills through play."
  ],
  "tiny": [
    "Extremely small in size, quantity, amount, or degree.",
    "So small as to be almost imperceptible or negligible.",
    "Insignificant or trivial when compared to something else.",
    "Characterized by or involving only a few people or things."
  ],
  "tiptoe": [
    "To walk or move very quietly, with the toes touching the ground lightly to avoid making noise."
  ],
  "tirade": [
    "A prolonged, forceful speech or verbal outburst, especially one that is angry, critical, or abusive in nature.",
    "(Outdated) An attack or assault with weapons or missiles."
  ],
  "tire": [
    "A circular band of fabric, rubber, or metal that surrounds a wheel and provides contact with the road, absorbing shock and providing traction.",
    "To become weary or exhausted due to physical or mental exertion.",
    "To wear out or exhaust someone's patience, interest, or enthusiasm.",
    "A feeling of boredom or fatigue resulting from overwork or too much activity."
  ],
  "tissue": [
    "A group of cells, organisms, and/or substances that work together to perform a specific function in living organisms.",
    "A layer or layers of these groups within an organism, often forming parts of organs, structures, or systems.",
    "In biology, the microscopic structure of cells, tissues, organs, and other components that make up living things.",
    "In medicine, a sample taken from the body for examination, such as a tissue sample from a biopsy."
  ],
  "tissues": [
    "A collection of cells, together with their products, arranged to perform a specific function in an organism.",
    "A thin layer of fabric used for decoration or to cover something, such as wrapping paper or tissue paper.",
    "A group of people who are united by common interests or experiences, forming a community.",
    "A collection of cells that make up the structure of an organ or part of an organism."
  ],
  "titillate": [
    "Excite or stimulate, typically in a way that is mildly erotic or provocative.",
    "To provoke curiosity or interest by suggesting something new or unusual.",
    "To cause a feeling of amusement or pleasure, especially by something unexpected or slight."
  ],
  "to": [
    "Preposition used to indicate motion, direction, or a specific point in time or space.",
    "Preposition indicating the person or thing that an action is directed towards.",
    "Preposition expressing purpose, intention, or aim.",
    "Preposition signifying movement, progression, or approach toward a particular destination.",
    "Preposition used to indicate proximity, connection, or relationship.",
    "Conjunction connecting the clause of an action to be done.",
    "Conjunction connecting words and phrases in a sentence for emphasis or clarification."
  ],
  "today": [
    "The day of the month on which something is happening, as opposed to another day in the past or future.",
    "Present time; the current moment.",
    "A specific date, particularly when referring to a particular event that occurs on that date every year.",
    "A point of reference for the present moment in a conversation or text."
  ],
  "together": [
    "In close proximity, physically united, or side by side.",
    "As a single unit or whole; complete or undivided.",
    "Simultaneously or at the same time.",
    "Working or cooperating in unison; harmoniously.",
    "Combined or amalgamated into one entity or system.",
    "Unanimously, with everyone in agreement.",
    "In a state of mental or emotional unity or harmony."
  ],
  "tolerable": [
    "Able to be endured or put up with, especially when it is not enjoyable but no worse than could reasonably be expected.",
    "Capable of being accepted or allowed even if not approved of; permissible.",
    "Sufficiently good enough in quality, amount, or standard to be acceptable or allowable, although not the best possible."
  ],
  "tomatoes": [
    "The fleshy, edible fruit of a tropical vine belonging to the nightshade family, having a juicy interior enclosed in a red or yellow exterior, often used in salads and cooked dishes.",
    "(In botany) A small tree or shrub of the Solanum lycopersicum species of the nightshade family, native to South America and cultivated widely for its edible fruit, used raw or cooked.",
    "(In culinary arts) A type of vegetable/fruit that is eaten raw or cooked in a variety of dishes such as sauces, salads, pizzas, etc.",
    "(In nutrition) A source of vitamins and minerals, particularly Vitamin C and potassium, often used as a garnish or ingredient in various cuisines worldwide."
  ],
  "tombstone": [
    "A flat slab or stone, usually engraved with inscriptions to commemorate the deceased and marking the place where they were buried.",
    "An indication or reminder of something that has been buried or hidden; a clue or hint."
  ],
  "tongue": [
    "The mobile, muscular organ in the mouth of vertebrates that is covered with moist tissue and is used for tasting, forming words, and chewing food; a part of the body that allows animals to eat and communicate through taste.",
    "A projection or part resembling a tongue, as the outer part of an anchor or the part of a screw by which it grips its thread.",
    "An elongated or outlying piece of land, such as a peninsula, extending into a larger body of water; also known as a \"tongue-shaped\" feature.",
    "A slender, flexible object or appendage, such as the part of a brush used for cleaning crevices or an instrument used for picking up small objects.",
    "In heraldry, a term used to describe a specific type of charge, consisting of three points arranged in a triangular shape and resembling a bird's tongue; also known as a \"tongue-shaped\" symbol."
  ],
  "too": [
    "In excess of what is desirable, necessary, or appropriate; to an extreme degree: \"I didn't eat breakfast because I was too busy.\"",
    "Also, in addition to or beyond what is being considered or discussed: \"She's a good friend, but not the person I would choose to help me with this project – there are others who are better qualified and also...\"",
    "At the same time as; simultaneously: \"The train arrived at the station too late for her to catch her connecting flight.\""
  ],
  "took": [
    "Past tense of the verb 'take', indicating that something was taken or received in the past.",
    "(Legal) To take possession of a property or land by paying money to the owner or the state.",
    "(Obsolete) To lead or guide; to direct or manage."
  ],
  "tools": [
    "Objects used to carry out a particular operation, especially by a craftsman or mechanic; equipment",
    "The means of accomplishing a task or purpose; resources",
    "The implements used in a particular activity, especially in sport or manual work",
    "A person's abilities, skills, and resources used for solving problems, making decisions, or achieving goals"
  ],
  "toot": [
    "A brief, sharp sound made by a vehicle's horn or a train's whistle.",
    "The act of blowing one's nose forcefully to clear it.",
    "A small piece or fragment, as of metal or ice.",
    "In music, a short, sharp note played on a brass instrument such as a trumpet or trombone."
  ],
  "tooth": [
    "A hard, white structure found in the mouth of animals, used for biting, tearing, and chewing food or as a means of self-defense.",
    "The visible part of the dentition, usually made of enamel, dentin, and cementum; a specific example is an incisor, canine, premolar, or molar tooth.",
    "A small piece, fragment, or remnant, as in \"a tooth of the old tradition remains.\"",
    "A term used to describe the sharp point or edge of a saw, axe, or similar tool; for example, \"the blade of the saw has sharp teeth.\"",
    "A symbol or mark used to represent something else, especially on a computer keyboard, as in \"press the 't' key.\""
  ],
  "topographic": [
    "Related to or describing the physical features of an area, such as its landforms, elevation, and drainage patterns.",
    "Involving or using maps, charts, or other representations that show these features in detail.",
    "Used for or involved with analyzing data collected through techniques such as remote sensing or geophysical surveys to study the Earth's surface."
  ],
  "torpor": [
    "A state of inactivity, sluggishness, or lethargy.",
    "A temporary state of hibernation or dormancy experienced by certain animals during winter months."
  ],
  "toss": [
    "To throw or fling something from oneself with force or violence, often causing it to move through the air in an irregular manner. For instance, a person might toss a ball or a Frisbee.",
    "To turn something over so that its upper and lower sides are interchanged; invert. For example, one might toss a pancake in the frying pan.",
    "To put someone or something into an uncertain situation or change their usual circumstances suddenly; upend or disrupt. For instance, a job loss could throw a person's life plans into disarray.",
    "To bet money on an event, often with the intention of winning more money; gamble. For example, one might toss some money on a horse race.",
    "To agitate, shake, or move something violently in order to mix it or change its condition. For instance, a person might toss salad ingredients together in a bowl."
  ],
  "tough": [
    "Difficult to be dealt with; requiring great effort or strength.",
    "Hard or resistant; not easily damaged, worn, or broken.",
    "Strong and sinewy in physical structure.",
    "Unyielding or inflexible in opinions, beliefs, or decisions.",
    "Not affected by adverse conditions; enduring."
  ],
  "tournament": [
    "A competition in which several contestants play a series of games or matches, with the winner determined by accumulated points or victory in the majority of individual contests."
  ],
  "toward": [
    "In the direction of, moving closer to a specific location or point; denoting movement towards something.",
    "As a means of expressing approximation, indicating an estimated value or a close but not exact number.",
    "Indicating a preference or inclination for something over other alternatives.",
    "Expressing the concept of progression or advancement in time, space, or ideas."
  ],
  "towel": [
    "A large piece of absorbent cloth, typically square in shape, used for drying oneself after washing or bathing, cleaning surfaces, or as a decorative item."
  ],
  "town": [
    "A locality larger than a village but smaller than a city, usually having a defined boundary and a permanent population engaged in various economic activities.",
    "In law or politics, an administrative unit smaller than a city but larger than a village, often with its own government or council.",
    "A community with its distinct character, often centered around a central square or marketplace."
  ],
  "toxicity": [
    "The quality of being poisonous or capable of causing harm to living organisms, often measured by how much substance is needed to cause harm.",
    "The extent to which a substance is toxic, determined by laboratory tests on cells, animals or humans.",
    "A measure of the amount of a substance that is toxic and can potentially cause harm to living things.",
    "The state of being poisoned or contaminated by a dangerous substance."
  ],
  "trace": [
    "To follow the course or path of something, especially by carefully examining evidence or details. For example, a detective may trace the movements of a suspect.",
    "To find and mark out the line, shape, or outline of something, as in drawing or writing. For instance, an artist might trace the contours of a landscape before beginning to paint it.",
    "To detect a small amount of a substance, especially by chemical analysis; to identify the presence of something in very small amounts. This could refer to the detection of pollutants in water samples, for example.",
    "To leave a visible or tangible indication of something's existence or passage, such as a faint footprint or a barely detectable scent. In this sense, trace can imply something subtle or elusive.",
    "(In computing) To find and display the path taken by an object or program on a computer, often represented visually on screen. For example, one might use software to trace the movements of a cursor across the screen."
  ],
  "trachea": [
    "The main airway of the respiratory system, connecting the nose and mouth to the bronchi of the lungs. It is also known as the windpipe or neck airway.",
    "A hollow tube in the throat that carries air from the mouth and nose into the lungs."
  ],
  "track": [
    "A path marked by footprints, wheel marks, etc., on which someone or something has traveled or is traveling.",
    "A course or route followed in achieving a goal or solving a problem.",
    "A groove, rut, or mark left by something moving over a surface.",
    "A set of related data elements that collectively represent some aspect of an entity.",
    "In music and audio engineering, a path on which sound is recorded or mixed.",
    "A record of the progress of a project or task.",
    "On a vehicle's dashboard, a device showing information such as speed, fuel level, etc."
  ],
  "trade": [
    "The exchange of goods, services, or information between two parties for mutual benefit.",
    "A market where people buy and sell things, such as stocks, commodities, or currencies.",
    "An occupation or skill in which someone is experienced or proficient.",
    "To engage in buying and selling, especially of goods, services, or information."
  ],
  "tradition": [
    "A custom, belief, or practice that has been passed down through generations and continues to be observed in a particular society or group.",
    "A well-established method, procedure, or way of doing something, often carried out without significant changes over time."
  ],
  "traduce": [
    "To speak falsely about someone, especially in order to harm their reputation.",
    "To attack or criticize someone's character or reputation, often using false information or exaggerations."
  ],
  "tragedy": [
    "A serious event, such as an accident or natural disaster, resulting in significant loss of life, property damage, or other disastrous consequences.",
    "A story with a sad or unhappy ending, often involving the downfall of a main character due to their own flaws, mistakes, or outside forces."
  ],
  "trajectory": [
    "The path that an object follows when moving through space, typically in a straight line or along a curved path.",
    "In mathematics, the graphical representation of how a function changes over time.",
    "A planned course or route to achieve a specific goal or outcome."
  ],
  "trajectorys": [
    "The path taken by an object moving in space, such as a projectile or a spaceship.",
    "A graphical representation of this path, often on a coordinate system.",
    "In science and engineering, a theoretical prediction of how something will change over time, especially concerning its motion.",
    "In statistics, the line showing the general trend or direction of data, usually represented by a regression line."
  ],
  "trammel": [
    "A device used to restrain, entangle, or limit movement, often made of ropes, chains, or wires.",
    "To entrap, restrict, or obstruct by means of such a device.",
    "In astronomy, an instrument used to measure the separation and motion of stars or other celestial bodies."
  ],
  "tramp": [
    "A person who walks from place to place without a specific destination, often for leisure or exercise.",
    "An informal term for someone who lives a vagrant or homeless lifestyle.",
    "A traveler who stays in different places for short periods and moves on frequently."
  ],
  "tranquil": [
    "Calm or peaceful, without agitation or disturbance.",
    "Serene, tranquil areas such as a lake or forest.",
    "Mentally composed and at ease; not anxious.",
    "Characterized by an absence of conflict or violence."
  ],
  "tranquility": [
    "A state of calmness, peacefulness, or serenity.",
    "Freedom from anxiety, agitation, or disturbance."
  ],
  "tranquilize": [
    "To calm or soothe (someone) by administering a sedative or tranquilizing medication, especially to reduce anxiety, fear, or agitation.",
    "To reduce the intensity of (an activity, process, or situation), making it more peaceful and undisturbed; pacify."
  ],
  "tranquillity": [
    "A state of calmness, peacefulness, or serenity; an absence of stress, agitation, or disturbance.",
    "The quality of being quiet and undisturbed, especially in a peaceful place.",
    "A condition of mental or emotional stability and harmony, free from anxiety or worry."
  ],
  "transatlantic": [
    "Relating to or across the Atlantic Ocean, often referring to travels, communications, or relationships between the Americas and Europe or Africa.",
    "A company or organization that operates in both North America and Europe or vice versa."
  ],
  "transcend": [
    "Go beyond; surpass in quality, ability, or status; exceed.",
    "Rise above or go beyond the limits of; overcome or surmount.",
    "Exceed in number, quantity, or degree; surpass.",
    "In mathematics and logic, a statement is transcendent if it cannot be proven using a given set of axioms."
  ],
  "transcended": [
    "To rise above, go beyond, or surpass a certain level, standard, or limit.",
    "To achieve a higher state of understanding or enlightenment through spiritual or intellectual practices.",
    "To pass over or beyond something, such as a barrier or obstacle."
  ],
  "transcendent": [
    "Surpassing ordinary experience, limits, or standards; exceptional or extraordinary.",
    "Rising above or going beyond the usual or expected level; superior in quality or ability.",
    "Going beyond the scope of everyday human experience; beyond comprehension or realization.",
    "Having a power or authority that surpasses others; supreme or ultimate."
  ],
  "transcendental": [
    "Going beyond ordinary human experience, understanding, or explanation; surpassing the normal range of human knowledge or comprehension.",
    "Of or relating to transcendent ideas or experiences; related to spiritual or philosophical concepts that are beyond everyday experience.",
    "(In mathematics) not dependent on the axioms of a particular system but valid for all systems in which the given conditions hold true, such as the fundamental axioms of geometry or algebra."
  ],
  "transcontinental": [
    "Extending, occurring, or lying across or between two or more continents.",
    "Involving, passing through, or affecting more than one continent.",
    "Relating to transportation systems, such as railways or highways, that span multiple continents or countries."
  ],
  "transcribe": [
    "To write down (speech, music, or text) from an original source in a written form, typically with the use of technology or other tools.",
    "To transfer the information from one medium to another, such as converting audio files into text format."
  ],
  "transcription": [
    "The process of converting a recorded speech or song into written form, often in a digital format.",
    "In biology, the synthesis of a complementary molecule of nucleic acid from a segment of nuclear DNA or RNA.",
    "In music notation, the act of writing down the pitches, rhythms, and other musical elements from an original score onto another medium, such as manuscript paper."
  ],
  "transference": [
    "The act of transferring something from one person, place, or thing to another.",
    "A psychological process in which feelings, behaviors, or patterns experienced with one person or thing are unintentionally directed towards another.",
    "In psychoanalysis, the redirection of unconscious impulses or conflicts from one object onto another.",
    "The movement of electrons between a donor and an acceptor material in a cell, creating electrical current."
  ],
  "transferred": [
    "Moved from one place, position, or situation to another.",
    "Handed over the responsibility, authority, or ownership of something to another person or entity.",
    "Credited or debited an amount from one account to another.",
    "Conveyed information or data between different systems, platforms, or formats."
  ],
  "transform": [
    "Change (something) completely by removing or altering its fundamental features, often in a way that improves it.",
    "Convert (electrical energy) into other forms such as mechanical, thermal, sound, or light energy.",
    "In mathematics and science, change the coordinates or variables of an equation or graph so that it describes a different quantity or system."
  ],
  "transgress": [
    "To go beyond a limit, rule, or law; to violate or disobey.",
    "To commit an offense against a religious or moral principle; to sin.",
    "To step across or over something, often symbolically or metaphorically."
  ],
  "transient": [
    "Temporary, lasting for a short period of time.",
    "A person or thing that is only present for a brief time before moving on or disappearing.",
    "In computer networks, a temporary user account that does not have access to certain resources.",
    "In medicine, referring to a condition that lasts for a limited time and then goes away."
  ],
  "transitory": [
    "Temporary, passing quickly; not lasting long.",
    "Short-lived; of brief duration or existence.",
    "Changing often or frequently shifting.",
    "Not permanent; able to change easily or without difficulty."
  ],
  "transparency": [
    "The quality of being easily seen through, as by having a clear or open appearance.",
    "Clear, honest, and open communication, especially in business, government, or relationships, so that there is no secret or hidden information.",
    "In data analysis, the ability to see how a value has been arrived at by showing all the underlying calculations and reasoning."
  ],
  "transpire": [
    "To come to pass; happen or occur",
    "To be revealed or made known indirectly",
    "(Of a liquid) pass through a porous material, such as the surface of a leaf, in small droplets",
    "(Of heat) be given off by a substance",
    "(In plants) pass out water vapor to the air from leaves, especially through tiny openings called stomata",
    "To happen or become known unexpectedly or unintentionally"
  ],
  "transport": [
    "The act of moving something or someone from one place to another, often using vehicles or machinery.",
    "A system or service that provides travel for people or goods between places, such as buses, trains, or airplanes.",
    "The natural process by which organisms move their eggs, sperm, or spores to other individuals for reproduction.",
    "In mathematics, a transformation that moves each point of an object in space to a new location without changing its shape or size."
  ],
  "transportation": [
    "The act or process of moving people, animals, or goods from one place to another by using vehicles such as cars, buses, trains, airplanes, or ships.",
    "A system or network that facilitates the movement of people and/or goods between locations, often through infrastructure like roads, railways, or airports.",
    "The field of study that focuses on the development, planning, and management of transportation systems to improve efficiency and accessibility."
  ],
  "trapezoid": [
    "A quadrilateral with one pair of parallel sides.",
    "An irregular quadrilateral that is not a rectangle, square, or parallelogram but has one set of opposite sides parallel to each other."
  ],
  "travel": [
    "The act of moving or going from one place to another, typically by a means of transportation.",
    "A journey, especially a long or foreign trip for pleasure or business purposes.",
    "A period spent away from home in a particular destination.",
    "To go or be taken on a journey, often involving visiting different places.",
    "The distance or area covered by the movement between locations.",
    "A series of experiences and observations gained through traveling.",
    "The business of arranging or providing transportation for people or goods.",
    "The movement or progression from one place to another, such as in an argument or discussion."
  ],
  "trawl": [
    "To draw or drag (a net, for example) through water to catch fish.",
    "To search thoroughly or systematically by using a specified method, especially in order to find something that is difficult to locate.",
    "A large fishing net drawn or dragged through the water to catch fish."
  ],
  "tray": [
    "A flat, usually rectangular dish, often with a rim, used to hold or display food, objects, or documents on various surfaces.",
    "(In electronics) a receptacle for holding and connecting electronic components such as integrated circuits or transistors in a circuit board."
  ],
  "treacherous": [
    "Dangerous or untrustworthy, often due to a deceptive appearance or unexpected dangers.",
    "Difficult to navigate or traverse, such as through rough waters or steep terrain.",
    "Characterized by betrayal or disloyalty, typically in the context of political or personal alliances."
  ],
  "tread": [
    "To walk or press down on a surface with your feet, typically while moving forward.",
    "The step or footprint made by a person or animal on a surface.",
    "A part of machinery that crushes or grinds materials by being pressed against a stationary part.",
    "One of the steps on a ladder, stairs, or escalator.",
    "To walk carefully or slowly over something, especially to avoid damaging it.",
    "To deal with something difficult or unpleasant in a careful and steady way."
  ],
  "treading": [
    "Walking, especially on a surface that is not solid or level.",
    "Moving forward by placing one foot in front of the other in a regular manner.",
    "Pressing down on something to make progress, as with walking on a soft material or climbing stairs.",
    "Using a machine's treadles to propel it, such as with a sewing machine or a threshing machine.",
    "Moving through water or other fluid by stepping or paddling."
  ],
  "treated": [
    "Subjected to a particular process, method, or procedure in order to modify, improve, preserve, or enhance its condition, quality, appearance, etc.",
    "Received or given care, attention, or management by a medical professional to alleviate symptoms, cure illnesses, or prevent diseases.",
    "Given an appropriate and systematic response from an automated system, program, or artificial intelligence, based on previously inputted information or trained patterns.",
    "Conducted or carried out according to established rules, principles, or guidelines, in order to achieve a desired outcome or result."
  ],
  "tree": [
    "A tall, woody perennial plant having a single elongated main stem with many branches at the top and leaves or needles at the tips of the branches, typically found in outdoor environments.",
    "A diagram used in computer science and other fields to represent hierarchical relationships between different elements.",
    "In some sports, such as golf or cricket, a term used to describe a score that is considered to be below average or expected."
  ],
  "tremble": [
    "Shiver uncontrollably, as from cold or fear.",
    "Tremble with emotion, such as fear or excitement.",
    "To vibrate or shake unsteadily.",
    "To cause something to tremble or quiver.",
    "Be filled with anxiety or uncertainty."
  ],
  "trembling": [
    "Shaking or quivering, often due to fear, cold, or weakness.",
    "Characterized by or causing a trembling motion or sensation.",
    "Marked by or expressing intense emotion, such as fear, worry, or anticipation."
  ],
  "tremendous": [
    "Extremely large, powerful, or impressive.",
    "Very strong or intense; having a great effect or impact.",
    "Having an overwhelming amount of something, such as energy, influence, or importance.",
    "Of great magnitude or extent, especially in size, strength, or force."
  ],
  "tremor": [
    "A slight shaking or trembling of something, such as a hand or a building.",
    "An earthquake or other ground movement that is too small to be classified as an actual earthquake.",
    "A sudden, brief movement or spasm, often associated with nerves or muscles.",
    "In electronics, a slight oscillation or fluctuation in voltage, current, or frequency."
  ],
  "trenchant": [
    "Sharp or keen, especially in expressing ideas or opinions with clarity and precision; incisive or biting.",
    "Cutting deeply or sharply; penetrating or perceptive; to the point.",
    "Well-defined or distinct, as a line or outline."
  ],
  "trend": [
    "A general direction in which something is developing or changing, often influenced by popular opinion or fashion.",
    "A noticeable increase or decrease in the frequency of something happening over a period of time.",
    "A pattern or movement that becomes popular and influences others.",
    "In finance and economics, an upward or downward tendency for prices or values to move within a specific market."
  ],
  "trepidation": [
    "A feeling of anxious uncertainty or apprehension, often due to fear of an uncertain outcome or possible danger.",
    "Nervousness or unease that often accompanies anticipating a challenging or difficult situation.",
    "Fearful hesitation or timidity in making decisions or taking action."
  ],
  "trespassing": [
    "Entering or remaining on someone else's property without their permission, which may lead to legal consequences."
  ],
  "tress": [
    "A series of horizontal bars used in gymnastics events, particularly on uneven bars for women and high bar for men.",
    "Any long rope or cable strung between supports to hold or suspend something, such as a telegraph wire or bridge cable.",
    "In heraldry, a vertical band or line across an escutcheon or other charge, as in the arms of certain families or corporations."
  ],
  "tribe": [
    "A group of people living in a specific area and sharing a common culture, language, or history",
    "A social or political organization based on shared interests or goals",
    "In computing, a collection of related computer programs that work together to perform a task"
  ],
  "tribulation": [
    "A state of great mental or emotional distress or difficulty.",
    "A prolonged period of misfortune or suffering.",
    "A series of hardships or problems that test one's resilience and endurance.",
    "(Roman law) A legal procedure by which property was divided among heirs."
  ],
  "tribunal": [
    "A court or panel of judges that hears and decides cases, especially in a country where there is no regular legal system.",
    "A court or group of people who have the power to make decisions about a particular subject or area of activity.",
    "A formal meeting where people argue about something important, especially because they disagree with each other's opinions."
  ],
  "tribute": [
    "An amount of money paid regularly to a government in return for protection, as by a vassal state.",
    "A sum of money given to someone in acknowledgment of their service or achievement.",
    "A sign of respect or admiration, often expressed through words, actions, or gestures.",
    "Something given as a mark of regard, appreciation, or thanks, such as an object, a piece of writing, or a performance."
  ],
  "trichotomy": [
    "The division of something into three parts, which may refer to a variety of subjects, including but not limited to:"
  ],
  "trill": [
    "A series of rapidly repeated notes, typically in birdsong, produced by rapidly alternating between two adjacent pitches.",
    "In music, a rapid alternation between two notes, often used as an embellishment or decoration.",
    "To cause something to vibrate or resonate, for example, by touching it with a feather or other object that creates friction.",
    "A fast, lively dance from the 18th century, also known as the country dance."
  ],
  "trilogy": [
    "A series of three works of art, literature, music, or films that are intended to be experienced together as a single unified whole.",
    "Three related books, movies, or plays, created by the same author or creator and meant to be enjoyed together."
  ],
  "trio": [
    "A group of three people, objects, or things.",
    "A musical composition for three performers or instruments.",
    "In sports, a match between two players or teams where each player or team competes in a different event.",
    "In mathematics, an ordered set of three distinct numbers or values."
  ],
  "trip": [
    "A short journey or excursion, typically involving travel to another place.",
    "An action of stumbling, causing one to fall or almost fall.",
    "A period of time spent on a particular activity or in a specific location.",
    "A sudden and brief lapse of memory or attention.",
    "A device used to trigger an alarm or alert system when activated."
  ],
  "triple": [
    "A number representing three, as in \"I have three apples.\"",
    "Three identical items grouped together, as in \"a set of triplets.\"",
    "A three-sided polygon or figure, as in \"an equilateral triangle.\"",
    "A serving of three times the normal size or amount, as in \"triple espresso.\"",
    "An arrangement of three objects in a symmetrical pattern, as in \"a triple arc.\""
  ],
  "trite": [
    "Overused, banal, or unoriginal; lacking in novelty or freshness due to frequent repetition.",
    "Predictable or cliché; lacking in creativity or innovation.",
    "Lacking in emotional depth or sincerity due to overuse or excessive familiarity."
  ],
  "triumphant": [
    "Celebrating a victory or success, often with great joy and enthusiasm.",
    "Emerging victorious in a competition or battle, typically after facing challenges or obstacles.",
    "Showing or expressing a feeling of pride, satisfaction, or accomplishment, especially as a result of achieving something difficult or significant."
  ],
  "troglodyte": [
    "A person or an animal that lives in a cave or a dark place.",
    "An ancient human species known for living in caves.",
    "A derogatory term used to describe someone who is unsophisticated, uncivilized or primitive."
  ],
  "trolley": [
    "A small cart on wheels, typically used to carry goods in a warehouse or store.",
    "A motor vehicle that runs on rails, used for public transportation in some cities.",
    "A device used to hold newspapers or other printed material for distribution."
  ],
  "tropical": [
    "Pertaining to regions near the equator, characterized by hot and humid conditions.",
    "Relating to or denoting a type of climate with high temperatures and rainfall.",
    "Of or pertaining to the Tropic of Cancer or Capricorn, imaginary lines on Earth's surface.",
    "In botany, describing plant life that thrives in tropical climates."
  ],
  "truck": [
    "A large vehicle used for carrying heavy loads or goods, often with an open back or trailer for easy loading and unloading.",
    "In some contexts, a pickup truck is a type of truck that has an enclosed cab for the driver and passengers but an open bed at the back for carrying cargo."
  ],
  "truculent": [
    "Aggressive, hostile, or threatening in behavior or attitude.",
    "Disposed to quarrel or fight; belligerent.",
    "Displaying a tendency to be argumentative or confrontational; contentious.",
    "Ready to attack or defend oneself with force if necessary; warlike."
  ],
  "truculently": [
    "In a hostile, unfriendly, or aggressive manner; with an air of defiance or belligerence.",
    "[No further definition]"
  ],
  "trumpet": [
    "A large, brass musical instrument with a long, coiled tube that produces high-pitched sounds when a player blows into it using a cup-shaped mouthpiece and special trumpet valves to control the pitch and tone.",
    "A person or thing that outperforms, overtakes, or surpasses others in a particular area or field, often in an unexpected or impressive manner."
  ],
  "trust": [
    "A confidence in the reliability, integrity, or ability of someone or something based on previous experiences or information.",
    "The responsibility placed on a trustee to manage property or money for beneficiaries according to specified directions.",
    "A company or corporation that holds assets, such as stocks or bonds, for its clients.",
    "In computing, an algorithm used to verify the authenticity and integrity of digital data or software.",
    "The act of believing in something without evidence or logical reasons, such as having faith."
  ],
  "try": [
    "Make an effort or attempt to do something; exert oneself to accomplish a task or achieve an objective.",
    "Test or examine (something) by using it in a particular situation, typically with the aim of discovering its qualities or limitations.",
    "A small platform or step in a church where the clergy stand during services.",
    "(In rugby and soccer) a period of play between two teams.",
    "(In archaic use) A prison; jail."
  ],
  "tuck": [
    "Fold (a piece of clothing) under or in so as to neaten an edge or make it less bulky.",
    "Draw (something, such as a bedcover or tablecloth) up and tuck it around or under something else.",
    "Tighten the laces of a shoe, boot, or other item by pulling them snugly around or through eyelets.",
    "Fold (a piece of food, typically pastry) over to enclose a filling.",
    "Bend and fasten the edges of (a flag) in order to make it hang more neatly when hoisted.",
    "Tuck into: To eat heartily or greedily of something, as if one is tucking in one's shirt or clothes before starting work."
  ],
  "tulip": [
    "A type of perennial herbaceous plant in the genus Tulipa, belonging to the lily family Liliaceae.",
    "A flower that is cup-shaped and typically has six petals that can come in a variety of colors including red, yellow, pink, and white.",
    "A symbol often used to represent perfect beauty or imperial power, especially in Ottoman Turkey during the Ottoman tulip era."
  ],
  "tulle": [
    "A lightweight, net-like fabric made from silk or nylon, often used in clothing and accessories, especially in bridal wear for veils or tutus for ballet dancers."
  ],
  "tumbled": [
    "Rolling, tumbling or turning over in a carefree manner, often used to describe the movement of animals or objects. For example, \"The puppy tumbled across the floor, chasing its tail.\"",
    "Describing an action or event that has come to a sudden and unexpected end, as if falling apart or collapsing. For instance, \"The tower tumbled after the earthquake.\"",
    "A term used in knitting or crochet to describe the process of loosening stitches so they lie flat when worked on a round shape. This can also apply to other crafts such as basket weaving or pottery making. Example: \"After tumbling the stitches, the hat began to take its final form.\""
  ],
  "tumescent": [
    "Swollen or enlarged, especially as a result of engorgement with blood or other fluid.",
    "An adjective used to describe a substance or medication that causes such swelling or engorgement."
  ],
  "tumult": [
    "A noisy, confused commotion, disturbance, or uproar.",
    "A state of great disorder, confusion, or agitation.",
    "A sudden, violent disturbance in a group of people, often involving angry protests or demonstrations.",
    "An intense emotional outburst or strong reaction."
  ],
  "tumultuous": [
    "Marked by disorder, confusion, or dissent; turbulent.",
    "Characterized by violent conflict, struggle, or agitation.",
    "Full of commotion, uproar, or disturbance.",
    "(Rare) Causing or characterized by great emotional turmoil or excitement."
  ],
  "tuna": [
    "A type of fish that can be found in warm waters worldwide, valued for its meat which is a popular food source. It is known for being high in protein and low in fat. The most common species of tuna are the yellowfin, bigeye, albacore, and bluefin tuna.",
    "The meat of the tuna fish, often canned and used as a convenient protein source in many cuisines around the world. It is available in various forms like chunk light or solid white, and may be flavored with oil or water.",
    "(verb) To cook or preserve using heat, typically referring to canning tuna meat for storage and consumption. This process involves heating the tuna at a high temperature to sterilize it, then sealing it in an airtight container to preserve its freshness."
  ],
  "tune": [
    "Adjust the pitch or frequency of a musical instrument by tightening or loosening its strings, adjusting the position of its reeds, or otherwise altering its sound production mechanism.",
    "Adjust the settings of an electronic device or software to optimize its performance, such as fine-tuning a radio receiver to pick up a station more clearly.",
    "Arrange words into lines and stanzas for a poem, song lyrics, or other text intended to be read rhythmically.",
    "Alter the timing or pacing of an activity or event, such as changing the schedule of a meeting to allow for more time.",
    "Set a specific musical key or mode for a composition, melody, or performance, so that all parts are harmonized accordingly.",
    "In electronics and communication systems, adjust the parameters of a circuit or network to achieve desired performance characteristics, such as signal amplitude, frequency response, or phase alignment."
  ],
  "tunic": [
    "A loose-fitting, sleeveless garment worn by men, women, or children, covering the body and reaching halfway down the legs; also known as a shirtdress.",
    "A simple garment made of one piece of fabric wrapped around the body and secured with a cord or ribbon, typically worn in ancient times.",
    "In botany, a protective layer that covers and protects the stem of a plant from damage or disease."
  ],
  "tunnel": [
    "An underground passage or channel, usually enclosed, which allows transportation, utility lines, or other services to pass beneath an obstacle such as a road, river, or hill.",
    "A covered walkway, often for pedestrians, that passes through a mountain or under a street.",
    "To dig or bore through a surface in order to create a tunnel."
  ],
  "tunnels": [
    "An underground passage, often constructed for various purposes such as transportation, water supply, or military uses, which is typically long and straight, and usually created by excavating or boring through a mountain, hill, or other solid formation."
  ],
  "turbulence": [
    "A state of agitation, disorder, or confusion.",
    "A disturbance in an air mass characterized by sudden changes in air speed and direction which can cause discomfort, annoyance, or danger to passengers on board aircraft.",
    "An economic term referring to fluctuations or instability in financial markets.",
    "In fluid dynamics, the movement or irregularities of a fluid, such as water or air, often characterized by eddies or whirlpools."
  ],
  "turbulent": [
    "Characterized by sudden, rapid changes in direction, motion, or circumstances; chaotic or unstable.",
    "Marked by intense emotional disturbance or upheaval.",
    "Relating to a type of fluid flow where the eddies and currents are large in scale compared to the fluid viscosity, resulting in significant turbulence."
  ],
  "turmeric": [
    "A bright yellow, aromatic spice made from the dried root of the Curcuma longa plant that is commonly used in Indian cuisine and has anti-inflammatory properties.",
    "A key ingredient in many traditional dishes, particularly those from India, providing both flavor and vibrant color."
  ],
  "turn": [
    "A change of direction, movement, or course.",
    "A complete revolution around a center or axis; a full circle.",
    "An opportunity to do something, such as a person's chance to speak, act, or have a go at an activity.",
    "The time when someone has to work or be responsible for something, like a job or task.",
    "A piece of work or assignment given to someone, often in turn with others.",
    "A twist, bend, or curve in an object or path.",
    "A transformation from one form, state, or condition into another."
  ],
  "tusk": [
    "A long, pointed canine tooth in the mouth of certain mammals such as elephants, walruses, or wild boars, which is used for fighting or digging.",
    "A musical instrument with a brass or copper body and multiple tubes that produce sound when the air is blown through it, also known as a \"trumpet\" or \"horn.\""
  ],
  "tutelary": [
    "Relating to or serving as a guardian or protector, such as a deity or spirit that is believed to watch over a particular place or group of people.",
    "Serving in a supervisory or guiding role, such as a tutelary figure who provides guidance or direction to another person or entity."
  ],
  "tutor": [
    "A person who provides one-on-one academic guidance, support, or instruction to a student outside of regular classroom settings.",
    "An experienced individual who assists learners in gaining knowledge and skills through personalized teaching methods.",
    "A teacher or educator responsible for the academic progress of students enrolled in a tutoring program."
  ],
  "twang": [
    "A sharp, high-pitched sound produced by a bowed stringed instrument, such as a violin or cello.",
    "The distinctive tone or resonance of a particular musical instrument, especially one with strings.",
    "A quick, sharp movement or action, often associated with pulling on a stretched object like a rubber band or wire."
  ],
  "twelfth": [
    "The ordinal number that comes after eleventh and before thirteenth in a sequence, representing one of every twelve items or parts.",
    "One of the twelve months in the year that is neither January nor March, following November and preceding February; also known as December (the name originates from Latin \"decem\" meaning ten, and \"mensis\" meaning month)."
  ],
  "twelve": [
    "A cardinal number following eleven and preceding thirteen, representing a quantity of twelve units.",
    "In baseball, a pitcher retires three batters on nine pitches or fewer in an inning; also called a \"quick hook.\"",
    "A size designation for clothing, particularly in European sizing, which indicates a person's chest measurement being between 38 and 40 inches."
  ],
  "twenty": [
    "An even number that comes after nineteen and before twenty-one in counting.",
    "A cardinal number representing this amount (e.g., there are twenty apples on the tree).",
    "A digit used as a placeholder for numbers between one hundred and two hundred (e.g., 120 is written as 120, not 110 or 130)."
  ],
  "twine": [
    "A long, flexible, and often pliable material such as cord, rope, wire, or thread that can be wound around objects or used to tie things together.",
    "The act of winding or wrapping something tightly around an object using twine.",
    "To bind, fasten, or secure two or more items together by wrapping them with twine."
  ],
  "twirl": [
    "To spin or whirl around, usually with a quick, circular movement, as in spinning a stick on its tip or twirling one's hair.",
    "(In figure skating) A rotation on the same axis made by both skates at the same time, where the free leg is lifted and the skater rotates around it."
  ],
  "twirled": [
    "To spin or cause an object to rotate rapidly and repeatedly on its own axis; as in \"She twirled her pen between her fingers.\"",
    "To move or cause someone/something to move in a continuous circular motion, often for decorative purposes; as in \"The dancer gracefully twirled across the stage.\""
  ],
  "twist": [
    "A sudden, sharp turn or bend in an object or path, causing it to change direction.",
    "A spiral, helix, or coil shape, such as the shape of a twisted rope or piece of wire.",
    "A change in direction or meaning, often unexpected or surprising; a twist in a story, conversation, or situation.",
    "A decorative knot, braid, or entwining of materials, such as in a woven fabric or macramé.",
    "To manipulate or shape something by twisting it, such as when tying a knot, making a pretzel, or forming pottery."
  ],
  "twit": [
    "A person who is considered foolish or silly, often due to their actions or comments.",
    "In the context of social media platforms like Twitter, a user may refer to someone as a \"Twit\" if they are posting trivial or irrelevant content.",
    "An annoying or irritating person, particularly one who talks excessively and without much thought or consideration for others."
  ],
  "twitch": [
    "A brief, involuntary muscle spasm causing rapid, repeated contraction and relaxation.",
    "The act of moving or pulling something suddenly and forcefully with a quick movement.",
    "A small piece of metal or wire that can be used to fasten fabric together or attach it to another material.",
    "A short, sudden movement of the eyes from one side to another, often involuntary."
  ],
  "two": [
    "A number that follows one and is preceded by three.",
    "The quantity of two items or units, for example \"I have two apples.\"",
    "Two-dimensional space or area, like in the phrase \"the picture has two dimensions.\"",
    "One of the main vowel sounds in many languages, typically represented with the letter 'u' as in \"bunny\" or \"tube\".",
    "As a numerical value, it could be used to indicate the position, such as \"the second from last item on the list is two.\"",
    "In card games, two of a kind means having two cards of the same rank but different suits.",
    "In music, a two-step rhythm is a common and basic pattern.",
    "In sports, a player or team could be described as playing \"two-on-one,\" meaning they are outnumbered by their opponents.",
    "In some programming languages, the number 2 is used as a flag to indicate a certain option has been chosen (e.g., \"press 2 for Spanish\")."
  ],
  "two-sided": [
    "Having or relating to two distinct sides or aspects.",
    "Involving or affecting both parties in a situation, such as in communication or negotiation.",
    "Relating to a platform or service that allows users to interact with each other, such as social media or a marketplace."
  ],
  "tympanum": [
    "A small opening or window in a building, typically round or oval-shaped and usually found in ancient Roman architecture.",
    "The tympanic membrane, also known as the eardrum, which separates the outer ear from the middle ear and is responsible for transmitting sound vibrations to the inner ear."
  ],
  "typographical": [
    "Pertaining to typeface, printing, or the arrangement of letters, words, or symbols on a page.",
    "Involving errors or inconsistencies in formatting or spelling due to errors in typesetting or proofreading.",
    "Relating to the design and layout of written material, such as books, magazines, or websites."
  ],
  "tyranny": [
    "A cruelly harsh regime or government where one person has absolute power over others, often using force to take away their rights and freedoms.",
    "The exercise of arbitrary and autocratic rule by a cruel and unjust ruler.",
    "A system in which the person holding power can do anything they want without regard for laws or people's rights."
  ],
  "tyrant": [
    "A person who exercises ruthless control, especially one who oppresses his people or country in an autocratic manner.",
    "An unreasonable or overbearing person in authority or with power.",
    "In ancient Greece, a ruler of a city-state, typically appointed by the death of its previous ruler, whose powers were not limited by law or constitution.",
    "(In context) A government or leader that rules with force and without regard for the rights or wishes of its people.",
    "(In context) An individual who is extremely controlling or authoritative in a specific situation or relationship."
  ]
}