{
  "waddle": [
    "A clumsy, ungainly walk, typically with short, wobbly steps and legs spread wide apart, often seen in birds such as ducks or geese when walking on land due to their heavy bodies and relatively small wings, or sometimes exhibited by humans when carrying a heavy load or moving through deep snow.",
    "A large, flat-bottomed boat with a square stern and rounded bow, used for fishing and transporting goods in coastal waters."
  ],
  "wade": [
    "Walk through water, especially deep enough to submerge the lower part of one's body.",
    "Enter or become involved in (a difficult or complicated situation) gradually, by careful consideration and analysis of the issues involved.",
    "(of a vehicle or aircraft) enter or become caught in (soft ground or mud)."
  ],
  "waffle": [
    "A type of baked pastry made from a batter, typically consisting of two thin layers of squares that are griddled to create a characteristic pattern on both sides.",
    "A light, porous material made by whipping air into a mixture and then cooking it until set. Used for coating or filling.",
    "A surface having a honeycomb-like structure formed by numerous small, square, or rectangular cells, often found in architecture, art, or nature."
  ],
  "waft": [
    "To move gently and lightly through the air; to be carried on a current of air. For example, \"The sweet scent of the flower wafted across the garden.\"",
    "(Archery) To send an arrow in flight by force of the bowstring alone. For example, \"He carefully wafted his arrow into the target.\""
  ],
  "wafting": [
    "The act of moving gently and smoothly through the air, often referring to lightweight objects such as leaves or fragrance particles.",
    "A soft, gentle breeze carrying the scent of something nearby, creating an enjoyable and subtle aroma experience.",
    "An action of softly sweeping or brushing something across the surface, like a feather lightly grazing an object."
  ],
  "wag": [
    "A person who moves their body, especially their hips, in a lively or energetic way, often to music.",
    "To tease or make fun of someone in a playful or good-natured manner.",
    "An informal term for a type of fastener used to attach two objects together, such as a bolt or screw."
  ],
  "waggery": [
    "Nonsense talk or behavior, especially when intended to be funny.",
    "A humorous or satirical writing that is intended to amuse the reader.",
    "Mischievous or playful behavior, often involving practical jokes or pranks.",
    "A jesting or mocking tone in speech or writing.",
    "Humorous or ironic expressions used to express disbelief or sarcasm."
  ],
  "waif": [
    "A young child or person, especially one who is homeless or has no parents to care for them.",
    "A thin or fragile-looking person, typically a young woman.",
    "In the context of gaming or roleplaying, a character with low hit points, appearing weak and vulnerable."
  ],
  "wail": [
    "To cry out with loud, sorrowful crying sounds, usually from pain or grief.",
    "To make a prolonged, mournful sound, typically associated with dogs howling or sirens waiting.",
    "To complain or protest loudly and noisily; to gripe."
  ],
  "wait": [
    "To remain in a place or position without moving, especially in order to allow someone else to pass or to be served first.",
    "To delay one's action, decision, or response until a specified or indicated time or until certain conditions are met.",
    "To pause or stop an activity, process, or event until a specified or indicated time or until certain conditions are met.",
    "To endure or tolerate something unpleasant or difficult until it is possible to do something about it."
  ],
  "walk": [
    "A mode of human locomotion in which the heel, toes, and ball of the foot are successively placed on the ground and move forward, with each step being called a stride.",
    "An act or instance of walking a certain distance, especially for exercise or leisure.",
    "To go or cause to go at a regular pace by steps, as in walking up or down stairs.",
    "A route or path taken while walking, such as a nature trail or city walk.",
    "A journey or trip on foot, typically for pleasure or sightseeing rather than transportation.",
    "To examine or inspect something carefully and slowly, as if walking it over with one's eyes."
  ],
  "walked": [
    "Past tense of the verb \"to walk\" indicating that someone was walking before, but is not currently walking. For example, \"Yesterday, I walked to the store.\"",
    "A way of traveling on foot, usually at a leisurely pace. For instance, \"She took a walk in the park.\"",
    "Moving or going along a path, route, or road by walking. Like, \"We walked through the city streets.\"",
    "To move or cause to move along by steps or measures, metaphorically. As in, \"He tried to walk her through the instructions, but she was still confused.\"",
    "(In certain sports) Advance or be propelled along with little or no effort. Such as, \"The football player walked into the end zone.\""
  ],
  "waltz": [
    "A type of dance characterized by graceful, flowing movements and a specific tempo, typically performed in pairs with one person leading and the other following.",
    "A musical composition written specifically for this dance style, featuring a rhythm that is suitable for waltz dancing."
  ],
  "wander": [
    "To move about aimlessly, often in a slow or leisurely manner without a clear destination or purpose.",
    "To travel from one place to another, usually on foot, exploring and discovering new places along the way.",
    "To roam or ramble, especially in a natural or picturesque setting.",
    "To move or act in an unpredictable or uncertain manner; be uncertain or unclear about something."
  ],
  "want": [
    "A feeling of lack or need for something, often implying a desire to possess it. For example, \"I want a new bike.\"",
    "To desire or wish for something; to have a strong inclination towards something. For example, \"She wants to become a doctor.\"",
    "To lack or be without something necessary or desirable. For example, \"The store wants more stock.\""
  ],
  "wanton": [
    "Acting in a reckless or heedless manner, without regard for others.",
    "Engaging in unrestrained or unrestrained behavior; uncontrolled.",
    "Showing no respect for something; treating it with disregard.",
    "Involving or resulting from an impulsive act or decision.",
    "Having a sensual or lustful nature.",
    "Describing something that is extravagant and unnecessary, especially in terms of design."
  ],
  "warm": [
    "Describing a temperature range between mildly hot and cool, generally above room temperature but below boiling point.",
    "Relating to or causing the sensation of gentle heat or comfort on the skin.",
    "Expressing sympathy or understanding towards someone in distress.",
    "To make something warm or provide warmth to it."
  ],
  "wary": [
    "Careful and cautious, especially because of previous bad experiences.",
    "Watchful and alert, always on guard against possible danger or threat.",
    "Not readily trusting or easily convinced; skeptical.",
    "Uncertain or hesitant due to lack of information or fear of making a mistake."
  ],
  "was": [
    "Was is a conjugation of the verb \"to be\" in the simple past tense, used to express a state or condition that was true at a previous time. For example, \"I was happy yesterday.\"",
    "Was can also be used as an auxiliary verb with other verbs in the passive voice to indicate the subject of the sentence underwent the action. For example, \"The report was written by John.\"",
    "In some cases, was can be used to express a state or condition that existed prior to another state or condition, such as in comparative constructions. For instance, \"She was taller than her sister.\""
  ],
  "wasp": [
    "A stinging insect with a slender body, narrow waist, and wings that belongs to the Hymenoptera order, known for its ability to build intricate nests or live in pre-existing structures."
  ],
  "wasps": [
    "Insects belonging to the order Hymenoptera, characterized by their slender body, narrow waist, and elongated wings; they can be predators or parasites of other insects and are known for their ability to sting repeatedly."
  ],
  "watch": [
    "An instrument that tells the time, typically with hands on a face showing the hours and minutes, and often having a waterproof case for wearing on the wrist.",
    "To keep an eye on someone or something in order to observe their behavior or prevent any possible problems.",
    "A period of time during which an event or activity takes place.",
    "A group of people who attend a public meeting, especially for the purpose of observing and possibly reporting on its proceedings."
  ],
  "water": [
    "A colorless, odorless, and tasteless liquid that is vital to all forms of life as it serves as a solvent for various substances and plays an essential role in many biological processes.",
    "A chemical compound with the formula H2O, which consists of two hydrogen atoms covalently bonded to one oxygen atom.",
    "A natural substance that occurs in rivers, lakes, oceans, and other bodies of water, providing a habitat for aquatic life forms and supporting ecological systems.",
    "An important resource used for agricultural, industrial, and domestic purposes such as irrigation, manufacturing, and hygiene.",
    "A term used to describe various types of liquid mixtures that have similar properties to pure water but may contain dissolved substances or be slightly acidic or alkaline (e.g., distilled water, mineral water, rainwater)."
  ],
  "waterfall": [
    "A natural feature where a river or stream descends over a steep drop or cliff, forming a continuous flow of water over the edge.",
    "(In computing) A programming method in which code is developed to run in a sequential manner without interruption until completion before moving on to the next section, similar to a waterfall flowing downwards."
  ],
  "wave": [
    "A series of rising and falling water motions that move across a surface, such as an ocean, lake, or river.",
    "A form of energy that travels through space as a disturbance or variation in a field, such as electromagnetic waves.",
    "A group of people who support a particular cause, team, or idea and publicly demonstrate their enthusiasm or approval for it.",
    "An undulation or ripple on a surface, like the movement created by a rock thrown into water or a flat piece of metal struck by a hammer.",
    "A movement or series of movements in which people dance, often to music with a rhythmic beat."
  ],
  "waves": [
    "Large bodies of water, especially in shallow areas near a shoreline, that move back and forth as they are pushed by wind or other forces.",
    "A disturbance or movement that travels through space or matter, such as sound waves or electromagnetic waves.",
    "A series of movements or actions that occur in regular, repeating patterns, like the rise and fall of a flag or the fluctuating prices of stocks.",
    "(In music) a recurring pattern of notes or chords, often forming the basis of a composition."
  ],
  "way": [
    "A method or manner of doing something; a means, approach, or procedure.",
    "A road, path, or route along which one may travel, especially on foot or by vehicle.",
    "A journey or trip, particularly to an unknown destination.",
    "A large open space, often with grass or trees, in which people can relax and enjoy the outdoors.",
    "A distance or degree of separation; a difference between various groups or ideas.",
    "An extent or measure, especially of time, distance, or amount."
  ],
  "we": [
    "A pronoun used to refer to a group that includes the speaker and one or more others, as in \"We are going to the store.\"",
    "In mathematics, a term representing a set of numbers or objects; the sum or product of two or more numbers or groups of numbers."
  ],
  "wear": [
    "To put on and keep on clothes, garments, or other items that cover, protect, or embellish the body; clothe oneself.",
    "To cause something to become thin, frayed, or damaged through use or exposure; see also: 'wear out'.",
    "To show the effects of age, use, or strain; appear tired or exhausted; also, to make someone or something look this way.",
    "To carry or display an object on one's person, typically for a specific purpose or as a sign of status.",
    "Informal: To express or demonstrate emotion, concern, or patience, especially in a trying situation.",
    "Figuratively, to cause something to become less effective or relevant over time; also, to experience a gradual decline or change in condition."
  ],
  "weariness": [
    "A feeling of tiredness or fatigue, often due to extended physical or mental exertion.",
    "A state of exhaustion caused by continuous effort without rest.",
    "The act of showing signs of fatigue or being weary.",
    "A general sense of being drained or depleted."
  ],
  "wearying": [
    "Causing a feeling of exhaustion, weariness, or fatigue.",
    "Tending to become monotonous or tiresome, especially when repeated frequently."
  ],
  "weather": [
    "The natural conditions of the atmosphere (such as temperature, wind, humidity, and precipitation) in a particular place at a specific time.",
    "The state or condition of the atmosphere (clear, cloudy, rainy, snowy, etc.) over a period of time.",
    "An event or occurrence related to changes in the environment caused by atmospheric conditions, such as storms, hurricanes, or heatwaves."
  ],
  "web": [
    "A network of interconnected things, such as a spider's silk strands used to catch insects or an intricate system of pathways.",
    "The collection of all interconnected websites on the internet, providing information and services to users."
  ],
  "wednesday": [
    "A day of the week that comes after Tuesday and before Thursday in the seven-day cycle. It is represented by the numeral \"3\" or the Roman numeral \"III\" and is also referred to as \"Wednesday\". It is the fourth day of the week according to the historical Western view, where Sunday is considered the first day of the week."
  ],
  "week": [
    "A period of seven days, often used as a unit to measure time in daily life.",
    "(In astronomy) A unit of time equal to 7 Earth days, used to describe the rotation period of celestial bodies or the length of a day on other planets.",
    "(In finance) A common period for which financial instruments such as bonds are issued and paid.",
    "(In sports) A week's worth of competition in certain leagues or tournaments, where teams play one game each against every other team within that week."
  ],
  "weekly": [
    "Occurring or done once every week.",
    "Pertaining to or adapted for weekly use or publication.",
    "An item that is sold, published, broadcast, or produced on a weekly basis.",
    "A schedule or routine planned or carried out once a week."
  ],
  "weighs": [
    "To determine the weight of something by placing it on a scale or balance.",
    "To have a particular amount of physical force exerted upon an object, often measured in kilograms or pounds.",
    "To give serious consideration to something; to consider carefully the pros and cons of an issue."
  ],
  "weight": [
    "The measure of the heaviness or mass of an object, usually measured in grams or kilograms for small items, and pounds or kilograms for larger items.",
    "A burden that is carried on one's back or by a pack animal, often consisting of materials needed for daily life.",
    "The amount or degree of significance or influence of something.",
    "In computing and data storage, the relative importance given to each element in a system based on specific criteria.",
    "A problem or concern that is difficult to overcome or solve."
  ],
  "well": [
    "In good health; robustly, \"I feel well today\"",
    "With sufficient knowledge, skill or understanding, \"He did well in his exams\"",
    "To a considerable degree, \"He speaks English very well\"",
    "At or to the desired depth, \"Drill the well until you reach the water table\"",
    "A sunken or hollow area, typically filled with water, \"There is a well by the side of the road\"",
    "A source of information or inspiration, \"I'll look into it for more wells of information\"",
    "In a manner suitable to the circumstances, \"She handled the situation very well\""
  ],
  "went": [
    "Past tense of the verb \"to go\" or \"to proceed\". For example, \"Yesterday, I went to the store.\" or \"We went for a walk in the park.\"",
    "(Slang) An expression used to indicate agreement or confirmation. For example, \"Did you finish your homework?\" \"Yep, went!\"",
    "In sports, it refers to an action of the ball or puck crossing the goal line or net, resulting in a point for the team. For example, \"The player's shot went into the net, scoring a goal.\""
  ],
  "were": [
    "Indicates a past form of \"be\" in the plural, used for people or things; for example, \"they were happy\" means that the group of individuals was happy in the past.",
    "In combination with auxiliary verbs and main verbs, it is used to create questions about the state or condition of something in the past; for example, \"were you not?\" can mean \"weren't you?\".",
    "Can be used with adjectives to form comparative and superlative forms; for instance, \"taller were we,\" meaning \"we were taller.\"",
    "Rarely, it is employed in poetry or dramatic texts to represent a person's thoughts, feelings, or speech from the past, especially in dialogue or soliloquies."
  ],
  "west": [
    "The cardinal direction that lies opposite to east, representing a point on the horizon or the side of an object facing away from the east.",
    "A region or area located towards the west, as in \"She lives in the western part of the country.\"",
    "West (n.) - a proper name used for various things related to this direction or location such as: West (direction), West (wind), West (U.S. region).",
    "West (adj.) - used to describe something that belongs to or comes from the west, as in \"She wore a traditional western outfit.\"",
    "West (adv.) - used to indicate movement towards the west, as in \"They went west after the gold rush.\""
  ],
  "wet": [
    "Having been soaked with water, liquid, or other moisture",
    "Relating to, characterized by, or containing a lot of moisture, such as wet soil or a wet towel",
    "Involving or relating to water sports, activities, or environments, such as scuba diving in the ocean or skiing on wet snow",
    "Not dried out; saturated with liquid, such as a wet sponge or a wet piece of paper",
    "Not being dry; having moisture present; damp, as in \"The ground is wet after the rain.\"",
    "Covered or soaked by water, such as a wet sidewalk after a heavy rainfall",
    "Describing a person who has been rained on or just come out of the bath or pool, for example."
  ],
  "whale": [
    "A large marine mammal with a streamlined body, adaptable to diverse aquatic environments, characterized by its horizontally flattened tail used for propulsion through the water.",
    "Any of various related marine mammals, such as porpoises or dolphins, often considered collectively under the term \"cetaceans.\"",
    "A large, intelligent marine animal with a blowhole on top of its head that can hold its breath for long periods and is capable of deep diving to find food."
  ],
  "whales": [
    "Large marine mammals with streamlined bodies, a horizontal tail fin, baleen plates instead of teeth for filtering food from water, and blowholes to breathe air through the surface. They belong to the infraorder Cetacea, which includes suborders Mysticeti (baleen whales) and Odontoceti (toothed whales). Examples include humpback, blue, sperm, right, and orca whales."
  ],
  "wharf": [
    "A structure built along a shore, typically made of wood or concrete, where ships can dock to load or unload cargo.",
    "A platform projecting from the shore and used as a landing place for boats or ships."
  ],
  "what": [
    "A question word used to ask about something not known or identified, often at the beginning of a question (e.g., \"What is your name?\")",
    "A relative pronoun, used to introduce a clause that specifies what has been previously mentioned (e.g., \"I want the book that you are reading.\")."
  ],
  "wheat": [
    "A cereal grain, Triticum aestivum, widely cultivated for its starch endosperm which is a significant source of carbohydrates in the human diet.",
    "The plant itself, characterized by its tall stature and golden-brown kernels enclosed within a protective husk.",
    "A term often used to refer to different types of wheat used for various purposes, such as hard wheat (durable and ideal for bread) or soft wheat (used for cakes and pastries).",
    "In the context of farming, it refers to the process of growing and harvesting this grain crop."
  ],
  "wheedle": [
    "To persuade someone by flattery, cajolery, or constant nagging; to coax or cajole in a persistent manner.",
    "(Obsolete) To tease or torment playfully."
  ],
  "wheelbarrow": [
    "A tool with a platform and handles, used to carry heavy objects by rolling it on its wheel or wheels."
  ],
  "wheelwright": [
    "An artisan who constructs, repairs, or maintains wooden wheels and wheeled vehicles.",
    "A person skilled in carpentry and woodworking who specializes in the creation of wheels for carts, wagons, and other transportation devices.",
    "A craftsman from the past who was responsible for designing, shaping, and assembling wooden wheels, using traditional tools and techniques."
  ],
  "when": [
    "At what time, occasion, or point.",
    "As soon as a specified condition or situation arises.",
    "During a particular period of time.",
    "In the event that; if (often used in conditional statements)."
  ],
  "which": [
    "used to introduce a relative clause that identifies or specifies an antecedent in context (e.g., \"The book which I borrowed is on the table.\")",
    "used to introduce a subordinate clause, providing additional information or explanation about a preceding word or phrase (e.g., \"She didn't know which way to go.\")"
  ],
  "while": [
    "A word used to indicate a contrasting condition or action in a clause, typically \"not while I am doing this.\"",
    "A short wooden bar with a hook on either end for holding up window curtains.",
    "A connective tissue that supports and holds together body parts or organs.",
    "A unit of time equal to one minute (60 seconds).",
    "A part of a machine, such as a engine or generator, where the energy conversion takes place."
  ],
  "whim": [
    "A sudden, unpredictable or capricious desire, impulse, or fancy that motivates a person to act in a certain way.",
    "An arbitrary or fanciful idea that seizes a person and influences their actions for a short period of time.",
    "An inclination or decision based on a feeling rather than reason or practicality."
  ],
  "whimsical": [
    "Characterized by playful, fanciful, or unpredictable behavior or ideas; capricious.",
    "Showing a lighthearted humor; amusing and often nonsensical.",
    "Expressive of an individual's personal and subjective viewpoint or opinion, not necessarily based on rationality or logic."
  ],
  "whimsicality": [
    "A quality of being playful, imaginative, or fanciful, often showing a light-hearted or capricious behavior.",
    "The state or condition of acting or influenced by whim or caprice, exhibiting sudden and unpredictable changes in mood or behavior."
  ],
  "whine": [
    "To complain repeatedly in a high-pitched, whiny voice, often due to frustration or dissatisfaction.",
    "A high-pitched, whining sound produced by an engine, machine, or animal, typically caused by friction or mechanical issues.",
    "A small container with a narrow neck, used for carrying or storing liquids.",
    "To cry or make a noise in a high-pitched, whiny way, often due to pain or discomfort.",
    "(Slang) A person who constantly complains or expresses dissatisfaction."
  ],
  "whining": [
    "A high-pitched, continuous, or repeated sound produced by an engine that is not operating properly, indicating a problem such as low oil pressure or a loose belt.",
    "The act of complaining repeatedly and excessively about minor issues or situations, often in a whiny tone.",
    "A term used to describe the sound made by certain animals, particularly dogs, that can be high-pitched and persistent."
  ],
  "whip": [
    "A long, flexible rod used to encourage horses to move faster or in a specific direction, often with a lash at one end for added incentive.",
    "An officer of a legislative body, especially the U.S. House of Representatives, who is responsible for maintaining order and discipline among members.",
    "A device that allows the user to quickly move a piece of paper or other flat object from one location to another by grasping an edge and snapping it back into place.",
    "A person who exercises authority, as in organizing or controlling something.",
    "In the sport of cricket, a player designated as the team captain, who leads the side and makes tactical decisions."
  ],
  "whirl": [
    "A rapid rotation or spinning movement; spin, twist, or revolve.",
    "A group of whirling waters, as in a river or the sea, usually due to underwater currents or wind-driven waves.",
    "To move or cause to move swiftly and in a circular path around an axis."
  ],
  "whirlwind": [
    "A rapidly rotating column of air that has a narrow, funnel-shaped form and is usually associated with severe weather, such as tornadoes or waterspouts.",
    "An event, period, or situation characterized by rapid, intensive activity; a sudden, hectic flurry of events or changes.",
    "A person or thing moving rapidly or changing suddenly in a short time."
  ],
  "whiskers": [
    "Long, thin hair or bristles growing from the face of certain animals, especially cats.",
    "A nickname for a person with facial hair, such as a mustache or beard.",
    "A slang term for binoculars, possibly due to their resemblance in shape and function."
  ],
  "whisper": [
    "A very soft or quiet sound made by the air rushing past the vocal cords and out of the mouth, often used to convey a secret message without attracting attention."
  ],
  "whispered": [
    "Spoke in a very soft voice, barely audible.",
    "Transmitted information in a secretive or furtive manner.",
    "Communicated privately and quietly to avoid being overheard."
  ],
  "whispers": [
    "A very quiet or soft sound made by air passing over or past something, often too low to be easily heard.",
    "An act of speaking or expressing something in a very soft voice so that only nearby people can hear it.",
    "Quiet, subtle, and indirect communication or suggestions.",
    "Something said or done in secret or private manner, especially because it's improper or embarrassing.",
    "A gentle, barely perceptible movement of air or breeze.",
    "(In a digital context) Refers to the quiet or low-level noise that is always present in electronic circuits or systems."
  ],
  "whistle": [
    "An instrument used to produce a high-pitched sound by blowing air through narrow openings, typically made of metal or plastic.",
    "The act or sound of blowing air through one's mouth to create a whistling noise, often used as a signal or to attract attention."
  ],
  "who": [
    "Pronoun used to refer to a person or people previously mentioned or easily identified; for example, \"She asked who was coming to the party.\"",
    "Relative pronoun to form questions or relative clauses; for example, \"I know the person who works at the bank.\""
  ],
  "whole": [
    "Referring to a complete object or thing, without any part missing.",
    "A whole number is an integer, which includes both positive and negative numbers.",
    "In mathematics, when adding or subtracting integers, the term \"whole\" refers to the entire number line (positive and negative).",
    "When referring to food, a whole ingredient means it has not been processed or refined, such as choosing whole wheat bread over white bread.",
    "In a more general sense, the term 'whole' is often used to describe something complete or unbroken, without any damage or faults."
  ],
  "whom": [
    "The object of a verb or preposition, typically used to introduce a subordinate clause that gives information about the person or thing mentioned earlier in the sentence; also called an objective pronoun. For example: \"I asked whom I should invite.\""
  ],
  "whoops": [
    "An exclamation of surprise, realization of a mistake, or apology for an unintentional action or error.",
    "(Informal) A light-hearted expression of regret or embarrassment for an error, typically spoken when realizing one has made a mistake."
  ],
  "why": [
    "An interrogative word, used to ask for a reason or explanation (e.g., \"Why did you miss class today?\")",
    "A preposition, meaning 'due to,' 'owing to,' or 'because of' (e.g., \"He didn't come because he was sick.\")",
    "In music and dance, an exclamation expressing surprise, delight, or other strong emotions."
  ],
  "wick": [
    "A slender, usually cylindrical piece of material (such as cotton, silk, or paper) used in a candle, lamp, or other device to provide a continuous supply of fuel for combustion.",
    "An elongated portion of a flexible substance that can be bent or twisted without breaking; akin to a strand of hair.",
    "A thin strip of absorbent material (such as cotton or paper) used in batteries, fuel cells, and other devices to transport liquid electrolyte between two points."
  ],
  "wicked": [
    "Having a high degree of skill or proficiency in a particular area, as in \"he is wicked at playing the guitar.\"",
    "Intentionally causing harm, difficulty, or suffering to others, as in \"the wicked plan to take over the company.\"",
    "Morally bad or unacceptable, as in \"those wicked actions had severe consequences.\"",
    "Difficult or unpleasant, as in \"we faced a wicked problem to solve.\""
  ],
  "wicker": [
    "A type of flexible material made from interwoven materials, such as willow, rattan, or other woods, often used for making baskets, furniture, and other household items."
  ],
  "width": [
    "The measurement of something from side to side or end to end, indicating how broad it is. For example, the width of a river is measured across its broadest point.",
    "In typography and graphic design, the horizontal space taken up by a character or glyph when set in type or displayed on a screen.",
    "A term used in computing to describe the number of pixels or other units of measurement that span horizontally across a display screen or image.",
    "The extent of an object from one edge to the opposite edge, such as the width of a table or desk.",
    "In mathematics, the width refers to the difference between the maximum and minimum values in a given data set or range."
  ],
  "wife": [
    "A married woman who is joined to her husband in a mutual relationship of affection, responsibility, and partnership.",
    "A term used to describe the female partner in a monogamous relationship or marriage.",
    "A woman who has taken on the role of homemaker, caretaker, and often co-provider for their family.",
    "A term that may also refer to the wife of a particular man or public figure."
  ],
  "wig": [
    "A head covering made of natural or synthetic hair, designed to be worn by people who want to change their hairstyle temporarily or for those experiencing hair loss, often secured in place with combs, clips, or adhesive.",
    "(Obsolete) A headpiece for a knight, having the form of a conical cap covered with plumes or feathers, worn as part of the armor to protect the head and neck; also called an armet or helm."
  ],
  "wild": [
    "Not tamed, domesticated, or cultivated; living or growing in a natural state, especially in contrast to being farmed or raised. For example: \"The deer in the forest were wild.\"",
    "Having an uncontrolled or unrestrained nature; characterized by extreme, unregulated behavior; unbridled. For example: \"His wild laughter echoed through the room.\"",
    "Existing in a natural, uncultivated state; not human-made or altered. For example: \"The hills were covered with wild flowers.\"",
    "Lacking order, control, or restraint; chaotic or unruly. For example: \"There was wild confusion during the evacuation.\"",
    "In a natural and especially original or authentic state; not artificial, insincere, or contrived. For example: \"She had a wild honesty that people admired.\""
  ],
  "wildfire": [
    "An uncontrolled, rapid, and often destructive spread of fire through vegetation in a wild or undeveloped area.",
    "A term used to describe a large-scale natural disaster characterized by an uncontrolled fire burning in a forested or grassland ecosystem."
  ],
  "will": [
    "A verb that expresses intention, desire, or determination to perform an action in the future. For example, \"I will go to the store later.\"",
    "A testamentary instrument by which a person disposes of their property to take effect after death. For example, \"She left her entire estate to her grandchildren in her will.\"",
    "A legal document or declaration that states the terms and conditions under which an action may be performed. For example, \"The company's articles of incorporation are its founding will.\""
  ],
  "willpower": [
    "The ability to control one's own actions, behaviors, or desires, especially in achieving something difficult or resisting temptation.",
    "The strength of character to carry out a decision or plan despite temptations or obstacles.",
    "Mental resolve and determination to accomplish a goal, despite obstacles or temptations."
  ],
  "wilt": [
    "To wither or droop, especially as a result of loss of water from plant tissues due to dryness or heat.",
    "To lose strength, energy, or effectiveness over time.",
    "To become weakened or impotent in one's beliefs or convictions."
  ],
  "wilted": [
    "Dried up, shriveled, or withered due to lack of water, as in a plant that has lost moisture and appears limp and droopy.",
    "Faded or weakened, especially in appearance, as when something loses its original brightness, strength, or vigor over time or due to some external influence.",
    "(Informal) Dejected or discouraged, as when a person's spirits or morale are lower than before due to an event or circumstance."
  ],
  "win": [
    "To gain an advantage, succeed, or come out on top in a competition, game, or situation by having more points, skill, or favorable conditions.",
    "To obtain something desired through effort, skill, or strategy, such as winning a prize, a contest, or the support of others.",
    "To gain control or possession of an object, place, or territory from an opponent or rival through force, negotiation, or other means.",
    "To achieve success in a specific goal or task by overcoming obstacles or opposition."
  ],
  "wind": [
    "A natural movement of air in the Earth's atmosphere, often caused by the uneven heating of the planet's surface by the sun.",
    "A piece of thread, yarn, or cord that is wound around a spool, reel, or core.",
    "A spiraling or curling motion, as in the windings of a staircase or a corkscrew.",
    "A forceful gust of air or breeze, often strong enough to cause discomfort or difficulty in moving.",
    "An informal term for an individual's ideas or beliefs, as in \"He has a different wind from his colleagues.\"",
    "A power source that uses the force of wind to generate electricity, often through wind turbines."
  ],
  "winding": [
    "Forming a series of curves or turns; meandering or circuitous.",
    "The act of winding something, such as thread or yarn, around a core or spool.",
    "A twisting motion or movement, often causing confusion or disorientation.",
    "A path or route that follows a curved or winding course, such as a road or hiking trail."
  ],
  "window": [
    "A transparent panel in a wall, door, vehicle, or other structure that can be opened and closed to provide light, ventilation, and access to the interior or exterior.",
    "An opening on a computer screen or electronic device through which one can view, interact with, and control applications or websites."
  ],
  "winnowed": [
    "Separated or sorted by removing unwanted elements, such as chaff from grain or dirt from stones.",
    "In a game or competition, eliminated or discarded to allow only the best participants to remain.",
    "In a computer program, eliminated or discarded redundant or obsolete data, code, or files."
  ],
  "wipe": [
    "To remove dirt, moisture, or other substances from a surface by rubbing with a cloth, paper towel, or similar object.",
    "To erase data, files, or programs on an electronic device so that they can no longer be accessed.",
    "To clean or clear away something completely, as in \"wipe out\" or \"wipe out the competition.\"",
    "In sports, to hit a ball in such a way that it goes out of play.",
    "To make someone or something less important, noticeable, or effective by doing something else that is better or more popular."
  ],
  "wire": [
    "A thin, flexible, usually round metal rod or strand, typically made of copper or aluminum, used to transmit electrical currents or for various forms of fastening or suspension.",
    "To send a message or information using coded language or secret signals; to communicate clandering or surreptitiously information between the two sides."
  ],
  "wireless": [
    "Not requiring wires to transmit signals, data, or power between devices; using radio waves instead."
  ],
  "wished": [
    "Desired or longed for something; expressed a wish for something to happen, be true or exist in the past, present or future.",
    "(Past tense of \"wish\", which means to express a desire or hope that something would happen.)",
    "(Used with \"had\" and a verb in the past participle form, meaning that someone regrets not doing something; also used in subjunctive mood to express hypothetical situations.)"
  ],
  "wisp": [
    "A thin, usually tapering thread or strand of material, such as smoke, mist, or straw.",
    "A small bunch or cluster of something, such as grass or leaves.",
    "A faint or weak indication of something, like a vague memory or hint."
  ],
  "wistful": [
    "Characterized by a yearning for something that is lost or has passed, often accompanied by a sense of sadness or longing.",
    "Marked by a thoughtful or dreamy expression due to reflecting on the past or thinking about unrealized desires or possibilities."
  ],
  "wistfully": [
    "In a way that expresses longing, sadness, or a yearning for something that is gone, unattainable, or imaginary.",
    "With feelings of regret for something that has already happened and cannot be changed.",
    "Characterized by feelings of nostalgia or reminiscence for past experiences or relationships that are no longer present."
  ],
  "wistfulness": [
    "A feeling of longing or yearning for something that is lost, gone, or no longer possible.",
    "An expression of sadness or melancholy due to the memory of happier times."
  ],
  "with": [
    "Accompanied by; together with",
    "In association or combination with",
    "Used to indicate the person, thing, or place involved in an action or state",
    "Used to introduce a clause that modifies or is complementary to the main clause"
  ],
  "withdrawal": [
    "The act of withdrawing oneself from social interaction or activity, such as leaving a party early or spending less time with friends.",
    "A difficult condition experienced by people when they stop using addictive substances or behaviors, causing symptoms like irritability and anxiety."
  ],
  "withering": [
    "Drying up or shriveling, as of leaves or petals on a plant when deprived of water.",
    "Fading away or gradually losing vigor, strength, or freshness due to the passage of time.",
    "A withering look or glance, expressing disapproval or contempt.",
    "A sharp and biting verbal attack, criticism, or sarcasm."
  ],
  "withhold": [
    "To keep (money, information, etc.) from someone who is entitled to receive it.",
    "To prevent something (such as a decision) until certain conditions are met.",
    "To refrain from giving or expressing something, especially because of fear or caution.",
    "In taxation, to retain part of an employee's earnings for federal, state, or local income taxes without withholding it from the paycheck.",
    "(In sports) To prevent a player or team from participating due to disciplinary action or violation of rules."
  ],
  "wizened": [
    "Dried up or shriveled, as from old age or long exposure to the elements.",
    "Having a wrinkled or gnarled appearance, often due to aging or weathering.",
    "Possessing great wisdom or experience, sometimes in a sarcastic or mocking tone."
  ],
  "wobbled": [
    "To move unsteadily, typically because of a lack of balance or support, as in \"The chair wobbled when I sat on it.\"",
    "To sway or oscillate unpredictably, as in \"The tree branches wobbled in the wind.\"",
    "To fluctuate or waver, as in \"His confidence wobbled when he encountered a difficult problem.\"",
    "To be uncertain or indecisive, as in \"After hearing conflicting advice, she wobbled about what decision to make.\""
  ],
  "women": [
    "A female human being, distinct from a girl or an adult woman.",
    "The plural form of \"woman.\"",
    "A collective term referring to the female gender in general.",
    "A group of women organized for a specific purpose, such as politics or sports."
  ],
  "wonder": [
    "A feeling of amazement, surprise, or curiosity about something that is strange, unusual, or unexplained.",
    "An object or phenomenon that causes such a feeling.",
    "To express doubt, confusion, or skepticism about something.",
    "To feel or express admiration or wonderment at someone's abilities or achievements.",
    "To cause amazement, surprise, or astonishment in others; to be remarkable or astounding."
  ],
  "wondered": [
    "To think or speculate about something in a curious or puzzled manner.",
    "To be amazed or astounded by something; express wonder."
  ],
  "wonders": [
    "Objects, places, or phenomena that inspire great admiration or awe due to their unusual or extraordinary nature.",
    "A state of being perplexed or puzzled by something difficult to understand or explain.",
    "Feeling surprise, amazement, or astonishment in relation to an event, situation, or person.",
    "An instance of being deeply impressed and curious about something unknown or mysterious."
  ],
  "wood": [
    "A collection of closely-knit fibrous cellulose tissues in plants, forming their main structural framework for support, particularly in trees and large shrubs.",
    "An area covered chiefly with trees or other woody plants.",
    "Material obtained from trees, typically used for making furniture, flooring, and construction."
  ],
  "words": [
    "A set of written or spoken symbols representing language, used to convey meaning and communicate ideas.",
    "A specific statement or expression, often used in conversation or writing.",
    "An amount or number, especially when referring to a sum of money.",
    "In computer programming, a sequence of characters used to represent instructions for the program or data to be processed.",
    "In music, a term for the text or lyrics of a song or composition.",
    "In legal contexts, a written or spoken statement made under oath in a court of law."
  ],
  "work": [
    "Effort put into an activity to achieve a result, especially by using physical or mental energy.",
    "A job, employment, or occupation that one does regularly in exchange for payment.",
    "A place where people work, such as a factory or office building.",
    "A written or printed piece of text, especially if it is long and serious.",
    "An action or a series of actions taken to bring about political or social change."
  ],
  "workmanship": [
    "The skill and care with which something is made, constructed, or performed.",
    "The quality of being well-made or expertly done.",
    "The level of craftsmanship shown in a particular item or job.",
    "The artistic or practical ability shown by a person in their work."
  ],
  "world": [
    "The whole of human activity, society, and experience throughout the world.",
    "All the people living on Earth at any time.",
    "The Earth as a planet, including its physical features, life forms, atmosphere, and weather systems.",
    "A particular region or sphere of interest, knowledge, or activity.",
    "A global community, culture, or system."
  ],
  "worn": [
    "Having undergone wear, as from frequent use, friction, corrosion, etc.; worn out.",
    "Showing signs of this condition; appearance of having been used a great deal.",
    "Past tenses and past participles of the verb 'wear.'",
    "In clothing: Made to fit loosely in order to be comfortable or flattering; loose-fitting."
  ],
  "worsen": [
    "To make a situation, condition, or state worse or less favorable.",
    "To cause an existing problem to become more serious or difficult.",
    "To decline in quality, value, or importance over time.",
    "To exacerbate or intensify a problem or difficulty."
  ],
  "worst": [
    "The most terrible, severe, or unfavorable of two or more things being compared; least desirable or favorable.",
    "(In sports) Being last in order of merit."
  ],
  "worthwhile": [
    "Having value, merit, or importance; deserving of one's effort, time, or attention.",
    "Productive or beneficial in some way; yielding a positive result or effect."
  ],
  "would": [
    "Used to form the simple past tense of the verb \"will\" (e.g., He would play soccer on Saturdays).",
    "Used to express hypothetical or unlikely situations (e.g., If I had a million dollars, I would travel around the world).",
    "Used in conditional sentences to indicate the hypothetical or probable outcome if a condition is met (e.g., If you studied harder, you would get better grades)."
  ],
  "wound": [
    "An injury caused by a sharp object or force, typically resulting in a break in the skin and possibly damage to underlying tissues.",
    "A place where there is an opening in the skin as a result of a cut or blow; an open sore.",
    "To inflict such an injury on someone.",
    "To cause emotional or psychological pain; hurt."
  ],
  "woven": [
    "Made by interlacing threads, yarns, strands, or other flexible materials to form a textile or structure; created through weaving.",
    "To form (something) by interlacing materials such as threads, yarns, or fibers.",
    "To make something (such as a pattern, design, or image) by combining different elements in a skillful way."
  ],
  "wraithlike": [
    "Having a ghostly, ethereal, or apparitional appearance.",
    "Moving or appearing in a way that suggests a ghost or spirit.",
    "Seeming to be almost invisible or insubstantial, as if made of mist or smoke.",
    "Exhibiting a thin and pale appearance, resembling the living dead."
  ],
  "wrap": [
    "To enclose or cover something in something flexible, such as paper, cloth, or foil.",
    "To encircle or envelop with something, especially to secure or protect.",
    "To twist and shape (something) into a coil or spiral form.",
    "To move or cause to move rapidly around or along something in a continuous path; encompass.",
    "To cover oneself or be covered by something, such as a garment or blanket."
  ],
  "wrathful": [
    "Showing intense anger or fury, often in response to perceived injustice or provocation.",
    "Disposed to inflict punishment, retribution or vengeance upon someone for a wrong committed or believed to have been committed.",
    "Associated with the state of being angry or furious, expressing anger and resentment."
  ],
  "wren": [
    "A small, long-tailed bird with a distinctive pointed beak, found in many parts of the world.",
    "A type of knot or weaving that is tight and compact, often used to join ropes or cords together.",
    "In music, a term referring to a group of related words, such as a chorus or refrain, that are repeated throughout a song."
  ],
  "wrench": [
    "A hand tool used to hold, turn or tighten/loosen nuts, bolts, or other threaded fasteners, typically consisting of a T-shaped handle with one or two adjustable jaws that grip the object being turned.",
    "To twist or wrench something violently out of shape or position, usually by force.",
    "A sudden, sharp twist or turn, often causing injury or dislocation."
  ],
  "wrens": [
    "Wrens refer to a group of small, perching birds found in the family Troglodytidae. They are known for their distinctive plumage patterns and song.",
    "Additionally, wrens may refer to certain individuals or entities that share the name or characteristics with these birds, such as sports teams, mascots, or fictional characters."
  ],
  "wretched": [
    "Extremely unhappy, unfortunate, or miserable",
    "Of very poor quality, badly made, or in a bad condition",
    "Deserving pity or sympathy because of suffering, misfortune, or weakness"
  ],
  "wrinkle": [
    "A line, ridge, or furrow on the surface of something, especially on a piece of fabric or clothing when it is creased or folded.",
    "A small, shallow groove or indentation in the skin, typically caused by ageing or exposure to sunlight, that gives the appearance of being like a small wave or ripple."
  ],
  "wrist": [
    "The joint between the hand and the forearm, allowing for flexibility and movement.",
    "A part of the human body that is prone to fractures or sprains due to its fragile nature.",
    "In watches, a term referring to the part where the watch strap attaches to the face of the timepiece."
  ],
  "write": [
    "To create written communication using letters, symbols or characters on a surface or in an electronic document.",
    "To compose something such as a book, article, story, or poem by selecting words and arranging them into meaningful sentences and paragraphs.",
    "To record information, events, or thoughts in writing for future reference or to share with others.",
    "To complete a written task, assignment, or report as part of an educational or professional activity."
  ],
  "written": [
    "Produced by handwriting using pen, pencil, or other writing instruments on paper or another surface.",
    "Created through typing on a computer, typewriter, or other electronic device, resulting in text displayed on a screen or printed on paper.",
    "Expressing something in written form, such as composing a letter, document, article, or book.",
    "Depicted or represented visually through drawings, symbols, or pictures instead of being expressed verbally or orally."
  ],
  "wrong": [
    "Not in accordance with facts, truth, or a standard; incorrect, erroneous, or false.",
    "Inappropriate or unsuitable behavior or actions that go against accepted norms, rules, or moral principles.",
    "Something that is not right or correct in relation to an expectation or a situation."
  ],
  "wry": [
    "Twisted or bent out of shape; contorted.",
    "Characterized by ironical or sardonic humor; witty in a biting or caustic way.",
    "Having a dry, twisted, or unnatural appearance.",
    "(Of a person) Expressing or revealing strong feelings of sarcasm, cynicism, or bitter humor."
  ]
}