{
  "quack": [
    "An unqualified person who pretends to have medical knowledge, often in the context of alternative medicine or healing practices.",
    "A harsh, contemptuous sound made by expressing disapproval or anger towards someone or something.",
    "A noisy sound made by a duck or goose, typically when they are in water."
  ],
  "quadrant": [
    "A part of a circle, which is formed by an arc and its two radii, having a shape like the fourth part of a circle; one of four such parts into which a circle can be divided by drawing any diameter and then two perpendicular lines to it from the ends of the diameter as intersecting axes.",
    "Any of the four sections of a circle's interior or exterior that are formed by connecting the endpoints of a line with two equal lengths; these sections, often used to describe angles or distances on a graph or chart in mathematics and science."
  ],
  "quadratic": [
    "Relating to, having, or expressing a mathematical equation of the form ax^2 + bx + c, where a, b, and c are constants and x is a variable. These equations have a parabolic graph.",
    "Having or involving the square root or any power greater than one."
  ],
  "quadrille": [
    "A square dance involving four couples who perform set figures and movements in a fixed pattern, typically with music playing in a waltz time signature."
  ],
  "quadruped": [
    "An animal that walks on four legs, typically with hooves, paws, or cloven feet.",
    "A type of four-legged land mammal, including horses, dogs, and cows, among others.",
    "A term used to describe any creature that has a body structure adapted for movement on four limbs."
  ],
  "quadrupedal": [
    "Describing an animal that walks with four feet or legs, such as a dog, horse, or cow.",
    "A characteristic of animals that are adapted to move on land by using all fours, such as lizards and some primates."
  ],
  "quagmire": [
    "A soft, wet, and often muddy ground that makes it difficult to walk or move without sinking in, especially on a marshy area or a bog.",
    "A difficult situation from which it is hard to escape or find a solution; a dilemma."
  ],
  "quaintly": [
    "In a charmingly old-fashioned or unusual way; characterized by simple, straightforward charm; picturesque or delightful in a unique, antiquated manner."
  ],
  "qualified": [
    "Possessing the necessary abilities, skills, knowledge, or experience to perform a particular task or job.",
    "Meeting the minimum requirements for something such as a position or a course of study.",
    "Being legally authorized or competent to carry out a specific function or duty.",
    "Having the required credentials, certifications, or education for a given field or profession.",
    "In sports, having fulfilled the eligibility criteria to participate in an event or competition."
  ],
  "qualifying": [
    "Meeting the necessary requirements, standards, or conditions to be eligible for something (e.g., qualifying for a competition, meeting the qualifications for a job).",
    "Acting as a means of determining, assessing, or establishing someone's suitability for a specific purpose or role (e.g., a qualifying exam, a qualifying interview).",
    "Establishing something as valid or genuine by providing evidence or proof (e.g., qualifying an argument, qualifying information)."
  ],
  "quandary": [
    "A state of being uncertain or perplexed about which of several alternatives to choose, often because they all seem equally desirable or undesirable.",
    "A difficult problem or situation that causes doubt or uncertainty; a dilemma.",
    "A difficult question or decision, especially one that involves choosing between two options that are both unattractive or undesirable."
  ],
  "quantify": [
    "Express something as a number, quantity, or measure.",
    "Determine or establish the amount, scope, or importance of something by measuring it.",
    "Calculate or ascertain the numerical value of something."
  ],
  "quarrel": [
    "A loud argument, disagreement or dispute between two people.",
    "An exchange of gunfire or projectiles between opposing forces.",
    "To fight or disagree with someone, often heatedly.",
    "A state of hostility or unfriendliness between nations, groups, etc."
  ],
  "quarrelsome": [
    "Disposed to quarrel or argue, often easily provoked into conflict or disagreement.",
    "Tending to engage in frequent or intense disagreements or disputes.",
    "Predisposed to fighting or bickering with others, even over trivial matters."
  ],
  "quarry": [
    "A place where stones, rocks, or minerals are extracted from the ground.",
    "An area where hunting animals are kept for sporting purposes.",
    "A person who is actively pursued, especially in sports or competitions."
  ],
  "quartz": [
    "A hard, glassy mineral composed of silica, occurring in various colors and forms; a common constituent of many rock types.",
    "A type of electrical component used in filters and other devices to prevent high frequency signals from interfering with lower frequency circuits."
  ],
  "quatrain": [
    "A poetic form consisting of four lines that usually follow a specific rhyme scheme and meter.",
    "A group of four lines of verse that have a particular rhythm or metrical pattern.",
    "Four stanzas in poetry, often with a consistent rhyme scheme or metrical pattern."
  ],
  "quaver": [
    "A slight shake or tremor, often in a person's voice or hands.",
    "A rapid vibration of sound, typically in music for expressing nervousness or uncertainty."
  ],
  "quavered": [
    "Trembled or shook, often due to fear or anxiety.",
    "(Music) Played with a slight, wavering tone, as if unsure of the correct note."
  ],
  "quavering": [
    "Trembling, shaking, or quivering in a weak or unsteady manner, often due to fear, emotion, or physical weakness.",
    "Producing or characterized by a soft and wavering sound, as if unsure or unstable, such as a quavering voice or musical note."
  ],
  "quay": [
    "A long and wide platform, usually by the side of a water body such as a river or sea, which allows boats and ships to moor and load/unload goods.",
    "An area near a harbor or river where ships can dock to transport goods and passengers. It's typically made of materials like stone, concrete, or timber that are able to withstand the weight of large vessels."
  ],
  "queen": [
    "A female sovereign ruler, especially a queen regnant as distinct from a king.",
    "The wife or widow of a king.",
    "An empress.",
    "A title given to certain powerful women in history, such as Queen Victoria or Cleopatra.",
    "In chess, the most powerful piece that can move any number of squares along its row or column.",
    "In card games, a queen card.",
    "A female bee that is capable of laying eggs and is the only sexual member of the colony."
  ],
  "quench": [
    "To put out a fire by depriving it of heat or fuel, often using water or another liquid.",
    "To satisfy a thirst by drinking something, such as water or a refreshing beverage.",
    "To stop an intense feeling or reaction, such as anger or pain, sometimes with physical contact or words of comfort."
  ],
  "querulous": [
    "Given to complaining or expressing discontent, especially in a petty way.",
    "Characterized by persistent, irritable, and peevish behavior.",
    "Expressing or marked by frequent, whining complaints or expressions of dissatisfaction.",
    "Complaining in an irritatingly petulant manner."
  ],
  "question": [
    "An inquiry or request for information, often seeking a response that can be either true or false; may also refer to the act of asking such an inquiry.",
    "A point of disagreement or controversy; a matter debated or called into question.",
    "In mathematics and logic, a problem or challenge presented to be solved or answered, often requiring reasoning or critical thinking."
  ],
  "questionnaire": [
    "A written or electronic form used to collect data from a group of people, typically containing a series of questions or prompts with space for responses.",
    "A set of inquiries designed to gather specific information or opinions from respondents.",
    "A tool used by researchers, teachers, and organizations to obtain feedback, insights, or preferences from individuals through a list of structured questions."
  ],
  "questions": [
    "A set of inquiries or inquires, typically designed to elicit information or test understanding.",
    "An instance of uncertainty or doubt, often prompting further investigation or inquiry.",
    "A point or matter for inquiry; a subject for consideration or discussion."
  ],
  "quibble": [
    "To make petty, often pedantic objections or raise minor points of disagreement, especially in order to avoid facing a more important issue.",
    "Make unnecessary distinctions; nitpick."
  ],
  "quibbled": [
    "Argued over minor points, often to a petty extent, usually in order to avoid making a decision or taking responsibility for something.",
    "Disputed over trivial or insignificant matters, often for the sake of argument rather than finding a solution."
  ],
  "quiche": [
    "A savory open-faced pie made of pastry dough, a custard filling often containing eggs, milk or cream, and various ingredients such as vegetables, meats, or cheeses."
  ],
  "quiescent": [
    "Not active or functioning, especially temporarily or in a state of rest; dormant.",
    "In botany, referring to an organism that is not growing or reproducing, often due to unfavorable conditions such as drought or lack of nutrients.",
    "In medicine, describing the temporary cessation of symptoms or activity of a disease, condition, or symptom.",
    "In physics, pertaining to particles with no movement or energy, typically in relation to subatomic particles.",
    "In engineering, used to describe a system that is temporarily shut down or not operational."
  ],
  "quiet": [
    "Free from noise or disturbance; tranquil.",
    "Not talking or making much noise; silent.",
    "Calm, peaceful, or uneventful.",
    "Not showing strong emotions or protest; subdued.",
    "(Of a color) pale or light, especially in comparison with another of the same type."
  ],
  "quill": [
    "A bird's feather, particularly from a goose or swan, that was sharpened at one end to write with ink on paper in early days of writing before the use of pens.",
    "A pen made by hollowing out a bird's feather and dipping it into ink for writing on surfaces like parchment or paper."
  ],
  "quilt": [
    "A coverlet made by sewing together layers of different fabrics, typically with a decorative design on the top layer.",
    "A pattern or design created by stitching together pieces of fabric to form a single piece.",
    "An assembly of materials, often used for bedding or insulation purposes, formed from layers of fabric sewn together with a decorative design on the surface."
  ],
  "quilted": [
    "Having two or more layers of fabric sewn together with a decorative pattern of stitches, creating a textured surface.",
    "(In sewing) Stitched together in a regular pattern to create a raised design on the surface.",
    "(Of clothing or bags) Made from fabric that has been quilted for extra warmth and insulation."
  ],
  "quinella": [
    "In horse racing, a bet that requires the gambler to correctly predict the first two finishers in exact order, without concern for which comes in first, but with neither the first nor second finisher being the one selected. It is essentially a combination of an exacta and a win bet.",
    "(Optional) If 'quinella' has a different or additional meaning, please provide it below."
  ],
  "quinoa": [
    "A crop plant grown primarily for its edible seeds, which are a rich source of protein, fiber, vitamins, and minerals.",
    "A food that has gained popularity as an alternative to rice or pasta due to its nutritional value and versatility in cooking.",
    "A plant native to South America, specifically the Andean region, where it has been cultivated for thousands of years."
  ],
  "quintessential": [
    "Represents the most perfect, typical, or distinctive example of a quality or group; emblematic.",
    "Essential, central, or defining characteristics of something.",
    "A representative example of something.",
    "Expressing the very essence of something; archetypical."
  ],
  "quintillion": [
    "A number representing five followed by fifteen zeros, specifically equal to 10^18 or 1,000,000,000,000,000,000 in the scientific notation.",
    "An extremely large quantity or amount that is difficult for humans to comprehend, often used in fictional scenarios or as a hyperbole."
  ],
  "quintuple": [
    "To increase by a factor of five, typically in terms of quantity or size.",
    "Five times, such as five of something repeated in a row.",
    "A number that is the product of all integers from 1 to 5.",
    "In sports, to score five goals or points in a game."
  ],
  "quip": [
    "A brief, witty, or humorous remark.",
    "An amusing or clever saying or joke.",
    "A clever or playful retort or response."
  ],
  "quirk": [
    "A strange, odd, or unusual feature, behavior, or characteristic of something or someone.",
    "A peculiar, sometimes amusing detail or aspect of a person or thing that sets them apart from others.",
    "An idiosyncrasy or eccentricity exhibited by an individual."
  ],
  "quirkier": [
    "More unconventional, odd or peculiar; displaying an unusual quality or characteristic that sets it apart from others of its kind."
  ],
  "quirkiness": [
    "The quality of being strange, peculiar, or unusual in behavior or appearance.",
    "A characteristic oddity, eccentricity, or idiosyncrasy exhibited by a person or thing.",
    "An unconventional or distinctive trait that makes something or someone interesting and memorable."
  ],
  "quirky": [
    "Characterized by unusual or odd traits, behaviors, or appearances that can be perceived as amusing or charming.",
    "Expressing a unique or unconventional style in one's ideas, opinions, or creative work.",
    "Showcasing idiosyncrasies or individualistic tendencies in behavior, personality, or preferences."
  ],
  "quisling": [
    "A person who betrays their country by cooperating with an enemy occupying force, especially during World War II.",
    "Generally, a traitor or collaborator who helps the enemy in times of war or conflict.",
    "By extension, any individual who is seen as betraying their principles or values, often for personal gain or advantage."
  ],
  "quiver": [
    "A container for arrows, typically made of wood, leather, or plastic, that holds the arrows securely when not in use.",
    "To shake or tremble, as if from fear or excitement.",
    "To make a quick, jerky movement, like a bird's wings quivering."
  ],
  "quivering": [
    "Trembling or shaking, often due to fear, cold, or weakness.",
    "Vibrating or pulsating, as in the case of an object or substance under stress.",
    "In archery, a container used to hold arrows or bolts; also known as an arrow holder or bow case."
  ],
  "quivers": [
    "Shake or tremble uncontrollably as a result of fear, coldness, or extreme emotion.",
    "Slightly bend or sway back and forth, especially when held by one end, like an object made of flexible material.",
    "Make or cause (something) to make short, rapid movements."
  ],
  "quixotic": [
    "Characterized by an impractical idealism and a disregard for realistic goals, often resulting in failure or disappointment.",
    "Having a romantic or dreamy nature, being inclined to imagination or fancy rather than the sensible or practical.",
    "Showing unpredictability or capriciousness in behavior; mercurial."
  ],
  "quixoticism": [
    "A tendency to pursue ideals, goals, or aspirations that may be impractical or unrealistic in a romanticized or chivalrous manner; idealistic impulsiveness or extravagance."
  ],
  "quixotism": [
    "A type of behavior or attitude characterized by idealism, chivalry, and romantic impulsiveness, often leading to unrealistic or self-defeating actions. This is named after Don Quixote, the main character in Miguel de Cervantes' novel who displayed such behavior."
  ],
  "quiz": [
    "A short test given to students, usually in a classroom setting, to assess their knowledge on a particular topic or subject.",
    "To ask someone a series of questions, typically for amusement, entertainment, or educational purposes.",
    "Informally, to look at someone or something carefully and critically, often as if preparing to ask questions about it."
  ],
  "quizzical": [
    "Expressing or characterized by a perplexed or questioning look, especially in the eyes.",
    "Causing curiosity or doubt; mysterious or puzzling.",
    "Showing an expression of disbelief or skepticism."
  ],
  "quota": [
    "An amount or share of something, especially in terms of a fixed limit or target.",
    "A system used to manage distribution of resources, jobs, etc., based on proportional allocation for each group involved.",
    "In sports, a regulation specifying the maximum number of players from one team who may participate in a particular event."
  ],
  "quotation": [
    "A passage from a text, speech, or other source that is repeated or cited by someone else to support, illustrate, or provide evidence for an idea or point of view.",
    "An expression of the price at which a commodity, service, or security can be bought or sold.",
    "A statement attributed to a particular person, especially one regarded as a wise saying or interesting comment.",
    "A citation of a specific passage or part from a literary work, used for study, review, or reference purposes.",
    "An act of expressing something in terms of a language other than the original language, often done for translation or understanding purposes."
  ],
  "quote": [
    "To give an example of words, phrase, or statement used by someone else in order to support or illustrate a point.",
    "To reproduce or cite a passage from a written work or a spoken utterance by someone.",
    "A selection from a larger text or speech, often set off by quotation marks or as a block of text.",
    "An exact statement or passage copied from a source to be used in a document, article, report, or conversation.",
    "To ask for or give the cost, rate, or price for something as it appears in an official or published source.",
    "A statement that reflects the terms of an agreement, contract, or policy."
  ],
  "quotient": [
    "The result of a division operation, usually expressed as one number divided by another; the two numbers being divided are called the dividend and the divisor, respectively. For example, if you divide 15 by 3, the quotient is 5 (written as 15 ÷ 3 = 5)."
  ]
}