{
  "yacht": [
    "A large, luxurious boat used for pleasure cruises or racing on water.",
    "A ship designed specifically for sailing or racing, often with amenities for leisure activities and accommodations."
  ],
  "yard": [
    "An open space or area of land, usually rectangular in shape and used as a courtyard or garden.",
    "A unit of length, equivalent to three feet (91.44 centimeters), commonly used in measuring distances and areas.",
    "An enclosed outdoor area for keeping animals, vehicles, or storing materials; also known as a stable, garage, or shed.",
    "An open area around a building where airplanes are parked or repaired; also called an aerodrome or airfield.",
    "In sports like cricket and baseball, the area between the two sets of wickets or bases, where the players field or run."
  ],
  "yardstick": [
    "A flat, thin piece of metal or wood, usually graduated in inches or centimeters, used for measuring length or distance.",
    "An instrument for measuring or comparing the quality, size, value, etc., of something, often used as a standard by which to judge others; a benchmark.",
    "A unit of measurement equal to one hundredth part of a cable (a rod); a surveyor's measure."
  ],
  "yarn": [
    "A continuous length of interlocked fibres, such as wool, cotton, or silk, suitable for knitting, weaving, or crocheting.",
    "An informal term for a conversation or anecdote, especially one that is long and convoluted."
  ],
  "yarns": [
    "A continuous length of interlocked loops of fiber, typically used for knitting or weaving.",
    "A long, twisted strand of natural or synthetic fibers, which can be spun into thread or used directly for various purposes such as making clothing, blankets, carpets, etc.",
    "A long narrative or story, often told by an individual or a group, typically involving fictional elements and events."
  ],
  "yawn": [
    "An act of opening one's mouth wide and taking in air, typically as a response to being tired or bored.",
    "To open one's mouth wide in this manner, often unconsciously.",
    "A gaping opening or space, metaphorically compared to yawning."
  ],
  "year": [
    "A period of time equivalent to the amount it takes the Earth to orbit around the Sun, typically divided into twelve months or 365 days.",
    "Any period of time measured in units of calendar years (e.g., I've been doing this job for four years).",
    "An annual period or cycle, as in \"a yearly event\" or \"the cycle of the seasons\"."
  ],
  "yearn": [
    "To feel a strong desire or longing for something, often implying an unfulfilled need or lack of satisfaction in one's current situation.",
    "To have a deep emotional attachment or affection towards someone or something."
  ],
  "yearning": [
    "A strong desire, wish, or longing for something or someone; a deep emotional need or craving that may not be fulfilled yet.",
    "A state of feeling empty or incomplete without a specific person, object, or experience.",
    "An intense feeling of wanting to achieve or possess something that is currently out of reach."
  ],
  "years": [
    "A period of time equal to the length of one complete cycle of seasons, typically associated with the Earth's orbit around the Sun, which is approximately 365 days.",
    "An amount of time that represents a significant duration or passage, often used in phrases like \"in a few years\" or \"when she was younger.\"",
    "(In accounting) A financial period of twelve months used for recording and reporting business transactions."
  ],
  "yell": [
    "To shout at a high volume, often with an angry or excited tone.",
    "To make a loud noise similar to a human shout, typically in reference to the sound made by an animal such as a seagull or monkey.",
    "To call out (someone) loudly or urgently."
  ],
  "yellow": [
    "A color between green and orange in the visible spectrum of light, perceived by humans as a stimulation of their medium-long wavelength receptors, and evoked by light with a dominant wavelength around 570–590 nm.",
    "An object or substance that appears to have this color when viewed under white light.",
    "A primary color in painting and art, which is made by mixing blue and red pigments.",
    "A person or thing with a yellow complexion due to jaundice, the presence of bilirubin in the blood."
  ],
  "yellowcake": [
    "A term used to describe a raw form of uranium oxide, typically a bright yellow color, often produced from processing mined uranium ore. It serves as a crucial starting material for creating nuclear fuel and weapons.",
    "The name derived from its appearance and the cake-like texture it takes after being processed."
  ],
  "yellowed": [
    "Discolored by yellow or turned yellow due to age, exposure to light, or other factors.",
    "Faded or weakened in color, appearing yellowish rather than bright or vivid.",
    "Covered or overlaid with a yellow substance or material, such as a film or varnish.",
    "Made or become pale or weak in color, as if due to illness or fatigue."
  ],
  "yellowest": [
    "The most intense or bright shade of yellow."
  ],
  "yellowish": [
    "Of a color that is a mix between yellow and white, similar to the hue of pale lemon or butter.",
    "Pertaining to something that has a slight or partial tint of yellow in its appearance."
  ],
  "yells": [
    "To shout in a loud and forceful manner, often expressing strong emotions such as joy, anger, or fear.",
    "To produce sounds by forcibly expelling air from the lungs through the vocal cords, typically with an abrupt onset of high intensity."
  ],
  "yelp": [
    "A sudden, high-pitched sound produced by a dog when it is surprised, frightened, or in pain.",
    "An online platform for reviewing businesses, such as restaurants and stores, where users can share their experiences and opinions about the quality of service and products provided."
  ],
  "yeoman": [
    "A freeholder; a farmer who owns his land, usually of the middle class in medieval England.",
    "A person who is competent and reliable at their job or task.",
    "In heraldry, a term used to describe a commoner or gentleman.",
    "An unqualified lawyer who was not part of the legal profession.",
    "A rank or title given to an officer in the United States Navy during the 18th and early 19th centuries."
  ],
  "yeomanry": [
    "A group of skilled farmers or landowners who provided military service, often on horseback, during times when standing armies were not common in a society."
  ],
  "yoke": [
    "A wooden beam that fits across the necks of two animals, allowing them to work together in pulling a load or plowing a field.",
    "A bar or beam used for supporting or fastening something; a crossbeam.",
    "The crosspiece of a harness that goes over an animal's shoulders or across its back.",
    "An arrangement where two people or groups work together, especially in sharing responsibilities or tasks."
  ],
  "yolk": [
    "The yellow part of an egg, which is rich in nutrients and used as a food ingredient for baking or cooking.",
    "A central or essential part that serves as the main source of energy or resources; core element.",
    "(Computing) The primary memory region where data is stored or processed directly by hardware components, such as the CPU registers or ROM."
  ],
  "yolked": [
    "Having two objects connected together, typically with a chain or rope, so that they can be pulled or moved together.",
    "To cover something with a material such as yarn, straw, or reeds to make it more durable or waterproof.",
    "In aviation, the process of connecting the engines of an aircraft to the landing gear so that they can be easily started and stopped during taxiing."
  ],
  "yolklike": [
    "Resembling a yolk in appearance, texture, or function.",
    "Consisting of or containing yolks, as in eggs or other food items."
  ],
  "you": [
    "The second person singular or plural pronoun, used to refer to the person or persons spoken to or addressed.",
    "A grammatical category in English for marking agreement between a subject and its verb, indicating the person who performs an action or is represented by the noun.",
    "In certain forms of address, such as in titles or honorifics, \"you\" can be used to show respect, politeness, or formality towards the addressee.",
    "In informal language, \"you\" may also be used colloquially to imply shared understanding between two or more parties, often used in statements such as \"you know\".",
    "\"You\" is occasionally employed as an emphatic pronoun, reinforcing a point or assertion made by the speaker, i.e., \"I told you so!\""
  ],
  "young": [
    "Not old; relatively new or recent in age.",
    "Recently born, grown, developed or produced.",
    "Of or relating to an individual in the early stages of life or development.",
    "Informal: A young person or animal, especially when being referred to as a group.",
    "Informal: Fresh, new, or innovative; not old-fashioned or outdated."
  ],
  "your": [
    "Possessive determiner, used to show ownership or association with the person or thing being referred to. For example: \"Your car is parked in front of my house.\"",
    "Possessive pronoun, used to replace a noun with the understanding that it represents something belonging to the person being addressed or implied. For example: \"Please return this book and your pen to me.\""
  ],
  "yourself": [
    "Refers to oneself as the subject of an action or state, often used as the object of a verb or preposition. For example, \"I helped myself to some cake\" and \"She gave it to herself.\""
  ],
  "youth": [
    "The period of time in one's life when they are young, typically between childhood and adulthood.",
    "A person who is young or in the early stage of their lives.",
    "Young people collectively, as a demographic group, often with specific reference to their characteristics, behavior, culture, etc."
  ],
  "yuppiedom": [
    "The social and cultural phenomenon of young urban professionals, characterized by their affluence, aspirational lifestyle, and high-profile consumption patterns."
  ]
}